[
    {
        "POL": "POL-144117",
        "mmsId": "9952213808301401",
        "SortDate": "2024-05-13",
        "AccessModel": "None",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Logevall, Fredrik, 1963- editor.; Cuddy, Brian, editor.",
        "Author": "",
        "Format": "E",
        "isbn13": "9781469671147",
        "ISBNS": "9781469671161; 1469671166; 1469671131; 9781469671130; 146967114X; 9781469671147",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "2022-11-30",
        "ExpPortfolioActivationDate": "2022-11-30",
        "ReportingCode": "History",
        "Title": "The Vietnam War In The Pacific World /",
        "POtitle": "The Vietnam War In The Pacific World / Edited By Brian Cuddy And Fredrik Logevall. (jstor E-books Collection)",
        "VendorName": "GOBI - Library Solutions from EBSCO",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-13",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "Fire in the American lake: towards a regional turn in Vietnam War studies / Brian Cuddy and Fredrik Logevall -- British neocolonialism in Malaya and Singapore, and U.S. empire in the Pacific / Wen-Qing Ngoei -- Made in Britain: the fantasy driving Australia's involvement in the Vietnam War / Greg Lockhart -- The war of Southeast Asia: falling dominoes, the 1967 Clifford-Taylor mission, and the fight for the stability of the Pacific world / A. Gabrielle Westcott -- A far greater prize than Vietnam: the United States, Indonesia, and the Vietnam War / Mark Atwood Lawrence -- The view from the hill: Hawai'i's congressional delegation and the struggle for peace in Vietnam and equity at home, 1964-1975 / Marc Jason Gilbert -- GI resistance and transpacific activism in Iwakuni during the Vietnam War: a piece of forgotten history / Noriko Shiratori -- The U.S. military's R&R program in Taipei, 1965-1972 / Zach Fredman -- Taiwanese economic assistance to South Vietnam, 1955-1975 / Jason Lim -- The \"Vietnamese\" skirt and other wartime myths in Lee Yun-gi's \"Trigonometric functions\" / Alice S. Kim -- The American-led military coalition in Vietnam: interests, incentives, and interpretations / David L. Anderson -- LBJ's Hessians 'Korean troops' dispatch to Vietnam / Christopher Lovins -- Strengthening the regime: Singapore, the United States, and the war in Indochina / S.R. Joey Long -- Buying time? The Vietnam War and Southeast Asia / Mattias Fibiger -- From resident to refugee: the exodus from Southern Vietnam in the late 1970s / Lisa Tran -- Vietnamese refugee status, habeas corpus, and Hong Kong, 1988-1997 / Jana K. Lipman -- Moving beyond the past: Vietnamese serving in the Australian Defence Force / Nathalie Huynh Chau Nguyen -- Veterans' reflections on legacies of war in Việt Nam at peace / Mia Martin Hobbs -- Colonial legacies of dioxin contamination in Vietnam and Australia / Boi Huyen Ngo.",
        "coverurl": [
            "https://books.google.com/books/content?id=nD0dzwEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "10178"
        ]
    },
    {
        "POL": "POL-144112",
        "mmsId": "9952350790401401",
        "SortDate": "2024-05-13",
        "AccessModel": "None",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "",
        "Author": "Twine, France Winddance, 1960- author.",
        "Format": "E",
        "isbn13": "9781479803828",
        "ISBNS": "1479803855; 9781479803859; 1479803839; 9781479803835; 9781479803828; 1479803820",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "2023-07-25",
        "ExpPortfolioActivationDate": "2023-07-25",
        "ReportingCode": "Computer Science",
        "Title": "Geek Girls : Inequality And Opportunity In Silicon Valley /",
        "POtitle": "Geek Girls : Inequality And Opportunity In Silicon Valley / France Winddance Twine. (jstor E-books Collection)",
        "VendorName": "GOBI - Library Solutions from EBSCO",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-13",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "Introduction -- The Silicon Valley Caste System -- Ideologies and Mythologies -- Black Geek Girls: Silicon Valley's 1% -- First-Generation Geek Girls -- Second-Generation Geek Girls -- Transnational Geek Girls: Caste, Class, and Diasporic Capital -- Code-Switchers: Race, Class, and All-Women Coding Boot Camps -- Conclusion. The Future of Tech Feminism.",
        "coverurl": [
            "https://books.google.com/books/content?id=LGdjEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "11962"
        ]
    },
    {
        "POL": "POL-143678",
        "mmsId": "9952431851701401",
        "SortDate": "2024-05-09",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "",
        "Author": "Baldree, Travis, 1977- author.",
        "Format": "P",
        "isbn13": "9781250886118",
        "ISBNS": "1250886104; 9781250886101; 9781035035861; 1035035863; 1250323223; 9781250323224; 9781250886118; 1250886112",
        "MaterialType": "Book",
        "POLineTypeName": "Physical - One Time",
        "ReceivingDate": "2024-05-09",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Fiction",
        "Title": "Bookshops & Bonedust /",
        "POtitle": "Bookshops & Bonedust.",
        "VendorName": "GOBI - Library Solutions From EBSCO",
        "LibraryName": "F.W. Olin Library",
        "Description": "",
        "LocationName": "Fiction - 2nd Floor",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "Fiction B178b 2023",
        "TitleCreationDate": "2024-04-03",
        "Barcode": "33086005527809",
        "PhysicalItemId": "23464915440001401",
        "summary": "An Instant #1 New York Times, USA Today, and Indie Bestseller A Barnes & Noble Best Fantasy Book of 2023 An Amazon Best Science Fiction and Fantasy Book of 2023 When an injury throws a young, battle-hungry orc off her chosen path, she may find that what we need isn't always what we seek. Set in the world of New York Times bestselling Legends & Lattes, Travis Baldree's Bookshops & Bonedust takes us on a journey of high fantasy, first loves, and secondhand books. Viv's career with the notorious mercenary company Rackam's Ravens isn't going as planned. Wounded during the hunt for a powerful necromancer, she's packed off against her will to recuperate in the sleepy beach town of Murk—so far from the action that she worries she'll never be able to return to it. What's a thwarted soldier of fortune to do? Spending her hours at a beleaguered bookshop in the company of its foul-mouthed proprietor is the last thing Viv would have predicted, but it may be both exactly what she needs and the seed of changes she couldn't possibly imagine. Still, adventure isn't all that far away. A suspicious traveler in gray, a gnome with a chip on her shoulder, a summer fling, and an improbable number of skeletons prove Murk to be more eventful than Viv could have ever expected. “Take a break from epic battles and saving the world. This is a low-stakes fantasy that delivers exactly what's advertised: a wholesome, cozy novel that feels like a warm hug. This is my new comfort read.”—Genevieve Gornichec, author of The Witch's Heart, on Legends & Lattes At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
        "coverurl": [
            "https://books.google.com/books/content?id=u8-iEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "14484"
        ]
    },
    {
        "POL": "POL-143740",
        "mmsId": "9952441252301401",
        "SortDate": "2024-05-08",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "",
        "Author": "Roossinck, Marilyn J., author.",
        "Format": "P",
        "isbn13": "9780691240800",
        "ISBNS": "069123759X; 9780691237596; 9780691240800; 0691240809",
        "MaterialType": "Book",
        "POLineTypeName": "Physical - One Time",
        "ReceivingDate": "2024-05-08",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Health Sciences",
        "Title": "Viruses : A Natural History /",
        "POtitle": "Viruses: A Natural History.",
        "VendorName": "GOBI - Library Solutions From EBSCO",
        "LibraryName": "F.W. Olin Library",
        "Description": "",
        "LocationName": "Non-Fiction",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "579.2 R7819 2023",
        "TitleCreationDate": "2024-04-09",
        "Barcode": "33086005536743",
        "PhysicalItemId": "23466315870001401",
        "summary": "A comprehensive and richly illustrated introduction to the world of viruses As parasites that are often hundreds of times smaller than bacteria, viruses exist in and on everything, everywhere. Rapidly evolving, they are highly opportunistic and relentlessly efficient. While some viruses are obviously agents of disease, as the COVID-19 pandemic has reminded the world only too well, others can be beneficial, helping to protect their hosts from other microbes, or allowing hosts to function in otherwise impossible ways. In Viruses, virus expert and author Marilyn Roossinck presents a comprehensive and richly illustrated introduction to viruses that reveals their true nature. Using lively text, clear graphics, and beautiful imagery, Viruses examines all the aspects of viruses that are essential for understanding them—their diversity, behaviors, life cycles, and much more. Written in a nontechnical and easy-to-follow style, the book covers what viruses are and where they come from; how they transmit and evolve; the battle between viruses and hosts, including immunity and vaccination; viruses that are good for us; the critical role viruses play in the balance of earth’s ecosystems; what makes a virus—including COVID-19 and influenza—become pandemic in plants or animals; and the cutting-edge research that is discovering thousands of new viruses. Each chapter concludes with stunningly illustrated profiles that highlight key viruses. In a world where understanding viruses is more important than ever, Viruses offers a rich and inviting introduction to organisms that, for all the harm they can do, are also essential for the health of animals, plants, and the world we share.",
        "coverurl": [
            "https://books.google.com/books/content?id=QKiTEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "12340"
        ]
    },
    {
        "POL": "POL-143739",
        "mmsId": "9952441252401401",
        "SortDate": "2024-05-08",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "",
        "Author": "Abdurraqib, Hanif, 1983- author.",
        "Format": "P",
        "isbn13": "9780593448816",
        "ISBNS": "0593448790; 9780593448793; 9780593448816; 0593448812",
        "MaterialType": "Book",
        "POLineTypeName": "Physical - One Time",
        "ReceivingDate": "2024-05-08",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Health Sciences",
        "Title": "There's Always This Year : On Basketball And Ascension /",
        "POtitle": "There's Always This Year: On Basketball And Ascension.",
        "VendorName": "GOBI - Library Solutions From EBSCO",
        "LibraryName": "F.W. Olin Library",
        "Description": "",
        "LocationName": "Non-Fiction",
        "TemporaryLocationName": "New Books - 1st Floor",
        "PermanentCallNumber": "796.323 A136 2024",
        "TitleCreationDate": "2024-04-09",
        "Barcode": "33086005536735",
        "PhysicalItemId": "23466315910001401",
        "summary": "#1 NATIONAL BESTSELLER • A “powerful” (The Guardian) reflection on basketball, life, and home—from the author of the National Book Award finalist A Little Devil in America “Mesmerizing . . . not only the most original sports book I’ve ever read but one of the most moving books I’ve ever read, period.”—Steve James, director of Hoop Dreams Growing up in Columbus, Ohio, in the 1990s, Hanif Abdurraqib witnessed a golden era of basketball, one in which legends like LeBron James were forged and countless others weren’t. His lifelong love of the game leads Abdurraqib into a lyrical, historical, and emotionally rich exploration of what it means to make it, who we think deserves success, the tension between excellence and expectation, and the very notion of role models, all of which he expertly weaves together with intimate, personal storytelling. “Here is where I would like to tell you about the form on my father’s jump shot,” Abdurraqib writes. “The truth, though, is that I saw my father shoot a basketball only one time.” There’s Always This Year is a triumph, brimming with joy, pain, solidarity, comfort, outrage, and hope. No matter the subject of his keen focus—whether it’s basketball, or music, or performance—Hanif Abdurraqib’s exquisite writing is always poetry, always profound, and always a clarion call to radically reimagine how we think about our culture, our country, and ourselves.",
        "coverurl": [
            "https://books.google.com/books/content?id=alrHEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "13371"
        ]
    },
    {
        "POL": "POL-143736",
        "mmsId": "9952441252701401",
        "SortDate": "2024-05-08",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "",
        "Author": "Hoepman, Jaap-Henk, author.",
        "Format": "P",
        "isbn13": "9780262547208",
        "ISBNS": "0262045826; 9780262045827; 0262547201; 9780262547208",
        "MaterialType": "Book",
        "POLineTypeName": "Physical - One Time",
        "ReceivingDate": "2024-05-08",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Computer Science",
        "Title": "Privacy Is Hard And Seven Other Myths : Achieving Privacy Through Careful Design /",
        "POtitle": "Privacy Is Hard And Seven Other Myths: Achieving Privacy Through Careful Design.",
        "VendorName": "GOBI - Library Solutions From EBSCO",
        "LibraryName": "F.W. Olin Library",
        "Description": "",
        "LocationName": "Non-Fiction",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "005.8 H694 2021",
        "TitleCreationDate": "2024-04-09",
        "Barcode": "33086005536693",
        "PhysicalItemId": "23466316030001401",
        "summary": "An expert on computer privacy and security shows how we can build privacy into the design of systems from the start. We are tethered to our devices all day, every day, leaving data trails of our searches, posts, clicks, and communications. Meanwhile, governments and businesses collect our data and use it to monitor us without our knowledge. So we have resigned ourselves to the belief that privacy is hard--choosing to believe that websites do not share our information, for example, and declaring that we have nothing to hide anyway. In this informative and illuminating book, a computer privacy and security expert argues that privacy is not that hard if we build it into the design of systems from the start. Along the way, Jaap-Henk Hoepman debunks eight persistent myths surrounding computer privacy. The website that claims it doesn't collect personal data, for example; Hoepman explains that most data is personal, capturing location, preferences, and other information. You don't have anything to hide? There's nothing wrong with wanting to keep personal information--even if it's not incriminating or embarrassing--private. Hoepman shows that just as technology can be used to invade our privacy, it can be used to protect it, when we apply privacy by design. Hoepman suggests technical fixes, discussing pseudonyms, leaky design, encryption, metadata, and the benefits of keeping your data local (on your own device only), and outlines privacy design strategies that system designers can apply now.",
        "coverurl": [
            "https://books.google.com/books/content?id=7ySlEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "11626"
        ]
    },
    {
        "POL": "POL-143734",
        "mmsId": "9952441252801401",
        "SortDate": "2024-05-08",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Little, Brown and Company, publisher.",
        "Author": "Harris, Malcolm, author.",
        "Format": "P",
        "isbn13": "9780316592024",
        "ISBNS": "031659203X; 9780316592031; 9780316592024; 0316592021",
        "MaterialType": "Book",
        "POLineTypeName": "Physical - One Time",
        "ReceivingDate": "2024-05-08",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Computer Science",
        "Title": "Palo Alto : A History Of California, Capitalism, And The World /",
        "POtitle": "Palo Alto: A History Of California, Capitalism, And The World.",
        "VendorName": "GOBI - Library Solutions From EBSCO",
        "LibraryName": "F.W. Olin Library",
        "Description": "",
        "LocationName": "Non-Fiction",
        "TemporaryLocationName": "New Books - 1st Floor",
        "PermanentCallNumber": "979.473 H3151 2023",
        "TitleCreationDate": "2024-04-09",
        "Barcode": "33086005536719",
        "PhysicalItemId": "23466316070001401",
        "summary": "Named One of the Year's Best Books by VULTURE • THE NEW REPUBLIC • DAZED • WIRED • BLOOMBERG • ESQUIRE • SALON • THE NEXT BIG IDEA CLUB The history of Silicon Valley, from railroads to microchips, is an “extraordinary” story of disruption and destruction, told for the first time in this comprehensive, jaw-dropping narrative (Greg Grandin, Pulitzer Prize-winning author of The End of the Myth). Palo Alto’s weather is temperate, its people are educated and enterprising, its corporations are spiritually and materially ambitious and demonstrably world-changing. Palo Alto is also a haunted toxic waste dump built on stolen Indian burial grounds, and an integral part of the capitalist world system. In PALO ALTO, the first comprehensive, global history of Silicon Valley, Malcolm Harris examines how and why Northern California evolved in the particular, consequential way it did, tracing the ideologies, technologies, and policies that have been engineered there over the course of 150 years of Anglo settler colonialism, from IQ tests to the \"tragedy of the commons,\" racial genetics, and \"broken windows\" theory. The Internet and computers, too. It's a story about how a small American suburb became a powerful engine for economic growth and war, and how it came to lead the world into a surprisingly disastrous 21st century. PALO ALTO is an urgent and visionary history of the way we live now, one that ends with a clear-eyed, radical proposition for how we might begin to change course.",
        "coverurl": [
            "https://books.google.com/books/content?id=zm1zEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "15852"
        ]
    },
    {
        "POL": "POL-143578",
        "mmsId": "9952431852701401",
        "SortDate": "2024-05-08",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Watts, Alison, translator.",
        "Author": "Aoyama, Michiko, 1970- author.",
        "Format": "P",
        "isbn13": "9781335005625",
        "ISBNS": "1335005625; 9781335005625",
        "MaterialType": "Book",
        "POLineTypeName": "Physical - One Time",
        "ReceivingDate": "2024-05-08",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Fiction",
        "Title": "What You Are Looking For Is In The Library : A Novel /",
        "POtitle": "What You Are Looking For Is In The Library: A Novel; Trans. By Alison Watts.",
        "VendorName": "GOBI - Library Solutions From EBSCO",
        "LibraryName": "F.W. Olin Library",
        "Description": "",
        "LocationName": "Fiction - 2nd Floor",
        "TemporaryLocationName": "New Books - 1st Floor",
        "PermanentCallNumber": "Fiction A638w 2023",
        "TitleCreationDate": "2024-03-26",
        "Barcode": "33086005536727",
        "PhysicalItemId": "23464915900001401",
        "summary": "For fans of The Midnight Library and Before the Coffee Gets Cold, this charming Japanese novel shows how the perfect book recommendation can change a reader's life. What are you looking for? This is the famous question routinely asked by Tokyo's most enigmatic librarian, Sayuri Komachi. Like most librarians, Komachi has read every book lining her shelves--but she also has the unique ability to read the souls of her library guests. For anyone who walks through her door, Komachi can sense exactly what they're looking for in life and provide just the book recommendation they never knew they needed to help them find it. Each visitor comes to her library from a different juncture in their careers and dreams, from the restless sales attendant who feels stuck at her job to the struggling working mother who longs to be a magazine editor. The conversation that they have with Sayuri Komachi--and the surprise book she lends each of them--will have life-altering consequences. With heartwarming charm and wisdom, What You Are Looking For Is in the Library is a paean to the magic of libraries, friendship and community, perfect for anyone who has ever found themselves at an impasse in their life and in need of a little inspiration.",
        "coverurl": [
            "https://books.google.com/books/content?id=9vSmzwEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "10430"
        ]
    }
]