[
    {
        "POL": "POL-144245",
        "mmsId": "9951413083301401",
        "SortDate": "2024-05-23",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Philpott, Daniel, 1967- author, editor of compilation.; Llewellyn, Jennifer J., 1972- author, editor of compilation.",
        "Author": "",
        "Format": "P",
        "isbn13": "9780199364879",
        "ISBNS": "0199364869; 9780199364862; 0199364877; 9780199364879",
        "MaterialType": "Book",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-05-23",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Default",
        "Title": "Restorative Justice, Reconciliation, And Peacebuilding /",
        "POtitle": "Restorative Justice, Reconciliation, And Peacebuilding / Edited By Jennifer J. Llewellyn And Daniel Philpott.",
        "VendorName": "Amazon.com",
        "LibraryName": "School of Law Library",
        "Description": "",
        "LocationName": "Stacks",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "HV8688 .R4945 2014",
        "TitleCreationDate": "2024-05-23",
        "Barcode": "37190001359757",
        "PhysicalItemId": "23468625640001401",
        "summary": "This book develops the twin concepts of restorative justice and reconciliation as frameworks for peacebuilding that contain great potential for addressing common dilemmas: peace versus justice, religious versus secular approaches, individual versus structural justice, reconciliation versus retribution, and the harmonization of the sheer multiplicity of practices involved in repairing past harms",
        "coverurl": [
            "https://books.google.com/books/content?id=P4gfAwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "10185"
        ]
    },
    {
        "POL": "POL-144244",
        "mmsId": "9939489720001401",
        "SortDate": "2024-05-23",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Kymlicka, Will.; Bashir, Bashir, 1976-",
        "Author": "",
        "Format": "P",
        "isbn13": "9780199587483",
        "ISBNS": "0199587485; 9780199587483",
        "MaterialType": "Book",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-05-23",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Default",
        "Title": "The Politics Of Reconciliation In Multicultural Societies /",
        "POtitle": "The Politics Of Reconciliation In Multicultural Societies / Edited By Will Kymlicka And Bashir Bashir.",
        "VendorName": "Amazon.com",
        "LibraryName": "School of Law Library",
        "Description": "",
        "LocationName": "Stacks",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "JC571 .P6425 2010",
        "TitleCreationDate": "2024-05-23",
        "Barcode": "37190001359864",
        "PhysicalItemId": "23468625650001401",
        "summary": "Most countries around the world exhibit a long history of exclusion and discrimination directed against ethnic, racial, national, religious, or ideological groups. The underlying justifications for these forms of exclusion have been increasingly discredited by the post-war human rights revolution, decolonization, and by contemporary norms of liberal-democratic constitutionalism, with their commitment to equal rights and non-discrimination. However, even as these older practices and ideologies of exclusion are discredited and repudiated, they continue to have enduring effects. The legacies of exclusion can still be seen in a wide range of social attitudes, cultural practices, economic and demographic patterns, and institutional rules that obstruct efforts to build genuinely inclusive societies of equal citizens. Finding ways to overcome this problem is a major challenge facing virtually every society around the world. The Politics of Reconciliation in Multicultural Societies focuses on two parallel intellectual and political movements that have arisen to address this challenge: the 'politics of reconciliation', with its focus on reparations, truth-telling and healing amongst former adversaries, and the 'politics of difference', with its focus on the recognition and empowerment of minorities in multicultural societies. Both the politics of reconciliation and the politics of difference are having a profound impact on the theory and practice of democracy around the world, but remarkably little has been written about the relationship between them. This book aims to fill that gap. Drawing on both theoretical analysis and case studies from around the world, the authors explore how the politics of reconciliation and the politics of difference often interact in mutually supportive ways, as reconciliation leads to more multicultural conceptions of citizenship. But there are also important ways in which the two may compete in their aims and methods. The Politics of Reconciliation in Multicultural Societies is the first attempt to systematically explore these areas of potential convergence and divergence.",
        "coverurl": [
            "https://books.google.com/books/content?id=Lb4NRAAACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "11519"
        ]
    },
    {
        "POL": "POL-144243",
        "mmsId": "9943411780001401",
        "SortDate": "2024-05-23",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Bishop, Donna M.; Feld, Barry C.",
        "Author": "",
        "Format": "P",
        "isbn13": "9780195385106",
        "ISBNS": "0195385101; 9780195385106",
        "MaterialType": "Book",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-05-23",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Default",
        "Title": "The Oxford Handbook Of Juvenile Crime And Juvenile Justice /",
        "POtitle": "The Oxford Handbook Of Juvenile Crime And Juvenile Justice / Edited By Barry C. Feld And Donna M. Bishop.",
        "VendorName": "Amazon.com",
        "LibraryName": "School of Law Library",
        "Description": "",
        "LocationName": "Stacks",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "HV9104 .O989 2012",
        "TitleCreationDate": "2024-05-23",
        "Barcode": "37190001359971",
        "PhysicalItemId": "23468625660001401",
        "summary": "State-of-the-art critical reviews of recent scholarship on the causes of juvenile delinquency, juvenile justice system responses, and public policies to prevent and reduce youth crime are brought together in a single volume authored by leading scholars and researchers in neuropsychology, developmental and social psychology, sociology, history, criminology/criminal justice, and law.",
        "coverurl": [
            "https://books.google.com/books/content?id=NZwEERgfGnoC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "11437"
        ]
    },
    {
        "POL": "POL-144241",
        "mmsId": "9952452552201401",
        "SortDate": "2024-05-23",
        "AccessModel": "None",
        "AcquisitionMethod": "APPROVAL",
        "AuthorContributor": "Jacobs, Alan, 1958- editor.",
        "Author": "Auden, W. H. 1907-1973, author. (Wystan Hugh),",
        "Format": "E",
        "isbn13": "9780691218656",
        "ISBNS": "0691256586; 9780691256580; 9780691218656; 069121865X",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "2024-05-23",
        "ExpPortfolioActivationDate": "2024-05-23",
        "ReportingCode": "English/American Literature",
        "Title": "The Shield Of Achilles /",
        "POtitle": "The Shield Of Achilles / W. H. Auden ; Edited By Alan Jacobs.",
        "VendorName": "GOBI - Library Solutions from EBSCO",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-23",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "\"The first critical edition of W. H. Auden's poetry collection The Shield of Achilles, which won the 1956 National Book Award in Poetry, this book will include the complete text of Auden's award-winning volume The Shield of Achilles, accompanied critical commentary by Alan Jacobs: a preface to provide historical and publishing context; a longer introduction to orient the reader to the poems themselves; and detailed notes on words or passages in need of clarification for contemporary readers. Jacobs, who has edited two previous critical editions of Auden's poetry, argues that this was the most important single collection of poems Auden published, and also the most coherent of his collections. The two poetic sequences, \"Bucolics\" and \"Horae Canonicae,\" bookend a remarkable set of lyrics, with \"The Shield of Achilles\" itself at the heart. One of Auden's last long poems, it refers to moment in The Iliad in which Thetis, mother of Achilles, asks Hephaestus to forge a shield for her son. Auden re-imagines how the shield of Achilles would look in the modern age, when the rules of war and the role of the hero have been rewritten. While the volume was widely praised, it is now out of print (although the title poem is included in larger collections of Auden's poetry). A critical edition allows readers to better understand and appreciate one of Auden's most important later poetic works, written in what Jacobs describes as \"a poetic idiom that differs quite significantly from what anyone else at the time was doing. . . . it is, in a vital sense, public poetry and it can be enjoyed, understood, and profited from. This edition is meant to make that enjoyment, understanding, and profit easier of access.\"\"--",
        "coverurl": [
            "https://books.google.com/books/content?id=7mXiEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "10979"
        ]
    },
    {
        "POL": "POL-144240",
        "mmsId": "9952452552301401",
        "SortDate": "2024-05-23",
        "AccessModel": "None",
        "AcquisitionMethod": "APPROVAL",
        "AuthorContributor": "",
        "Author": "Hunt, Eileen M.",
        "Format": "E",
        "isbn13": "9780812298611",
        "ISBNS": "0812298616; 9780812298611",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "2024-05-23",
        "ExpPortfolioActivationDate": "2024-05-23",
        "ReportingCode": "English/American Literature",
        "Title": "The First Last Man : Mary Shelley And The Postapocalyptic Imagination",
        "POtitle": "The First Last Man : Mary Shelley And The Postapocalyptic Imagination",
        "VendorName": "GOBI - Library Solutions from EBSCO",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-23",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "Beyond her most famous creation—the nightmarish vision of Frankenstein’s Creature—Mary Shelley’s most enduring influence on politics, literature, and art perhaps stems from the legacy of her lesser-known novel about the near-extinction of the human species through war, disease, and corruption. This novel, The Last Man (1826), gives us the iconic image of a heroic survivor who narrates the history of an apocalyptic disaster in order to save humanity—if not as a species, then at least as the practice of compassion or humaneness. In visual and musical arts from 1826 to the present, this postapocalyptic figure has transmogrified from the “last man” into the globally familiar filmic images of the “invisible man” and the “final girl.” Reading Shelley’s work against the background of epidemic literature and political thought from ancient Greece to Covid-19, Eileen M. Hunt reveals how Shelley’s postapocalyptic imagination has shaped science fiction and dystopian writing from H. G. Wells, M. P. Shiel, and George Orwell to Octavia Butler, Margaret Atwood, and Emily St. John Mandel. Through archival research into Shelley’s personal journals and other writings, Hunt unearths Shelley’s ruminations on her own personal experiences of loss, including the death of young children in her family to disease and the drowning of her husband, Percy Bysshe Shelley. Shelley’s grief drove her to intensive study of Greek tragedy, through which she developed the thinking about plague, conflict, and collective responsibility that later emerges in her fiction. From her readings of classic works of plague literature to her own translation of Sophocles’s Oedipus Rex, and from her authorship of the first major modern pandemic novel to her continued influence on contemporary popular culture, Shelley gave rise to a tradition of postapocalyptic thought that asks a question that the Covid-19 pandemic has made newly urgent for many: What do humans do after disaster?",
        "coverurl": [
            "https://books.google.com/books/content?id=6cvbEAAAQBAJ&printsec=frontcover&img=1&zoom=10&source=gbs_api",
            "48890"
        ]
    },
    {
        "POL": "POL-144238",
        "mmsId": "9952452552501401",
        "SortDate": "2024-05-23",
        "AccessModel": "None",
        "AcquisitionMethod": "APPROVAL",
        "AuthorContributor": "",
        "Author": "McElroy, Jack, 1953- author.",
        "Format": "E",
        "isbn13": "9780826365767",
        "ISBNS": "0826365779; 9780826365774; 9780826365767; 0826365760",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "2024-05-23",
        "ExpPortfolioActivationDate": "2024-05-23",
        "ReportingCode": "Journalism",
        "Title": "Citizen Carl : The Editor Who Cracked Teapot Dome, Shot A Judge, And Invented The Parking Meter /",
        "POtitle": "Citizen Carl : The Editor Who Cracked Teapot Dome, Shot A Judge, And Invented The Parking Meter / Jack Mcelroy.",
        "VendorName": "GOBI - Library Solutions from EBSCO",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-23",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "Educator, lawyer, editor, inventor, entrepreneur, and civic booster, Carl Magee helped shape New Mexico and Oklahoma in the years after gaining statehood, garnering fame along the way. Jack McElroy's fascinating biography of \"Citizen Carl\" tells the story of a man whose exploits were as diverse and complex as the American Southwest he loved. Magee purchased the Albuquerque Journal from the syndicate responsible for reelecting Senator Albert Bacon Fall, soon to become secretary of the Interior. Magee battled the Republican machine in New Mexico, a fight that sent Fall to prison in the Teapot Dome scandal and saw Magee repeatedly tried on charges of criminal libel, contempt of court, and even manslaughter. Forced to sell the Journal, he then started the newspaper that would become the Albuquerque Tribune. Magee's fame prompted Scripps-Howard to buy the Tribune, retaining him as editor and adopting his motto: \"Give Light and the People Will Find Their Own Way.\" The company later transferred Magee to its struggling paper in Oklahoma City. There he solved the city's downtown parking problem by inventing the parking meter. Now mostly forgotten, Magee's legacy lives on, and many of the issues he confronted--press freedom, gun violence, public corruption, and demagoguery--remain relevant today.",
        "coverurl": [
            "https://books.google.com/books/content?id=32b2EAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "12338"
        ]
    },
    {
        "POL": "POL-144237",
        "mmsId": "9952452552601401",
        "SortDate": "2024-05-23",
        "AccessModel": "None",
        "AcquisitionMethod": "APPROVAL",
        "AuthorContributor": "",
        "Author": "McCarthy, Jesse, author.",
        "Format": "E",
        "isbn13": "9780226832173",
        "ISBNS": "022683218X; 9780226832180; 0226830373; 9780226830377; 0226832171; 9780226832173",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "2024-05-23",
        "ExpPortfolioActivationDate": "2024-05-23",
        "ReportingCode": "English/American Literature",
        "Title": "The Blue Period : Black Writing In The Early Cold War /",
        "POtitle": "The Blue Period : Black Writing In The Early Cold War / Jesse Mccarthy.",
        "VendorName": "GOBI - Library Solutions from EBSCO",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-23",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "\"To be a Black writer in the early years of the Cold War was to face a stark predicament. On the one hand, revolutionary Communism promised egalitarianism and lit the sparks of anticolonial struggle, but was hostile to conceptions of personal freedom. On the other hand, the great force opposing the Soviets at midcentury was itself the very fountainhead of racial prejudice, represented in the United States by Jim Crow. Jesse McCarthy argues that Black writers of this time were equally alienated from the left and the right and channeled that alienation into remarkable experiments in literary form. Embracing racial affect and interiority, they forged an aesthetic resistance premised on fierce dissent from both US racial liberalism and Soviet Communism. Ranging from the end of World War II to the rise of Black Power in the 1960s, from Richard Wright and James Baldwin to Gwendolyn Brooks and Paule Marshall and others, Jesse McCarthy shows how Black writers defined a distinctive moment in American literary culture that McCarthy calls \"the Blue Period.\"\"--",
        "coverurl": [
            "https://books.google.com/books/content?id=SS_yEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "13040"
        ]
    },
    {
        "POL": "POL-144236",
        "mmsId": "9952452752801401",
        "SortDate": "2024-05-23",
        "AccessModel": "None",
        "AcquisitionMethod": "APPROVAL",
        "AuthorContributor": "",
        "Author": "Knox, Paul L., author.",
        "Format": "E",
        "isbn13": "9780300269208",
        "ISBNS": "0300277458; 9780300277456; 030026920X; 9780300269208",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "2024-05-23",
        "ExpPortfolioActivationDate": "2024-05-23",
        "ReportingCode": "Architecture",
        "Title": "London : A History Of 300 Years In 25 Buildings /",
        "POtitle": "London : A History Of 300 Years In 25 Buildings / Paul Knox.",
        "VendorName": "GOBI - Library Solutions from EBSCO",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-23",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "A lively new history of London told through twenty-five buildings, from iconic Georgian townhouses to the Shard A walk along any London street takes you past a wealth of seemingly ordinary buildings: an Edwardian church, modernist postwar council housing, stuccoed Italianate terraces, a Bauhaus-inspired library. But these buildings are not just functional. They are evidence of London's rich and diverse history and have shaped people's experiences, identities, and relationships. In this engaging study, Paul L. Knox traces the history of London from the Georgian era to the present day through twenty-five surviving buildings. Knox explores where people lived and worked, from grand Regency squares to Victorian workshops, and highlights the impact of migration, gentrification, and inequality. We see famous buildings, like Harrods and Abbey Road Studios, and everyday places like Rochelle Street School and Thamesmead. Each historical period has introduced new buildings, and old ones have been repurposed. As Knox shows, it is the living history of these buildings that makes up the vibrant, but exceptionally unequal, city of today.",
        "coverurl": [
            "https://books.google.com/books/content?id=wzoEEQAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "14095"
        ]
    },
    {
        "POL": "POL-144235",
        "mmsId": "9952452652801401",
        "SortDate": "2024-05-23",
        "AccessModel": "Three concurrent Users (3U)",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Barca, Stefania, editor.; Paulsson, Alexander, editor.; Chertkovskaya, Ekaterina, editor.",
        "Author": "",
        "Format": "E",
        "isbn13": "9781786608956",
        "ISBNS": "1786608979; 9781786608970; 9781786608963; 1786608960; 9781786608956; 1786608952",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Title - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "2024-05-23",
        "ReportingCode": "Political Science",
        "Title": "Towards A Political Economy Of Degrowth /",
        "POtitle": "Towards A Political Economy Of Degrowth",
        "VendorName": "GOBI - Library Solutions from EBSCO",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-23",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "Since the 1970s, the degrowth idea has been proposed by scholars, public intellectuals and activists as a powerful call to reject the obsession of neoliberal capitalism with economic growth, an obsession which continues apace despite the global ecological crisis and rising inequalities. In the past decade, degrowth has gained momentum and become an umbrella term for various social movements which strive for ecologically sustainable and socially just alternatives that would transform the world we live in. How to move forward in an informed way, without reproducing the existing hierarchies and injustices? How not to end up in a situation when ecological sustainability is the prerogative of the privileged, direct democracy is ignorant of environmental issues, and localisation of production is xenophobic? These are some of the questions that have inspired this edited collection. Bringing degrowth into dialogue with critical social theories, covering previously unexplored geographical contexts and discussing some of the most contested concepts in degrowth, the book hints at informed paths towards socio-ecological transformation.",
        "coverurl": [
            "https://books.google.com/books/content?id=iuRixQEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "12037"
        ]
    },
    {
        "POL": "POL-144234",
        "mmsId": "9952452252601401",
        "SortDate": "2024-05-23",
        "AccessModel": "Unlimited Access (UA)",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "",
        "Author": "Collins, Lisa Gail",
        "Format": "E",
        "isbn13": "9780295751627",
        "ISBNS": "9780295751627; 0295751622",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "2024-05-23",
        "ReportingCode": "History",
        "Title": "Stitching Love And Loss : A Gee's Bend Quilt",
        "POtitle": "Stitching Love And Loss : A Gee's Bend Quilt",
        "VendorName": "Proquest LLC (Coutts Information Services Division)",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-23",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "In 1942 Missouri Pettway, newly suffering the loss of her husband, pieced together a quilt out of his old, worn work clothes. Nearly six decades later her daughter Arlonzia Pettway, approaching eighty at the time and a seasoned quiltmaker herself, readily recalled the cover made by her grieving mother within the small African American farming community of Gee's Bend, Alabama. At once a story of grief, a quilt, and a community, Stitching Love and Loss connects Missouri Pettway's cotton covering to the history of a place, its residents, and the work of mourning. Interpreting varied sources of history and memory, Lisa Gail Collins engages crucial and enduring questions, simultaneously singular and shared: What are the languages, practices, and processes of mourning? How is loss expressed and remembered? What are the roles for creativity in grief? And how might a closely crafted material object, in its conception, construction, use, and memory, serve the work of grieving a loved one? Placing this singular quilt within its historical and cultural context, Collins illuminates the perseverance and creativity of the African American women quilters in this rural Black Belt community.",
        "coverurl": [
            "https://books.google.com/books/content?id=njLCEAAAQBAJ&printsec=frontcover&img=1&zoom=10&source=gbs_api",
            "87244"
        ]
    },
    {
        "POL": "POL-144160",
        "mmsId": "9952450552601401",
        "SortDate": "2024-05-22",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Drnach, Mark, editor.; Pelletier, Eric S., editor.; Spearing, Elena McKeogh, editor.",
        "Author": "",
        "Format": "P",
        "isbn13": "9781975141585",
        "ISBNS": "1975141571; 9781975141578; 197514211X; 9781975142117; 9781975141585; 197514158X",
        "MaterialType": "Book",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-05-22",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Nursing/Nutrition",
        "Title": "Tecklin's Pediatric Physical Therapy /",
        "POtitle": "Tecklin's Pediatric Physical Therapy / [edited By] Elena Mckeogh Spearing, Eric S. Pelletier, Mark Drnach.",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "Stacks",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "RJ53.P5 P43 2022",
        "TitleCreationDate": "2024-05-15",
        "Barcode": "39358015808154",
        "PhysicalItemId": "23468425840001401",
        "summary": "Trusted for decades by Physical Therapy students as well as experienced therapists who want to improve their knowledge, Tecklin’s Pediatric Physical Therapy provides a comprehensive and logical overview of some of the most common pediatric physical therapy diagnoses. This straightforward approach presents basic medical information regarding common clinical diagnostic categories followed by coverage of physical therapy examination, intervention and special considerations within each diagnostic group. Content in this 6th Edition has been thoroughly updated and reorganized to help prepare students for today’s clinical challenges, accompanied by case studies and interactive features that reinforce understanding and instill the clinical decision-making skills essential to successful practice.",
        "coverurl": [
            "https://books.google.com/books/content?id=xMkpEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "13325"
        ]
    },
    {
        "POL": "POL-144227",
        "mmsId": "9952452452701401",
        "SortDate": "2024-05-21",
        "AccessModel": "Unlimited Access (UA)",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Ben-Naim, Eli.; Redner, Sidney.",
        "Author": "Krapivsky, Pavel L.",
        "Format": "E",
        "isbn13": "9780521851039",
        "ISBNS": "9780511907029; 0511907028; 9780511780516; 0511780516; 9780521851039; 0521851033",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "2024-05-23",
        "ExpPortfolioActivationDate": "2024-05-21",
        "ReportingCode": "Physics/Astronomy",
        "Title": "A Kinetic View Of Statistical Physics.",
        "POtitle": "A Kinetic View Of Statistical Physics",
        "VendorName": "Proquest LLC (Coutts Information Services Division)",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-21",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "Aimed at graduate students, this book explores some of the core phenomena in non-equilibrium statistical physics. It focuses on the development and application of theoretical methods to help students develop their problem-solving skills. The book begins with microscopic transport processes: diffusion, collision-driven phenomena, and exclusion. It then presents the kinetics of aggregation, fragmentation and adsorption, where the basic phenomenology and solution techniques are emphasized. The following chapters cover kinetic spin systems, both from a discrete and a continuum perspective, the role of disorder in non-equilibrium processes, hysteresis from the non-equilibrium perspective, the kinetics of chemical reactions, and the properties of complex networks. The book contains 200 exercises to test students' understanding of the subject. A link to a website hosted by the authors, containing supplementary material including solutions to some of the exercises, can be found at www.cambridge.org/9780521851039.",
        "coverurl": [
            "https://books.google.com/books/content?id=ndLdngEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "11612"
        ]
    },
    {
        "POL": "POL-144220",
        "mmsId": "9951550673101401",
        "SortDate": "2024-05-21",
        "AccessModel": "None",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Grossberg, Lawrence, editor.; Slack, Jennifer Daryl, editor.",
        "Author": "Hall, Stuart, 1932-2014, author.",
        "Format": "E",
        "isbn13": "9780822362487",
        "ISBNS": "0822373653; 9780822373650; 0822362635; 9780822362630; 9780822362487; 0822362481",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "2017-05-05",
        "ExpPortfolioActivationDate": "2017-05-05",
        "ReportingCode": "Sociology",
        "Title": "Cultural Studies 1983 : A Theoretical History /",
        "POtitle": "Cultural Studies 1983 : A Theoretical History / Stuart Hall ; Edited And With An Introduction By Jennifer Daryl Slack And Lawrence Grossberg.",
        "VendorName": "GOBI - Library Solutions from EBSCO",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-21",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "The publication of Cultural Studies 1983 is a touchstone event in the history of Cultural Studies and a testament to Stuart Hall's unparalleled contributions. The eight foundational lectures Hall delivered at the University of Illinois in 1983 introduced North American audiences to a thinker and discipline that would shift the course of critical scholarship. Unavailable until now, these lectures present Hall's original engagements with the theoretical positions that contributed to the formation of Cultural Studies. Throughout this personally guided tour of Cultural Studies' intellectual genealogy, Hall discusses the work of Richard Hoggart, Raymond Williams, and E. P. Thompson; the influence of structuralism; the limitations and possibilities of Marxist theory; and the importance of Althusser and Gramsci. Throughout these theoretical reflections, Hall insists that Cultural Studies aims to provide the means for political change.",
        "coverurl": [
            "https://covers.openlibrary.org/b/isbn/9780822362487-L.jpg",
            16929
        ]
    },
    {
        "POL": "POL-144158",
        "mmsId": "9952450552801401",
        "SortDate": "2024-05-21",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "South Asian American Digital Archive.",
        "Author": "",
        "Format": "P",
        "isbn13": "9781737175902",
        "ISBNS": "1737175975; 9781737175971; 9781737175933; 1737175932; 1737175908; 9781737175902",
        "MaterialType": "Book",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-05-21",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Anthropology",
        "Title": "Our Stories : An Introduction To South Asian America /",
        "POtitle": "Our Stories : An Introduction To South Asian America / South Asian American Digital Archive.",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "Stacks",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "E184.S69 O97 2021",
        "TitleCreationDate": "2024-05-15",
        "Barcode": "39358015807990",
        "PhysicalItemId": "23468425900001401",
        "summary": "No summary.",
        "coverurl": [
            "https://books.google.com/books/content?id=B8EqzwEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "10842"
        ]
    },
    {
        "POL": "POL-144218",
        "mmsId": "9952448352801401",
        "SortDate": "2024-05-20",
        "AccessModel": "One concurrent User (1U)",
        "AcquisitionMethod": "TECHNICAL",
        "AuthorContributor": "",
        "Author": "Gabaldon, Diana.",
        "Format": "E",
        "isbn13": "9781101885680",
        "ISBNS": "9781101885697; 1101885696; 9781101885680; 1101885688",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "2024-05-08",
        "ExpPortfolioActivationDate": "2024-05-08",
        "ReportingCode": "Recreational Reading",
        "Title": "Go Tell The Bees That I Am Gone /",
        "POtitle": "Go Tell The Bees That I Am Gone / Diana Gabaldon. (overdrive )",
        "VendorName": "OverDrive, Inc.",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-20",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "#1 NEW YORK TIMES BESTSELLER • Diana Gabaldon returns with the “vast and sweeping” (The Washington Post) new novel in the epic Outlander series. War leaves nobody alone. Neither the past, the present, nor the future offers true safety, and the only refuge is what you can protect: your family, your friends, your home. Jamie Fraser and Claire Randall were torn apart by the Jacobite Rising in 1746, and it took them twenty years of loss and heartbreak to find each other again. Now it’s 1779, and Claire and Jamie are finally reunited with their daughter, Brianna, her husband, Roger, and their children, and are rebuilding their home on Fraser’s Ridge—a fortress that may shelter them against the winds of war as well as weather. But tensions in the Colonies are great: Battles rage from New York to Georgia and, even in the mountains of the backcountry, feelings run hot enough to boil Hell’s teakettle. Jamie knows that loyalties among his tenants are split and it won’t be long before the war is on his doorstep. Brianna and Roger have their own worry: that the dangers that provoked their escape from the twentieth century might catch up to them. Sometimes they question whether risking the perils of the 1700s—among them disease, starvation, and an impending war—was indeed the safer choice for their family. Not so far away, young William Ransom is coming to terms with the mysteries of his identity, his future, and the family he’s never known. His erstwhile father, Lord John Grey, has reconciliations to make and dangers to meet on his son’s behalf and on his own, and far to the north, Young Ian Murray fights his own battle between past and future, and the two women he’s loved. Meanwhile, the Revolutionary War creeps ever closer to Fraser’s Ridge. Jamie sharpens his sword, while Claire whets her surgeon’s blade: It is a time for steel.",
        "coverurl": [
            "https://books.google.com/books/content?id=ypKTEAAAQBAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "12116"
        ]
    },
    {
        "POL": "POL-144217",
        "mmsId": "9952233844301401",
        "SortDate": "2024-05-20",
        "AccessModel": "None",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "American Psychological Association.",
        "Author": "Levrini, Abigail, author.",
        "Format": "E",
        "isbn13": "9781433838743",
        "ISBNS": "1433838753; 9781433838750; 9781433838743; 1433838745",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "2023-02-06",
        "ExpPortfolioActivationDate": "2023-02-06",
        "ReportingCode": "Psychology",
        "Title": "Succeeding With Adult Adhd : Daily Strategies To Help You Achieve Your Goals And Manage Your Life /",
        "POtitle": "Succeeding With Adult Adhd : Daily Strategies To Help You Achieve Your Goals And Manage Your Life / By Abigail Levrini. (jstor E-books Collection)",
        "VendorName": "GOBI - Library Solutions from EBSCO",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-20",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "This expanded and updated new edition of psychologist Abigail Levrini's bestselling book offers realistic, proven strategies to help adults with ADHD lead more fulfilling and productive lives. Stop feeling frustrated by what you are not accomplishing, and start making practical steps toward achieving your goals.",
        "coverurl": [
            "https://covers.openlibrary.org/b/isbn/9781433838743-L.jpg",
            32116
        ]
    },
    {
        "POL": "POL-144216",
        "mmsId": "9952216739101401",
        "SortDate": "2024-05-20",
        "AccessModel": "None",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "",
        "Author": "Hill, Rosemary.",
        "Format": "E",
        "isbn13": "9780674072299",
        "ISBNS": "0674063589; 9780674063587; 0674031326; 9780674031326; 9780674072299; 0674072294",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "2022-12-12",
        "ExpPortfolioActivationDate": "2022-12-12",
        "ReportingCode": "History",
        "Title": "Stonehenge /",
        "POtitle": "Stonehenge / Rosemary Hill. (jstor E-books Collection)",
        "VendorName": "GOBI - Library Solutions from EBSCO",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-20",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "Welcoming 800,000 visitors each year, Stonehenge is the most famous pre-historic monument in all of Europe. It has inspired modern replicas throughout the world, including one constructed entirely of discarded refrigerators. This curious structure is the subject of cult worship, is a source of pride for Britons, and offers an intellectual challenge for academics. It has captured the imagination and the attention of thousands of people for thousands of years. Over the centuries, ÒexpertsÓ have tried to discover the meaning behind Stonehenge. While each new theory contradicts earlier speculation, every new proposal attributes a purpose to the site. From bards of the twelfth century to Black Sabbath, from William Blake to archaeologists of the twenty-first century, Stonehenge has embodied a wealth of intention. Was it designed for winter solstice, for goddess worship, or as a funerary temple? While all have been suggested, even Òproven,Ó the mystery continues. Through the eyes of its most eloquent apologists, Rosemary Hill guides the reader on a tour of Stonehenge in all its cultural contexts, as a monument to many thingsÑto Renaissance Humanism, Romantic despair, Victorian enterprise, and English Radicalism. In the end, the stones remain compelling because they remain mysteriousÑapparently simple yet incomprehensibleÑthat is the wonder, the enchantment, of Stonehenge.",
        "coverurl": [
            "https://books.google.com/books/content?id=q0cpEAAAQBAJ&printsec=frontcover&img=1&zoom=10&source=gbs_api",
            "27814"
        ]
    },
    {
        "POL": "POL-144215",
        "mmsId": "9952203885201401",
        "SortDate": "2024-05-20",
        "AccessModel": "None",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "",
        "Author": "Eaude, Michael.",
        "Format": "E",
        "isbn13": "9780745342139",
        "ISBNS": "1786808595; 9781786808592; 9780745342139; 0745342132",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "2022-10-24",
        "ExpPortfolioActivationDate": "2022-10-24",
        "ReportingCode": "History",
        "Title": "A People's History Of Catalonia",
        "POtitle": "A People's History Of Catalonia [electronic Resource]. (jstor E-books Collection)",
        "VendorName": "GOBI - Library Solutions from EBSCO",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-20",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "A history of Catalonia and its struggle for independence, from the 10th century to the present day At every home game of FC Barcelona, at 17 minutes and 14 seconds of play, the 100,000-capacity Camp Nou stadium is filled by the roar of \"IN-DE-PEN-DÈN-CI-A!\" Time stops for a second. History lives in the present... Catalonia's national consciousness has deep roots. There are countries twice the size with histories half as interesting. A People's History of Catalonia tells that history, from below, in all its richness and complexity. The region's struggle for independence has, for centuries, been violently resisted, the Catalan language suppressed and its leaders jailed. The fight of an oppressed nation for its sovereignty has often dovetailed with that of a militant working class for social justice. From the peasant revolts of the 15th century and the siege of Barcelona in 1714, to defeat in the Spanish Civil War, and the slow re-emergence of the workers' movement and anti-Francoist resistance in the years that followed, Michael Eaude tells a compelling story whose ending has yet to be written.",
        "coverurl": [
            "https://books.google.com/books/content?id=YHV6zQEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "12123"
        ]
    },
    {
        "POL": "POL-144213",
        "mmsId": "9952095776201401",
        "SortDate": "2024-05-20",
        "AccessModel": "None",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "",
        "Author": "Vernon, Raymond, 1913-1999.",
        "Format": "E",
        "isbn13": "9780674445826",
        "ISBNS": "0674044665; 9780674044661; 9780674004245; 0674004248; 9780674445826; 0674445821",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "2021-12-01",
        "ExpPortfolioActivationDate": "2021-12-01",
        "ReportingCode": "Business",
        "Title": "In The Hurricane's Eye : The Troubled Prospects Of Multinational Enterprises /",
        "POtitle": "In The Hurricane's Eye : The Troubled Prospects Of Multinational Enterprises / Raymond Vernon. (jstor E-books Collection)",
        "VendorName": "GOBI - Library Solutions from EBSCO",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-20",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "The world's multinational enterprises face a spell of rough weather, political economist Ray Vernon argues, not only from the host countries in which they have established their subsidiaries, but also from their home countries. Such enterprises--a few thousand in number, including Microsoft, Toyota, IBM, Siemens, Samsung, and others--now generate about half of the world's industrial output and half of the world's foreign trade; so any change in the relatively benign climate in which they have operated over the past decade will create serious tensions in international economic relations. The warnings of such a change are already here. In the United States, interests such as labor are increasingly hostile to what they see as the costs and uncertainties of an open economy. In Europe, those who want to preserve the social safety net and those who feel that the net must be dismantled are increasingly at odds. In Japan, the talk of \"hollowing out\" takes on a new urgency as the country's \"lifetime employment\" practices are threatened and as public and private institutions are subjected to unaccustomed stress. The tendency of multinationals in different countries to find common cause in open markets, strong patents and trademarks, and international technical standards has been viewed as a loss of national sovereignty and a weakening of the nation-state system, producing hostile reactions in home countries. The challenge for policy makers, Vernon argues, is to bridge the quite different regimes of the multinational enterprise and the nation-state. Both have a major role to play, and yet must make basic changes in their practices and policies to accommodate each other.",
        "coverurl": [
            "https://books.google.com/books/content?id=VfcA_vyaAnAC&printsec=frontcover&img=1&zoom=10&source=gbs_api",
            "62109"
        ]
    },
    {
        "POL": "POL-144210",
        "mmsId": "9951793211701401",
        "SortDate": "2024-05-20",
        "AccessModel": "None",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "ProQuest (Firm)",
        "Author": "Camille, Michael, author.",
        "Format": "E",
        "isbn13": "9780674443624",
        "ISBNS": "1780232500; 9781780232508; 9780674443617; 0674443616; 9780674443624; 0674443624",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "2024-05-20",
        "ReportingCode": "Art",
        "Title": "Image On The Edge : The Margins Of Medieval Art /",
        "POtitle": "Image On The Edge : The Margins Of Medieval Art / Michael Camille.",
        "VendorName": "GOBI - Library Solutions from EBSCO",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-20",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "A gargoyle lurks at the corner of a Gothic cathedral. A monstrous face peers from the margin of a medieval text. At the far reaches of cultural spaces a chorus of odd and arresting figures assembles, commenting endlessly on the world it surveys. What these characters are doing at the margins is the subject of Michael Camille's new book, an exhilarating account of the medieval imagination testing--and defining--its boundaries. Where others have isolated the marginal image as a detail, Camille considers such marginalia in direct and complex relation to the whole work. Ranging with graceful authority through the culture of the Middle Ages, from art to architecture, music to illustrated manuscripts, courtly romances to social rituals, he finds in the margins a distorted yet apt reflection of medieval conventions. It is here at the edge--of the monastery, the cathedral, the court, the city--that medieval artists found room for experimentation, for glossing, parodying, modernizing, and questioning cultural authority without ever undermining it. Viewing marginalia in their proper social and cultural context, Camille reveals scandalous and subversive aspects, as well as apparently paradoxical stabilizing functions. He rejects oppositions such as high and low, profane and sacred, and instead projects a vision of medieval culture in which marginal resistance, inversion, and transgression play an integral, even necessary, role. Chimeras as disruptions of religious order; gargoyles as embodiments of fears and temptations; scatological drawings as manifestations of crisis in the chivalric class; charivari as ritual reinscriptions of social norms: Image on the Edge presents a vivid picture of amedieval world in which contradictions were not only tolerated, but worked with exquisite detail into the very fabric of society. With a richness of expression in keeping with his subject--and with a wealth of sumptuous illustrations--Camille illuminates these details; in doing so, he revises and enhances our understanding of medieval culture's self-representation.",
        "coverurl": [
            "https://books.google.com/books/content?id=Uc6OPwAACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "10724"
        ]
    },
    {
        "POL": "POL-144209",
        "mmsId": "9952438381501401",
        "SortDate": "2024-05-20",
        "AccessModel": "None",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "",
        "Author": "Hasen, Richard L., author.",
        "Format": "E",
        "isbn13": "9780300259377",
        "ISBNS": "0300265255; 9780300265255; 0300259379; 9780300259377",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "2024-04-04",
        "ExpPortfolioActivationDate": "2024-04-04",
        "ReportingCode": "Communications",
        "Title": "Cheap Speech : How Disinformation Poisons Our Politics And How To Cure It /",
        "POtitle": "Cheap Speech : How Disinformation Poisons Our Politics And How To Cure It / Richard L. Hasen. (jstor E-books Collection)",
        "VendorName": "GOBI - Library Solutions from EBSCO",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-20",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "An informed and practical road map for controlling disinformation, embracing free speech, saving American elections, and protecting democracy \"A fresh, persuasive and deeply disturbing overview of the baleful and dangerous impact on the nation of widely disseminated false speech on social media. Richard Hasen, the country's leading expert about election law, has written this book with flair and clarity.\"--Floyd Abrams, author of The Soul of the First Amendment What can be done consistent with the First Amendment to ensure that American voters can make informed election decisions and hold free elections amid a flood of virally spread disinformation and the collapse of local news reporting? How should American society counter the actions of people like former President Donald J. Trump, who used social media to convince millions of his followers to doubt the integrity of U.S. elections and helped foment a violent insurrection? What can we do to minimize disinformation campaigns aimed at suppressing voter turnout? With piercing insight into the current debates over free speech, censorship, and Big Tech's responsibilities, Richard L. Hasen proposes legal and social measures to restore Americans' access to reliable information on which democracy depends. In an era when quack COVID treatments and bizarre QAnon theories have entered mainstream, this book explains how to assure both freedom of ideas and a commitment to truth.",
        "coverurl": [
            "https://books.google.com/books/content?id=kZldEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "10154"
        ]
    },
    {
        "POL": "POL-144208",
        "mmsId": "9951628966401401",
        "SortDate": "2024-05-20",
        "AccessModel": "None",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "ProQuest (Firm); Seligman, Martin E. P., interviewee.",
        "Author": "",
        "Format": "E",
        "isbn13": "9781633694361",
        "ISBNS": "1633694372; 9781633694378; 1633694364; 9781633694361",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "2024-05-20",
        "ReportingCode": "Psychology",
        "Title": "Hbr's 10 Must Reads On Mental Toughness: With Bonus Interview Of Martin E.p. Seligman.",
        "POtitle": "Hbr's 10 Must Reads On Mental Toughness: With Bonus Interview Of Martin E.p. Seligman.",
        "VendorName": "GOBI - Library Solutions from EBSCO",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-20",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "Our professional lives are full of challenges and setbacks, but those who achieve elite performance are able to consistently rally their emotional strength in the pursuit of their goals--no matter what gets thrown at them. If you read nothing else on mental toughness, read these ten articles by experts in the field. We've combed through hundreds of articles in the Harvard Business Review archive and selected the most important ones to help you build your emotional strength and resilience--and to achieve high performance. This book will inspire you to: Thrive on pressure like an Olympic athlete Manage and overcome negative emotions by acknowledging them Plan short-term goals to achieve long-term aspirations Surround yourself with the people who will push you the hardest Use challenges to become a better leader Use creativity to move past trauma Understand the tools your mind uses to recover from setbacks--",
        "coverurl": [
            "https://covers.openlibrary.org/b/isbn/9781633694361-L.jpg",
            30048
        ]
    },
    {
        "POL": "POL-144207",
        "mmsId": "9952392748101401",
        "SortDate": "2024-05-20",
        "AccessModel": "None",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "",
        "Author": "Ropeik, David.",
        "Format": "E",
        "isbn13": "9781421447414",
        "ISBNS": "9781421447414; 142144741X",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "2024-05-20",
        "ReportingCode": "Medicine",
        "Title": "Curing Cancerphobia How Risk, Fear, And Worry Mislead Us.",
        "POtitle": "Curing Cancerphobia [electronic Resource] : How Risk, Fear, And Worry Mislead Us.",
        "VendorName": "GOBI - Library Solutions from EBSCO",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-20",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "Our fear of cancer causes great harm to individual health and to society. The fear of cancer is understandable. But that fear is in some ways outdated, as it fails to account for the medical progress made against this family of diseases. In Curing Cancerphobia, David Ropeik reveals the fascinating historical and psychological roots of our fear of cancer and documents the dramatic health and financial harms caused when that fear exceeds the risk. Fear of cancer drives millions for whom screening is not recommended to screen for the disease anyway, producing tens of thousands of emotionally damaging false positives and costing the US health care system an estimated $9.2 billion a year. At the same time, fear of cancer also causes many people for whom screening is recommended to avoid it altogether. Modern screening technologies often identify cancers that do not spread or that grow so slowly they almost certainly will never cause harm in a person's lifetime. Yet many of these people, frightened by the word \"cancer\" in their diagnosis, understandably choose more aggressive and risky treatments than their clinical conditions require. These unnecessary treatments kill hundreds of people, cause severe side effects in thousands, and cost the health care system at least $5.2 billion a year. Additionally, consumers spend billions of dollars on vitamins and supplements, organic food, and other products that promise to reduce our risk of cancer but do not actually reduce it. And an excessive fear of cancer causes resistance to potentially beneficial technologies like nuclear power and fluoridation of tap water. After documenting these harms, Ropeik offers tools and suggestions to help reduce the negative impacts of cancerphobia. Based on extensive research including interviews with experts and cancer patients, Curing Cancerphobia confronts our emotional relationship with the disease we fear more than any other.",
        "coverurl": [
            "https://books.google.com/books/content?id=9fuwEAAAQBAJ&printsec=frontcover&img=1&zoom=10&source=gbs_api",
            "47741"
        ]
    },
    {
        "POL": "POL-144206",
        "mmsId": "9952284143801401",
        "SortDate": "2024-05-20",
        "AccessModel": "None",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "ProQuest (Firm)",
        "Author": "Vachon, Todd E., 1976- author.",
        "Format": "E",
        "isbn13": "9781439923214",
        "ISBNS": "143992323X; 9781439923238; 9781439923221; 1439923221; 9781439923214; 1439923213",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "2024-05-20",
        "ReportingCode": "Law",
        "Title": "Clean Air And Good Jobs : U.s. Labor And The Struggle For Climate Justice /",
        "POtitle": "Clean Air And Good Jobs : U.s. Labor And The Struggle For Climate Justice / Todd E. Vachon.",
        "VendorName": "GOBI - Library Solutions from EBSCO",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-20",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "\"Addresses the role that the U.S. labor movement has or could have in forging a 'just transition' away from dependence on fossil fuels toward a Green New Deal to address the dual crises of climate change and inequality\"--",
        "coverurl": [
            "https://books.google.com/books/content?id=BEJ5zwEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "10520"
        ]
    },
    {
        "POL": "POL-144194",
        "mmsId": "9952384599101401",
        "SortDate": "2024-05-17",
        "AccessModel": "One concurrent User (1U)",
        "AcquisitionMethod": "TECHNICAL",
        "AuthorContributor": "",
        "Author": "Aktan, Nadine M., author.",
        "Format": "E",
        "isbn13": "9780826148728",
        "ISBNS": "1787858871; 9781787858879; 0826148735; 9780826148735; 0826148727; 9780826148728",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "2023-11-03",
        "ExpPortfolioActivationDate": "2023-11-03",
        "ReportingCode": "Medicine",
        "Title": "Fast Facts For Nurse Practitioners : Practice Essentials For Clinical Subspecialties /",
        "POtitle": "Fast Facts For Nurse Practitioners : Practice Essentials For Clinical Subspecialties / Nadine M. Aklan. (r2 Digital Library)",
        "VendorName": "Rittenhouse",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-17",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "\"The goal of this book is for a seasoned nurse practitioner to share practical guidance which supports the reader to be better prepared in the provision of high-quality primary care to their clients and families\"--",
        "coverurl": [
            "https://books.google.com/books/content?id=tmdtzQEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "11728"
        ]
    },
    {
        "POL": "POL-144168",
        "mmsId": "9952450650901401",
        "SortDate": "2024-05-16",
        "AccessModel": "None",
        "AcquisitionMethod": "APPROVAL",
        "AuthorContributor": "",
        "Author": "Trethewey, Natasha D., 1966- author.",
        "Format": "E",
        "isbn13": "9780300265927",
        "ISBNS": "030027467X; 9780300274677; 9780300265927; 0300265921",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "2024-05-16",
        "ExpPortfolioActivationDate": "2024-05-16",
        "ReportingCode": "English/American Literature",
        "Title": "The House Of Being /",
        "POtitle": "The House Of Being / Natasha Trethewey.",
        "VendorName": "GOBI - Library Solutions from EBSCO",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-16",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "An exquisite meditation on the geographies we inherit and the metaphors we inhabit, from Pulitzer Prize winner and nineteenth U.S. poet laureate Natasha Trethewey \"Searching and intimate, this impresses.\"--Publishers Weekly In a shotgun house in Gulfport, Mississippi, at the crossroads of Highway 49, the legendary highway of the Blues, and Jefferson Street, Natasha Trethewey learned to read and write. Before the land was a crossroads, however, it was a pasture: a farming settlement where, after the Civil War, a group of formerly enslaved women, men, and children made a new home. In this intimate and searching meditation, Trethewey revisits the geography of her childhood to trace the origins of her writing life, born of the need to create new metaphors to inhabit \"so that my story would not be determined for me.\" She recalls the markers of history and culture that dotted the horizons of her youth: the Confederate flags proudly flown throughout Mississippi; her gradual understanding of her own identity as the child of a Black mother and a white father; and her grandmother's collages lining the hallway, offering glimpses of the world as it could be. With the clarity of a prophet and the grace of a poet, Trethewey offers up a vision of writing as reclamation: of our own lives and the stories of the vanished, forgotten, and erased.",
        "coverurl": [
            "https://books.google.com/books/content?id=iDX7EAAAQBAJ&printsec=frontcover&img=1&zoom=10&source=gbs_api",
            "35895"
        ]
    },
    {
        "POL": "POL-144167",
        "mmsId": "9952450651001401",
        "SortDate": "2024-05-16",
        "AccessModel": "None",
        "AcquisitionMethod": "APPROVAL",
        "AuthorContributor": "",
        "Author": "Anderson, Edward T. G., author.",
        "Format": "E",
        "isbn13": "9781805260547",
        "ISBNS": "9781805260899; 1805260898; 9781805260547; 1805260545",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "2024-05-16",
        "ExpPortfolioActivationDate": "2024-05-16",
        "ReportingCode": "Sociology",
        "Title": "Hindu Nationalism In The Indian Diaspora : Transnational Politics And British Multiculturalism /",
        "POtitle": "Hindu Nationalism In The Indian Diaspora : Transnational Politics And British Multiculturalism / Edward T. G. Anderson.",
        "VendorName": "GOBI - Library Solutions from EBSCO",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-16",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "Hindu nationalism is transforming India, as an increasingly dominant ideology and political force. But it is also a global phenomenon, with sections of India's vast diaspora drawn to, or actively supporting, right-wing Hindu nationalism. Indians overseas can be seen as an important, even inextricable, aspect of the movement. This is not a new dynamic--diasporic Hindutva ('Hindu-ness') has grown over many decades. This book explores how and why the movement became popular among India's diaspora from the second half of the twentieth century. It shows that Hindutva ideology, and its plethora of organisations, have a distinctive resonance and way of operating overseas; the movement and its ideas perform significant, particular functions for diaspora communities. With a focus on Britain, Edward T.G. Anderson argues that transnational Hindutva cannot simply be viewed as an export: this phenomenon has evolved and been shaped into an important aspect of diasporic identity, a way for people to connect with their homeland. He also sheds light on the impact of conservative Indian politics on British multiculturalism, migrant politics and relations between various minoritised communities. To fully understand the Hindutva movement in India and identity politics in Britain, we must look at where the two come together.",
        "coverurl": [
            "https://books.google.com/books/content?id=uG2_zwEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "11228"
        ]
    },
    {
        "POL": "POL-144166",
        "mmsId": "9952450651101401",
        "SortDate": "2024-05-16",
        "AccessModel": "None",
        "AcquisitionMethod": "APPROVAL",
        "AuthorContributor": "",
        "Author": "Rubio, Julie Hanlon, author.",
        "Format": "E",
        "isbn13": "9780197553145",
        "ISBNS": "0197553168; 9780197553169; 0197553176; 9780197553176; 019755315X; 9780197553152; 9780197553145; 0197553141",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "2024-05-16",
        "ExpPortfolioActivationDate": "2024-05-16",
        "ReportingCode": "Religion",
        "Title": "Can You Be A Catholic And A Feminist? /",
        "POtitle": "Can You Be A Catholic And A Feminist? / Julie Hanlon Rubio.",
        "VendorName": "GOBI - Library Solutions from EBSCO",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-16",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "Is it possible to reconcile Catholic and feminist identities? Julie Hanlon Rubio argues that it is, but only if we rethink how women and men who experience the pull of feminism and Catholicism can credibly claim both identities.",
        "coverurl": [
            "https://books.google.com/books/content?id=q730EAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "14951"
        ]
    },
    {
        "POL": "POL-144164",
        "mmsId": "9952450651301401",
        "SortDate": "2024-05-16",
        "AccessModel": "None",
        "AcquisitionMethod": "APPROVAL",
        "AuthorContributor": "",
        "Author": "Conley, Garrard, author.",
        "Format": "E",
        "isbn13": "9780525537335",
        "ISBNS": "9780525537359; 052553735X; 9780525537335; 0525537333",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "2024-05-16",
        "ExpPortfolioActivationDate": "2024-05-16",
        "ReportingCode": "English/American Literature",
        "Title": "All The World Beside /",
        "POtitle": "All The World Beside / Garrard Conley.",
        "VendorName": "GOBI - Library Solutions from EBSCO",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-16",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "From the New York Times bestselling author of Boy Erased, an electrifying, deeply moving novel about the love story between two men in Puritan New England. Cana, Massachusetts: a utopian vision of 18th-century Puritan New England. To the outside world, Reverend Nathaniel Whitfield and his family stand as godly pillars of their small-town community, drawing Christians from across the New World into their fold. One such Christian, physician Arthur Lyman, discovers in the minister’s words a love so captivating it transcends language. As the bond between these two men grows more and more passionate, their families must contend with a tangled web of secrets, lies, and judgments which threaten to destroy them in this world and the next. And when the religious ecstasies of the Great Awakening begin to take hold, igniting a new era of zealotry, Nathaniel and Arthur search for a path out of an impossible situation, imagining a future for themselves which has no name. Their wives and children must do the same, looking beyond the known world for a new kind of wilderness, both physical and spiritual. Set during the turbulent historical upheavals which shaped America’s destiny and following in the tradition of Nathaniel Hawthorne’s The Scarlet Letter, All the World Beside reveals the very human lives just beneath the surface of dogmatic belief. Bestselling author Garrard Conley has created a page-turning, vividly imagined historical tale that is both a love story and a crucible.",
        "coverurl": [
            "https://books.google.com/books/content?id=-CfHEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "12634"
        ]
    },
    {
        "POL": "POL-144163",
        "mmsId": "9952450650801401",
        "SortDate": "2024-05-16",
        "AccessModel": "None",
        "AcquisitionMethod": "APPROVAL",
        "AuthorContributor": "",
        "Author": "Sears, James T. 1951- author. (James Thomas),",
        "Format": "E",
        "isbn13": "9781439923801",
        "ISBNS": "1439923817; 9781439923818; 9781439923801; 1439923809",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "2024-05-16",
        "ExpPortfolioActivationDate": "2024-05-16",
        "ReportingCode": "History",
        "Title": "Queering Rehoboth Beach : Beyond The Boardwalk /",
        "POtitle": "Queering Rehoboth Beach : Beyond The Boardwalk / James T. Sears.",
        "VendorName": "GOBI - Library Solutions from EBSCO",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-16",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "\"This volume explores the story of how a conservative southern Delaware beach town was transformed into a major East Coast summer queer resort\"--",
        "coverurl": [
            "https://books.google.com/books/content?id=a4cCEQAAQBAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "14133"
        ]
    },
    {
        "POL": "POL-144157",
        "mmsId": "9952384998501401",
        "SortDate": "2024-05-15",
        "AccessModel": "None",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Shea, Daniel M. author.",
        "Author": "Jacobs, Nicholas F., author.",
        "Format": "E",
        "isbn13": "9780231211581",
        "ISBNS": "9780231558983; 0231558988; 0231211589; 9780231211581",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "2024-05-15",
        "ReportingCode": "Political Science",
        "Title": "The Rural Voter : The Politics Of Place And The Disuniting Of America /",
        "POtitle": "The Rural Voter : The Politics Of Place And The Disuniting Of America / Nicholas F. Jacobs And Daniel M. Shea.",
        "VendorName": "GOBI - Library Solutions from EBSCO",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-15",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "The widening gulf between rural and urban America is becoming the most serious political divide of our day. Support for Democrats, up and down the ballot, has plummeted throughout the countryside, and the entire governing system is threatened by one-party dominance. After Donald Trump's surprising victories throughout rural America, pundits and journalists went searching for answers, popping into roadside diners and opining from afar. Rural Americans are supposedly bigots, culturally backwards, lazy, scared of the future, and radical. But is it that simple? Is the country splintering between two very different Americas--one rural, one urban? This pathbreaking book pinpoints forces behind the rise of the \"rural voter\"--a new political identity that combines a deeply felt sense of place with an increasingly nationalized set of concerns. Combining a historical perspective with the largest-ever national survey of rural voters, Nicholas F. Jacobs and Daniel M. Shea uncover how this overwhelmingly crucial voting bloc emerged and how it has roiled American politics. They show how perceptions of economic and social change, racial anxieties, and a traditional way of life under assault have converged into a belief in rural uniqueness and separateness. Rural America believes it rises and falls together, and that the Democratic Party stands in the way. An unparalleled exploration of rural partisanship, this book offers a timely warning that the chasm separating urban and rural Americans cannot be papered over with policies or rhetoric. Instead, The Rural Voter demonstrates, this division strikes at the heart of enduring conflicts over American identity.",
        "coverurl": [
            "https://books.google.com/books/content?id=qUDuzwEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "12340"
        ]
    },
    {
        "POL": "POL-144155",
        "mmsId": "9951692015601401",
        "SortDate": "2024-05-15",
        "AccessModel": "None",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "ProQuest (Firm)",
        "Author": "Gupta, Sunil, 1958- author.",
        "Format": "E",
        "isbn13": "9781633692688",
        "ISBNS": "1633692698; 9781633692695; 9781633692688; 163369268X",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "2024-05-15",
        "ReportingCode": "Business",
        "Title": "Driving Digital Strategy : A Guide To Reimagining Your Business /",
        "POtitle": "Driving Digital Strategy : A Guide To Reimagining Your Business / By Sunil Gupta.",
        "VendorName": "GOBI - Library Solutions from EBSCO",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-15",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "Introduction: Framework for reinventing your business -- Part One. Re-imagine your business: Business scope -- Business model -- Platforms and ecosystems -- Part Two. Re-evaluate your value chain: Rethinking R&D and innovation -- Operational excellence -- Omnichannel strategy -- Part Three. Re-connect with customers: Acquiring customers -- Engaging consumers -- Measuring and optimizing marketing spend -- Part Four. Re-build your organization: Managing digital transition -- Designing an organization for innovation -- Skills, capability, and talent management",
        "coverurl": [
            "https://covers.openlibrary.org/b/isbn/9781633692688-L.jpg",
            33443
        ]
    },
    {
        "POL": "POL-144154",
        "mmsId": "9952445943401401",
        "SortDate": "2024-05-15",
        "AccessModel": "None",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "",
        "Author": "",
        "Format": "E",
        "isbn13": "9781682196199",
        "ISBNS": "1682196208; 9781682196205; 9781682196199; 1682196194",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "2024-05-15",
        "ReportingCode": "Jewish Studies",
        "Title": "Deluge : Gaza And Israel From Crisis To Cataclysm /",
        "POtitle": "Deluge : Gaza And Israel From Crisis To Cataclysm / Edited By Jamie Stern-weiner.",
        "VendorName": "GOBI - Library Solutions from EBSCO",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-15",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "Why did Hamas attack? What is Israel trying to achieve? Did this catastrophe have to happen? And is there a way forward? The book's expert contributors address these and other questions, which have never been more urgent. In September 2023, US National Security Advisor Jake Sullivan boasted that the Middle East \"is quieter today than it has been in two decades.\" One week later, unprecedented violence in Gaza and Israel shattered the status quo and shocked the world. Hamas's Operation Al-Aqsa Deluge punctured delusions of stability as hundreds of militants burst forth from the Gaza prison camp. In the ensuing carnage and firefights, 1,200 Israelis were killed and hundreds more taken hostage. Israel's retaliation turned the besieged enclave into a howling wasteland. Nearly 20,000 people were killed in two months, including more than 7,000 children, and over 60 percent of homes were damaged or destroyed. Israel targeted the wounded and infirm, newborns and near-dead, as Gaza's healthcare system--hospitals, clinics, ambulances, medical personnel--came under a systematic attack unprecedented in the annals of modern warfare. The Hamas massacre and the Israeli extermination campaign which followed together mark a historic turning point in the Israel-Palestine conflict. The reverberations have also shaken politics far beyond, not least in Europe and the United States, where gigantic, round-the-clock protests for Palestinian rights pitted politicians against the public and exposed a growing statist authoritarianism. In this groundbreaking book--the first published about the 2023 Gaza war--leading Palestinian, Israeli, and international authorities put these momentous developments in context and provide an initial taking-stock. Contributors: Musa Abuhashhash, Ahmed Alnaouq, Nathan J. Brown, Yaniv Cogan, Clare Daly MEP, Talal Hangari, Khaled Hroub, R. J., Colter Louwerse, Mitchell Plitnick, Mouin Rabbani, Sara Roy, and Avi Shlaim",
        "coverurl": [
            "https://books.google.com/books/content?id=8U9V0AEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "17869"
        ]
    },
    {
        "POL": "POL-144153",
        "mmsId": "9951840102401401",
        "SortDate": "2024-05-15",
        "AccessModel": "None",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "",
        "Author": "LeFlouria, Talitha L.",
        "Format": "E",
        "isbn13": "9781469622477",
        "ISBNS": "9798890847638; 1469622483; 9781469622484; 1469623285; 9781469623283; 1469630001; 9781469630007; 1469622475; 9781469622477",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "2024-05-15",
        "ReportingCode": "Criminal Justice",
        "Title": "Chained In Silence Black Women And Convict Labor In The New South /",
        "POtitle": "Chained In Silence Black Women And Convict Labor In The New South / Talitha L. Leflouria.",
        "VendorName": "GOBI - Library Solutions from EBSCO",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-15",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "\"Portions of the text were previously published as 'The Hand That Rocks the Cradle Cuts Cordwood: Exploring Black Women's Lives and Labor in Georgia's Convict Camps, 1865-1917, ' Labor: Studies in Working-Class History of the Americas 8, no. 3 (fall 2011)\"--Copyright page.",
        "coverurl": [
            "https://covers.openlibrary.org/b/isbn/9781469622477-L.jpg",
            38832
        ]
    },
    {
        "POL": "POL-144152",
        "mmsId": "9952330303701401",
        "SortDate": "2024-05-15",
        "AccessModel": "None",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Rauch, Daniel A., editor.; Gershel, Jeffrey C., editor.",
        "Author": "",
        "Format": "E",
        "isbn13": "9781610026321",
        "ISBNS": "1610026330; 9781610026338; 1610026322; 9781610026321",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "2024-05-15",
        "ReportingCode": "Medicine",
        "Title": "Caring For The Hospitalized Child : A Handbook Of Inpatient Pediatrics /",
        "POtitle": "Caring For The Hospitalized Child : A Handbook Of Inpatient Pediatrics / Section On Hospital Medicine American Academy Of Pediatrics ; Edited By Jeffrey C. Gershel, Daniel A. Rauch.",
        "VendorName": "GOBI - Library Solutions from EBSCO",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-15",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "Developed by top pediatric hospitalists, Caring for the Hospitalized Child: A Handbook of Inpatient Pediatrics, 3rd Edition, is sure to become your go-to resource from initial patient evaluation all the way through discharge management. Quickly obtain the essential information for managing a wide range of pediatric medical conditions in patients who have been admitted to the hospital with this trusted, pocket-sized reference. Each chapter not only discusses clinical presentation, essential laboratory tests, differential diagnosis, treatment, indications for consultation, and disposition but contains many helpful tables and an easy-to-follow template. Chapters also include a short bulleted list of essential pearls and pitfalls. Although the book focuses primarily on diseases and conditions, it contains helpful sections that address the many other issues practicing hospitalists are confronted with, including ethics, billing, utilization management, surge planning, and transport, as well as a brief section on common equipment. The alphabetized Contents has been updated to include Autism Spectrum Disorder, Hypertension, Constipation, Surge Planning, Utilization Management, and both Acute COVID-19 Disease and Multisystem Inflammatory Syndrome in Children (MIS-C). A new part on newborn care has been added, covering topics such as breastfeeding, hypoglycemia of the newborn, and early onset sepsis.",
        "coverurl": [
            "https://books.google.com/books/content?id=V-VBzwEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "10918"
        ]
    },
    {
        "POL": "POL-144151",
        "mmsId": "9952281287701401",
        "SortDate": "2024-05-15",
        "AccessModel": "None",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "",
        "Author": "Dolan, Kathryn Cornell.",
        "Format": "E",
        "isbn13": "9781789146950",
        "ISBNS": "178914728X; 9781789147285; 9781789146950; 178914695X",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "2024-05-15",
        "ReportingCode": "Chemical Engineering",
        "Title": "Breakfast Cereal : A Global History.",
        "POtitle": "Breakfast Cereal : A Global History.",
        "VendorName": "GOBI - Library Solutions from EBSCO",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-15",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "A global history of breakfast cereal, from the first grain porridges to off-brand Cheerios. Simple, healthy, and comforting, breakfast cereals are a perennially popular way to start the day. This book examines cereal’s long, distinguished, and surprising history—dating back to when, around 10,000 years ago, the agricultural revolution led people to break their fasts with wheat, rice, and corn porridges. Only in the second half of the nineteenth century did entrepreneurs and food reformers create the breakfast cereals we recognize today: Kellogg’s Corn Flakes, Cheerios, and Quaker Oats, among others. In this entertaining, well-illustrated account, Kathryn Cornell Dolan explores the history of breakfast cereals, including many historical and modern recipes that the reader can try at home.",
        "coverurl": [
            "https://books.google.com/books/content?id=G5GjEAAAQBAJ&printsec=frontcover&img=1&zoom=10&source=gbs_api",
            "48977"
        ]
    },
    {
        "POL": "POL-144150",
        "mmsId": "9952449951401401",
        "SortDate": "2024-05-15",
        "AccessModel": "One concurrent User (1U)",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Cai, Rovina, 1988- illustrator.",
        "Author": "Little Badger, Darcie, 1987- author.",
        "Format": "E",
        "isbn13": "9781646143795",
        "ISBNS": "1646144023; 9781646144020; 9781646143795; 1646143795",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "2024-05-17",
        "ExpPortfolioActivationDate": "2024-05-15",
        "ReportingCode": "Favat",
        "Title": "Sheine Lende : A Prequel To Elatsoe /",
        "POtitle": "Sheine Lende : A Prequel To Elatsoe",
        "VendorName": "Proquest LLC (Coutts Information Services Division)",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-15",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "Shane works with her mother and their ghost dogs, tracking down missing persons even when their families can't afford to pay. Their own family was displaced from their traditional home years ago following a devastating flood - and the loss of Shane's father and her grandparents. They don't think they'll ever get their home back. Then Shane's mother and a local boy go missing, after a strange interaction with a fairy ring. Shane, her brother, her friends, and her lone, surviving grandparent - who isn't to be trusted - set off on the road to find them. But they may not be anywhere in this world - or this place in time. Nevertheless, Shane is going to find them. Darcie Little Badger's Elatsoe launched her career and in the years since has become a beloved favorite. This prequel to Elatsoe, centered on Ellie's grandmother, deepens and expands Darcie's one-of-a-kind world and introduces us to another cast of characters that will wend their way around readers' hearts.",
        "coverurl": [
            "https://books.google.com/books/content?id=SQLazwEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "14000"
        ]
    },
    {
        "POL": "POL-143738",
        "mmsId": "9952441252501401",
        "SortDate": "2024-05-15",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "",
        "Author": "MacCarthy, Mark, author.",
        "Format": "P",
        "isbn13": "9780815739821",
        "ISBNS": "0815740158; 9780815740155; 0815739818; 9780815739814; 9780815739821; 0815739826",
        "MaterialType": "Book",
        "POLineTypeName": "Physical - One Time",
        "ReceivingDate": "2024-05-15",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Computer Science",
        "Title": "Regulating Digital Industries : How Public Oversight Can Encourage Competition, Protect Privacy, And Ensure Free Speech /",
        "POtitle": "Regulating Digital Industries: How Public Oversight Can Encourage Competition, Protect Privacy, And",
        "VendorName": "GOBI - Library Solutions From EBSCO",
        "LibraryName": "F.W. Olin Library",
        "Description": "",
        "LocationName": "Non-Fiction",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "343.0999 M1234 2023",
        "TitleCreationDate": "2024-04-09",
        "Barcode": "33086005527833",
        "PhysicalItemId": "23466315950001401",
        "summary": "Regulating Digital Industries calls for a single industry regulatory agency to promote competition, privacy and free speech in digital industries.",
        "coverurl": [
            "https://books.google.com/books/content?id=m4jYEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "13557"
        ]
    },
    {
        "POL": "POL-144125",
        "mmsId": "9952449352801401",
        "SortDate": "2024-05-14",
        "AccessModel": "One concurrent User (1U)",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "LeMahieu, Paul G., author.; Grunow, Alicia, author.; Gomez, Louis M., author.",
        "Author": "Bryk, Anthony S., author.",
        "Format": "E",
        "isbn13": "9781612507910",
        "ISBNS": "9781612507958; 1612507956; 9781612507910; 1612507913",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "2024-05-14",
        "ExpPortfolioActivationDate": "2024-05-14",
        "ReportingCode": "Physical Therapy",
        "Title": "Learning To Improve : How America's Schools Can Get Better At Getting Better /",
        "POtitle": "Learning To Improve : How America's Schools Can Get Better At Getting Better",
        "VendorName": "Proquest LLC (Coutts Information Services Division)",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-14",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "Using ideas borrowed from improvement science, Learning to Improve shows how a process of disciplined inquiry can be combined with the use of networks to identify, adapt, and successfully scale up promising interventions in education. Rather than \"implementing fast and learning slow,\" the authors believe educators should adopt a more rigorous approach to improvement that allows the field to \"learn fast to implement well.\" The authors focus on six principles that represent the foundational elements for improvement science carried out in networked communities: Make the work problem-specific and user-centered Focus on variation in performance See the system that produces the current outcomes We cannot improve at scale what we cannot measure Use disciplined inquiry to drive improvement Accelerate learning through networked communities Learning to Improve offers a new paradigm for research and development in education that promises to be a powerful driver of improvement for the nation's schools and colleges. \"In this hopeful and accessible volume, Bryk and his colleagues describe six tenets for addressing vexing problems of educational practice. Yes, systematic actions guided by serious scientific inquiry can lead to improvements in a vast array of contexts, topics, and settings. Drawing on numerous real life examples and illustrations, the authors demonstrate how to develop and then critically execute good ideas to produce reliably positive outcomes.\" -- John Q. Easton, distinguished senior fellow, Spencer Foundation Anthony S. Bryk is the president of the Carnegie Foundation for the Advancement of Teaching. Louis M. Gomez holds the MacArthur Chair in Digital Media and Learning in the Graduate School of Education & Information Studies at the University of California, Los Angeles, and is a senior partner at Carnegie. Alicia Grunow is a senior partner and co-director of the Center for Networked Improvement at Carnegie. Paul G. LeMahieu is the senior vice president for programs at Carnegie and the former superintendent of education for the state of Hawaii.",
        "coverurl": [
            "https://covers.openlibrary.org/b/isbn/9781612507910-L.jpg",
            46723
        ]
    },
    {
        "POL": "POL-144122",
        "mmsId": "9952450352601401",
        "SortDate": "2024-05-14",
        "AccessModel": "Three concurrent Users (3U)",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "",
        "Author": "Martin, Craig, 1976- author.",
        "Format": "E",
        "isbn13": "9781138202245",
        "ISBNS": "1315474395; 9781315474397; 1315474409; 9781315474403; 1315474387; 9781315474380; 1315474417; 9781315474410; 9781138202252; 1138202258; 041541993X; 9780415419932; 9781138202245; 113820224X",
        "MaterialType": "Book",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "2024-05-14",
        "ExpPortfolioActivationDate": "2024-05-14",
        "ReportingCode": "Religion",
        "Title": "A Critical Introduction To The Study Of Religion /",
        "POtitle": "A Critical Introduction To The Study Of Religion",
        "VendorName": "Proquest LLC (Coutts Information Services Division)",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "",
        "TemporaryLocationName": "",
        "PermanentCallNumber": "",
        "TitleCreationDate": "2024-05-14",
        "Barcode": "",
        "PhysicalItemId": "",
        "summary": "This revised second edition of A Critical Introduction to the Study of Religion introduces the key concepts and theories from religious studies that are necessary for a full understanding of the complex relations between religion and society. The aim is to provide readers with an arsenal of critical concepts for studying religious ideologies, practices, and communities. Throughout the discussion all ideas and theories are clearly illustrated with new and engaging examples and case studies. The second edition has been restructured to clearly emphasize key concepts including: essentialism, functionalism, authority, and domination. \"",
        "coverurl": [
            "https://books.google.com/books/content?id=nwY_vgAACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "16315"
        ]
    },
    {
        "POL": "POL-143815",
        "mmsId": "9952441352701401",
        "SortDate": "2024-05-13",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Random House (Firm), publisher.",
        "Author": "Smith, Patti, author.",
        "Format": "P",
        "isbn13": "9780593448557",
        "ISBNS": "0593448545; 9780593448540; 9780593448557; 0593448553",
        "MaterialType": "Book",
        "POLineTypeName": "Physical - One Time",
        "ReceivingDate": "2024-05-13",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Art",
        "Title": "A Book Of Days /",
        "POtitle": "Book Of Days.",
        "VendorName": "GOBI - Library Solutions From EBSCO",
        "LibraryName": "F.W. Olin Library",
        "Description": "",
        "LocationName": "Non-Fiction",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "782.42166 S656b 2022",
        "TitleCreationDate": "2024-04-16",
        "Barcode": "33086005527817",
        "PhysicalItemId": "23465806010001401",
        "summary": "NEW YORK TIMES BESTSELLER • A deeply moving and brilliantly idiosyncratic visual book of days by the National Book Award–winning author of Just Kids and M Train, featuring more than 365 images and reflections that chart Smith’s singular aesthetic—inspired by her wildly popular Instagram. ONE OF THE BEST BOOKS OF THE YEAR: Variety, Pitchfork, PopSugar In 2018, without any plan or agenda for what might happen next, Patti Smith posted her first Instagram photo: her hand with the simple message “Hello Everybody!” Known for shooting with her beloved Land Camera 250, Smith started posting images from her phone including portraits of her kids, her radiator, her boots, and her Abyssinian cat, Cairo. Followers felt an immediate affinity with these miniature windows into Smith’s world, photographs of her daily coffee, the books she’s reading, the graves of beloved heroes—William Blake, Dylan Thomas, Sylvia Plath, Simone Weil, Albert Camus. Over time, a coherent story of a life devoted to art took shape, and more than a million followers responded to Smith’s unique aesthetic in images that chart her passions, devotions, obsessions, and whims. Original to this book are vintage photographs: anniversary pearls, a mother’s keychain, and a husband’s Mosrite guitar. Here, too, are photos from Smith’s archives of life on and off the road, train stations, obscure cafés, a notebook always nearby. In wide-ranging yet intimate daily notations, Smith shares dispatches from her travels around the world. With over 365 photographs taking you through a single year, A Book of Days is a new way to experience the expansive mind of the visionary poet, writer, and performer. Hopeful, elegiac, playful—and complete with an introduction by Smith that explores her documentary process—A Book of Days is a timeless offering for deeply uncertain times, an inspirational map of an artist’s life.",
        "coverurl": [
            "https://books.google.com/books/content?id=hDJgEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "11112"
        ]
    },
    {
        "POL": "POL-144199",
        "mmsId": "9952451052401401",
        "SortDate": "0000-00-00",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "",
        "Author": "Linsmeier, Amanda, author.",
        "Format": "P",
        "isbn13": "9780593707784",
        "ISBNS": "0593707761; 9780593707760; 059370777X; 9780593707777; 0593707796; 9780593707791; 9780593707784; 0593707788",
        "MaterialType": "Book",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Favat",
        "Title": "Six Of Sorrow /",
        "POtitle": "Six Of Sorrow / Amanda Linsmeier.",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "Favat Children's & Young Adult Collection",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "PZ7.1.L5645 Si 2024",
        "TitleCreationDate": "2024-05-17",
        "Barcode": "",
        "PhysicalItemId": "23468525960001401",
        "summary": "Sixteen years ago, six girls were born on the same day—and now, on their birthday, one of them is missing. From the author of Starlings comes a story about small-towns, friendships, and the terrifying things your parents don't tell you, that's perfect for fans of Yellowjackets. For most of her life, Isabeau and her five best friends were inseparable—amazingly enough, the six girls even shared a birthday. Then a rift caused their friendships to fracture, and Iz lost everyone except Reuel, the only one who didn’t abandon her. Until now. The night of their sixteenth birthday, Isabeau leaves Reuel sitting on her front porch and heads home—and in the morning, Reuel is missing. She’s gone for two days, and when she reappears, there’s something wrong with her. She’s sick. Really sick. And she doesn’t remember anything that happened while she was gone. If there’s any bright side to the situation, it’s that Reuel’s peculiar disappearance brings the six girls back together. Their sisterhood feels as strong as it was years ago, but when another one of them disappears, they all agree that they must have more in common than simply their birthday. They all feel it. Something’s been waiting for them, and that something has come to claim them one by one. Deep in their bones, they know—it’s just a matter of time until they they’re all taken. And if they don’t save themselves, no one will.",
        "coverurl": [
            "https://books.google.com/books/content?id=hxjZEAAAQBAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "12348"
        ]
    },
    {
        "POL": "POL-144197",
        "mmsId": "9952451052601401",
        "SortDate": "0000-00-00",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "",
        "Author": "Adeyemi, Tomi, author.",
        "Format": "P",
        "isbn13": "9781250171016",
        "ISBNS": "1250171016; 9781250171016",
        "MaterialType": "Book",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Favat",
        "Title": "Children Of Anguish And Anarchy /",
        "POtitle": "Children Of Anguish And Anarchy / Tomi Adeyemi.",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "Favat Children's & Young Adult Collection",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "PZ7.1.A24 Ce 2024",
        "TitleCreationDate": "2024-05-17",
        "Barcode": "",
        "PhysicalItemId": "23468526020001401",
        "summary": "Featuring gorgeous spray-painted and stenciled edges, dazzling metallic foil designs on the jacket and case, and an exclusive endpaper map that reveals new unexplored territories, Tomi Adeyemi’s #1 New York Times-bestselling Legacy of Orïsha series comes to an earth-shaking conclusion. New allies rise. The Blood Moon nears. Zélie faces her final enemy. The king who hunts her heart. When Zelie seized the royal palace that fateful night, she thought her battles had come to an end. The monarchy had finally fallen. The maji had risen again. Zélie never expected to find herself locked in a cage and trapped on a foreign ship. Now warriors with iron skulls traffic her and her people across the seas, far from their homeland. Then everything changes when Zélie meets King Baldyr, her true captor, the ruler of the Skulls, and the man who has ravaged entire civilizations to find her. Baldyr’s quest to harness Zélie’s strength sends Zélie, Amari, and Tzain searching for allies in unknown lands. But as Baldyr closes in, catastrophe charges Orïsha’s shores. It will take everything Zélie has to face her final enemy and save her people before the Skulls annihilate them for good.",
        "coverurl": [
            "https://books.google.com/books/content?id=3hHYEAAAQBAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "15861"
        ]
    },
    {
        "POL": "POL-144196",
        "mmsId": "9952451052701401",
        "SortDate": "0000-00-00",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "",
        "Author": "Selznick, Brian, author, illustrator.",
        "Format": "P",
        "isbn13": "9781338777246",
        "ISBNS": "1338777246; 9781338777246",
        "MaterialType": "Book",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Favat",
        "Title": "Kaleidoscope /",
        "POtitle": "Kaleidoscope / Brian Selznick.",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "Favat Children's & Young Adult Collection",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "PZ7.S4654 Kal 2021",
        "TitleCreationDate": "2024-05-17",
        "Barcode": "",
        "PhysicalItemId": "23468526050001401",
        "summary": "A ship. A garden. A library. In Kaleidoscope, the incomparable Brian Selznick presents the story of two people bound to each other through time and space, memory and dreams. At the centre of their relationship is a mystery about the nature of grief and love which will look different to each reader. Kaleidoscopeis a feat of storytelling that illuminates how even the wildest tales can help us in the hardest times. Brian Selznick's first book, The Invention of Hugo Cabret, was the winner of the esteemed Caldecott Medal, the first novel to do so, as the Caldecott Medal is for picture books Released as a live-action film Hugo in 2011, directed by Martin Scorsase and starring Asa Butterfield, Ben Kingsley, Jude Law, Sacha Baron Cohen, Richard Griffiths, Ray Winstone, and Christopher Lee. Brian Selznick's second book, Wonderstruck, was also made into a feature film, starring Julianne Moore and Michelle Williams",
        "coverurl": [
            "https://books.google.com/books/content?id=y85AzgEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "10812"
        ]
    },
    {
        "POL": "POL-144195",
        "mmsId": "9952451052801401",
        "SortDate": "0000-00-00",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "",
        "Author": "Reintgen, Scott, author.",
        "Format": "P",
        "isbn13": "9781665918701",
        "ISBNS": "1665918683; 9781665918688; 1665918691; 9781665918695; 9781665918701; 1665918705",
        "MaterialType": "Book",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Favat",
        "Title": "A Door In The Dark /",
        "POtitle": "A Door In The Dark / Scott Reintgen.",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "Favat Children's & Young Adult Collection",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "PZ7.1.R4554 Do 2023",
        "TitleCreationDate": "2024-05-17",
        "Barcode": "",
        "PhysicalItemId": "23468526080001401",
        "summary": "An instant New York Times bestseller! “For readers who have just finished Naomi Novik’s The Golden Enclaves and are ravenous for more dark academia” (Booklist), this “pulse-pounding” (Publishers Weekly, starred review) fantasy thriller follows six teenage wizards as they fight to make it home alive after a malfunctioning spell leaves them stranded in the wilderness. Ren Monroe has spent four years proving she’s one of the best wizards in her generation. But top marks at Balmerick University will mean nothing if she fails to get recruited into one of the major houses. Enter Theo Brood. If being rich were a sin, he’d already be halfway to hell. After a failed and disastrous party trick, fate has the two of them crossing paths at the public waxway portal the day before holidays; Theo’s punishment is to travel home with the scholarship kids—which doesn’t sit well with any of them. A fight breaks out. In the chaos, the portal spell malfunctions. All six students are snatched from the safety of the school’s campus and set down in the middle of nowhere. And one of them is dead on arrival. If anyone can get them through the punishing wilderness with limited magical reserves it’s Ren. She’s been in survival mode her entire life. But no magic could prepare her for the tangled secrets the rest of the group is harboring, or for what’s following them through the dark woods…",
        "coverurl": [
            "https://books.google.com/books/content?id=Usd0EAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "10161"
        ]
    },
    {
        "POL": "POL-144191",
        "mmsId": "9952450750801401",
        "SortDate": "0000-00-00",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Smith, Sydney, 1980- illustrator.",
        "Author": "Scott, Jordan, 1978- author.",
        "Format": "P",
        "isbn13": "9780823445592",
        "ISBNS": "9780823445592; 0823445593",
        "MaterialType": "Book",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Favat",
        "Title": "I Talk Like A River /",
        "POtitle": "I Talk Like A River / Words By Jordan Scott ; Pictures By Sydney Smith.",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "Favat Children's & Young Adult Collection",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "PZ7.1.S336845 Ita 2020",
        "TitleCreationDate": "2024-05-16",
        "Barcode": "",
        "PhysicalItemId": "23468455510001401",
        "summary": "Winner of the Schneider Family Book Award Boston Globe-Horn Book Award Winner What if words got stuck in the back of your mouth whenever you tried to speak? What if they never came out the way you wanted them to? Sometimes it takes a change of perspective to get the words flowing. A New York Times Best Children's Book of the Year I wake up each morning with the sounds of words all around me. And I can't say them all . . . When a boy who stutters feels isolated, alone, and incapable of communicating in the way he'd like, it takes a kindly father and a walk by the river to help him find his voice. Compassionate parents everywhere will instantly recognize a father's ability to reconnect a child with the world around him. Poet Jordan Scott writes movingly in this powerful and ultimately uplifting book, based on his own experience, and masterfully illustrated by Greenaway Medalist Sydney Smith. A book for any child who feels lost, lonely, or unable to fit in. Finalist for the BC and Yukon Christie Harris Illustrated Children’s Literature Prize A Charlotte Zolotow Honor Book An American Library Association Notable Children’s Book ILA Primary Fiction Honoree Named a Best Book of the Year by The Wall Street Journal, People Magazine, NPR, Kirkus Reviews, Shelf Awareness, Bookpage, School Library Journal, Publishers Weekly, Publishers Lunch, and more! A Horn Book Fanfare Best Book of the Year A Junior Library Guild Gold Standard Selection A Bank Street Best Childrens Book of the Year! A Chicago Public Library Best Book of the Year A CBC Best Picture Book of the Year A Kids' Book Choice Award Finalist",
        "coverurl": [
            "https://books.google.com/books/content?id=mBUAEAAAQBAJ&printsec=frontcover&img=1&zoom=10&source=gbs_api",
            "66145"
        ]
    },
    {
        "POL": "POL-144190",
        "mmsId": "9952450750901401",
        "SortDate": "0000-00-00",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "",
        "Author": "Cotter, Erin, author.",
        "Format": "P",
        "isbn13": "9781665940733",
        "ISBNS": "1665940719; 9781665940719; 1665940727; 9781665940726; 9781665940733; 1665940735",
        "MaterialType": "Book",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Favat",
        "Title": "By Any Other Name /",
        "POtitle": "By Any Other Name / Erin Cotter.",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "Favat Children's & Young Adult Collection",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "PZ7.1.C674766 By 2023",
        "TitleCreationDate": "2024-05-16",
        "Barcode": "",
        "PhysicalItemId": "23468455550001401",
        "summary": "A down-on-his-luck actor and an English lord reluctantly team up to solve the murder of Christopher Marlowe in this Shakespearean-era young adult romp perfect for fans of F.T. Lukens and Mackenzi Lee. London, 1593. Sixteen-year-old Will Hughes is busy working on Shakespeare’s stage, stuffing his corsets with straw and pretending to be someone else. Offstage, he's playing a part, too. The son of traitors, Will is desperate to keep his identity secret—or risk being killed in the bloody queen’s imperial schemes. All he wants is to lay low until he earns enough coin to return to his family. But when his mentor, the famous playwright Christopher Marlowe, is murdered under mysterious circumstances, Will’s plans are hopelessly dashed. What’s worse, Marlowe was a spy for the queen, tasked with stalking a killer rumored to be part of an elusive order of assassins, and his secrets and untimely death have put Will under a harsh spotlight. And so, when Will unwittingly foils an attempt on the queen’s life, she names him her next spymaster. Now, to avoid uncomfortable questions, prison, or an even more terrible fate, Will reluctantly starts his new career, which—yes—will secure him the resources to help his family…but at what cost? Adding insult to injury is the young Lord James Bloomsbury, Will’s new comrade in arms, whose entitled demeanor and unfairly handsome looks get under Will’s skin immediately. Together, the two hunt the cunning assassin, defend the queen’s life, and pray to keep their own...all while an unexpected connection blossoms between them.",
        "coverurl": [
            "https://books.google.com/books/content?id=qxOsEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "14911"
        ]
    },
    {
        "POL": "POL-144189",
        "mmsId": "9952450751001401",
        "SortDate": "0000-00-00",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "",
        "Author": "Kumagai, Clara, author.",
        "Format": "P",
        "isbn13": "9798887070476",
        "ISBNS": "1419768514; 9781419768514; 9798887070476",
        "MaterialType": "Book",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Favat",
        "Title": "Catfish Rolling /",
        "POtitle": "Catfish Rolling / Clara Kumagai.",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "Favat Children's & Young Adult Collection",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "PZ7.1.K846335 Cat 2023",
        "TitleCreationDate": "2024-05-16",
        "Barcode": "",
        "PhysicalItemId": "23468455580001401",
        "summary": "“Excellent, evocative, and thoughtful with genuine depth” (New York Times bestselling author Nicola Yoon), Catfish Rolling is a wholly original and mind-bending debut YA novel by Clara Kumagai about memory, family, and an earthquake that breaks apart time. There’s a catfish under Japan, and when it rolls the land rises and falls. At least that’s what Sora was told after she lost her mother to an earthquake so powerful that it cracked time itself. Sora and her father are some of the few who still live near one of these “zones”—the places where time has been irrevocably sped up or slowed down. Sora’s father leads a research team studying the zones, and even as his colleagues begin to fall ill, he refuses to stop entering the zones himself. Sora finds herself stuck and increasingly alone as her father starts behaving strangely—he’s disoriented and his memory seems to be deteriorating. Sora, meanwhile, has been secretly conducting her own research on the zones, tracking down a time expert in Tokyo and surprising herself with a crush on a strikingly confident girl named Maya, another hafu girl with whom she forms an instant bond. But when Sora’s father disappears, she has no choice but to return home, with Maya in tow, and venture deep into the abandoned time zones to find him and perhaps the catfish itself . . .",
        "coverurl": [
            "https://books.google.com/books/content?id=OymtEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "20960"
        ]
    },
    {
        "POL": "POL-144188",
        "mmsId": "9952450751101401",
        "SortDate": "0000-00-00",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "",
        "Author": "Takaoka, Shannon, author.",
        "Format": "P",
        "isbn13": "9781536228786",
        "ISBNS": "9781536228786; 1536228788",
        "MaterialType": "Book",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Favat",
        "Title": "The Totally True Story Of Gracie Byrne /",
        "POtitle": "The Totally True Story Of Gracie Byrne / Shannon Takaoka.",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "Favat Children's & Young Adult Collection",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "PZ7.1.T35365 Tot 2023",
        "TitleCreationDate": "2024-05-16",
        "Barcode": "",
        "PhysicalItemId": "23468455610001401",
        "summary": "Gracie feels like a minor character in her own life story--until a mysterious journal turns her fictional stories into reality. It's 1987, and sixteen-year-old Gracie Byrne wishes her life were totally different. Shy and awkward, she has trouble fitting in at her new school, she's still reeling from her parents' divorce, and her grandmother Katherine's Alzheimer's is getting worse. So when Gracie finds a blank journal in Katherine's vanity drawer, she begins writing stories about herself--a more popular version of herself, that is. But then the hot guy in her art class describes a dream he had about her--the exact scene she wrote about him in her journal--and Gracie realizes that she can create any reality she wants, from acing tests to winning the attention of her previously indifferent classmates. As her ability to change what is into what she wishes it to be grows stronger, though, Gracie starts to second-guess what's real--especially when it comes to a budding relationship with her cute neighbor, Tom. This compelling story deftly blends friendship, family, and romance . . . and bends the bounds of reality itself.",
        "coverurl": [
            "https://books.google.com/books/content?id=csqgzwEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "14075"
        ]
    },
    {
        "POL": "POL-144187",
        "mmsId": "9952450751201401",
        "SortDate": "0000-00-00",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Pham, LeUyen, illustrator.",
        "Author": "Yang, Gene Luen, author.",
        "Format": "P",
        "isbn13": "9781250365903",
        "ISBNS": "1626728100; 9781626728103; 1250908264; 9781250908261; 9781250365903; 1250365902",
        "MaterialType": "Book",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Favat",
        "Title": "Lunar New Year Love Story /",
        "POtitle": "Lunar New Year Love Story / Written By Gene Luen Yang ; Art By Leuyen Pham.",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "Favat Children's & Young Adult Collection",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "PS3625.A6775 L86 2024",
        "TitleCreationDate": "2024-05-16",
        "Barcode": "",
        "PhysicalItemId": "23468455640001401",
        "summary": "Graphic novel superstars Gene Luen Yang and LeUyen Pham join forces in this heartwarming rom-com about fate, family, and falling in love. She was destined for heartbreak. Then fate handed her love. Val is ready to give up on love. It's led to nothing but secrets and heartbreak, and she's pretty sure she's cursed—no one in her family, for generations, has ever had any luck with love. But then a chance encounter with a pair of cute lion dancers sparks something in Val. Is it real love? Could this be her chance to break the family curse? Or is she destined to live with a broken heart forever?",
        "coverurl": [
            "https://books.google.com/books/content?id=BkLnEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "14111"
        ]
    },
    {
        "POL": "POL-144186",
        "mmsId": "9952450751301401",
        "SortDate": "0000-00-00",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "",
        "Author": "Roberts, Lauren, 2002- author.",
        "Format": "P",
        "isbn13": "9781665954907",
        "ISBNS": "1665954884; 9781665954884; 1665954892; 9781665954891; 9781665954907; 1665954906",
        "MaterialType": "Book",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Favat",
        "Title": "Powerless /",
        "POtitle": "Powerless / Lauren Roberts.",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "Favat Children's & Young Adult Collection",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "PZ7.1.R5936 Po 2023",
        "TitleCreationDate": "2024-05-16",
        "Barcode": "",
        "PhysicalItemId": "23468455670001401",
        "summary": "A New York Times bestseller! This sparkling edition includes a special case stamping, bonus content, and a teaser to book two in this heart-pounding series! Perfect for fans of Sarah J. Maas, this young adult fantasy follows the forbidden romance between a powerful prince and an ordinary girl as they try to survive their kingdom’s grueling laws pitting them against each other. She is the very thing he’s spent his whole life hunting. He is the very thing she’s spent her whole life pretending to be. Only the extraordinary belong in the kingdom of Ilya—the exceptional, the empowered, the Elites. The powers these Elites have possessed for decades were graciously gifted to them by the Plague, though not all were fortunate enough to both survive the sickness and reap the reward. Those born Ordinary are just that—ordinary. And when the king decreed that all Ordinaries be banished to preserve his Elite society, lacking an ability suddenly became a crime—making Paedyn Gray a felon by fate and a thief by necessity. Surviving in the slums as an Ordinary is no simple task, and Paedyn knows this better than most. Having been trained by her father to be keenly observant since she was a child, Paedyn poses as a Psychic in the crowded city, blending in with the Elites as best she can to stay alive and out of trouble…easier said than done. When Paeydn unsuspectingly saves one of Ilya’s princes, she finds herself thrown into the Purging Trials. The brutal competition exists to showcase the Elites’ powers—the very thing Paedyn lacks. If the Trials and the opponents within them don’t kill her, the prince she’s fighting feelings for certainly will if he discovers what she is…completely Ordinary.",
        "coverurl": [
            "https://books.google.com/books/content?id=w3m-EAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "15318"
        ]
    },
    {
        "POL": "POL-144185",
        "mmsId": "9952450751401401",
        "SortDate": "0000-00-00",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "",
        "Author": "Lacelle, Pascale, author.",
        "Format": "P",
        "isbn13": "9781665939294",
        "ISBNS": "1665939273; 9781665939270; 9781665939294; 166593929X",
        "MaterialType": "Book",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Favat",
        "Title": "Curious Tides /",
        "POtitle": "Curious Tides / Pascale Lacelle.",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "Favat Children's & Young Adult Collection",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "PR9199.4.L33 C87 2023",
        "TitleCreationDate": "2024-05-16",
        "Barcode": "",
        "PhysicalItemId": "23468455700001401",
        "summary": "Two starred reviews! “A marvel in atmosphere.” —Chloe Gong, #1 New York Times bestselling author of These Violent Delights Ninth House meets A Deadly Education in this gorgeous dark academia fantasy “that will capture readers like a rip current” (Publishers Weekly, starred review) following a teen mage who must unravel the truth behind the secret society that may have been involved in her classmates’ deaths. Emory might be a student at the prestigious Aldryn College for Lunar Magics, but her healing abilities have always been mediocre at best—until a treacherous night in the Dovermere sea caves leaves a group of her classmates dead and her as the only survivor. Now Emory is plagued by strange, impossible powers that no healer should possess. Powers that would ruin her life if the wrong person were to discover them. To gain control of these new abilities, Emory enlists the help of the school’s most reclusive student, Baz—a boy already well-versed in the deadly nature of darker magic, whose sister happened to be one of the drowned students and Emory’s best friend. Determined to find the truth behind the drownings and the cult-like secret society she’s convinced her classmates were involved in, Emory is faced with even more questions when the supposedly drowned students start washing ashore—alive—only for them each immediately to die horrible, magical deaths. And Emory is not the only one seeking answers. When her new magic captures the society’s attention, she finds herself drawn into their world of privilege and power, all while wondering if the truth she’s searching for might lead her right back to Dovermere…to face the fate she was never meant to escape.",
        "coverurl": [
            "https://books.google.com/books/content?id=tVGsEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "14224"
        ]
    },
    {
        "POL": "POL-144184",
        "mmsId": "9952450751501401",
        "SortDate": "0000-00-00",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "",
        "Author": "Croucher, Lex, author.",
        "Format": "P",
        "isbn13": "9781250847225",
        "ISBNS": "1250847214; 9781250847218; 9781250847225; 1250847222",
        "MaterialType": "Book",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Favat",
        "Title": "Gwen & Art Are Not In Love /",
        "POtitle": "Gwen & Art Are Not In Love / Lex Croucher.",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "Favat Children's & Young Adult Collection",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "PZ7.1.C757 Gw 2023",
        "TitleCreationDate": "2024-05-16",
        "Barcode": "",
        "PhysicalItemId": "23468455730001401",
        "summary": "An Instant New York Times Bestseller! \"A total, rollicking delight. Gwen & Art gave me the same cheeky, swoony, giddy, irresistible high of the first time I saw A Knight’s Tale. Lex Croucher is one of my favorite romcom authors, and they should be yours, too.\" - Casey McQuiston, #1 New York Times bestselling author of I Kissed Shara Wheeler Heartstopper meets A Knight’s Tale in this queer medieval rom com YA debut about love, friendship, and being brave enough to change the course of history. It’s been hundreds of years since King Arthur’s reign. His descendant, Arthur, a future Lord and general gadabout, has been betrothed to Gwendoline, the quick-witted, short-tempered princess of England, since birth. The only thing they can agree on is that they despise each other. They’re forced to spend the summer together at Camelot in the run up to their nuptials, and within 24 hours, Gwen has discovered Arthur kissing a boy and Arthur has gone digging for Gwen's childhood diary and found confessions about her crush on the kingdom's only lady knight, Bridget Leclair. Realizing they might make better allies than enemies, they make a reluctant pact to cover for each other, and as things heat up at the annual royal tournament, Gwen is swept off her feet by her knight and Arthur takes an interest in Gwen's royal brother. Lex Croucher's Gwen & Art Are Not in Love is chock full of sword-fighting, found family, and romantic shenanigans destined to make readers fall in love. \"In this frivolous medieval romp of a queer rom-com, Lex Croucher toys with Arthurian legend to delightful effect.\" - Entertainment Weekly “Fun and genuinely funny, with lovely friendships and first-rate dialogue. Gwen and Art may not be in love, but I fell for both of them.” - Rainbow Rowell, #1 New York Times bestselling author of the Simon Snow trilogy “Gwen & Art Are Not in Love was exactly what I needed right now—a delightful, heart-warming, hilarious historical romp, overflowing with queer panic and terrible jokes. I loved it.” - Alice Oseman, New York Times bestselling author of the Heartstopper series",
        "coverurl": [
            "https://books.google.com/books/content?id=dl2BEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "16413"
        ]
    },
    {
        "POL": "POL-144183",
        "mmsId": "9952450751601401",
        "SortDate": "0000-00-00",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "",
        "Author": "Le, Vanessa, 1999- author.",
        "Format": "P",
        "isbn13": "9781250881519",
        "ISBNS": "1250881528; 9781250881526; 9781250881519; 125088151X",
        "MaterialType": "Book",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Favat",
        "Title": "The Last Bloodcarver /",
        "POtitle": "The Last Bloodcarver / Vanessa Le.",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "Favat Children's & Young Adult Collection",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "PZ7.1.L3915 Las 2024",
        "TitleCreationDate": "2024-05-16",
        "Barcode": "",
        "PhysicalItemId": "23468455760001401",
        "summary": "\"You’ll gasp, you’ll scream, you’ll cry, and you’ll be begging for the next book.\" — Chloe Gong, #1 New York Times-bestselling author of These Violent Delights \"Smart, lush, and utterly compelling.\" — Marie Lu, #1 New York Times-bestselling author of Legend Nhika is a bloodcarver. A coldhearted, ruthless being who can alter human biology with just a touch. In the industrial city of Theumas, Nhika is seen not as a healer, but a monster that kills for pleasure. And in the city's criminal underbelly, the rarest of monsters are traded for gold. When Nhika is finally caught by the infamous Butchers, she's forced to heal the last witness to a high-profile murder. As Nhika delves into the investigation, all signs point to Ven Kochin, an alluring yet entitled physician's aide. Despite his relentless attempts to push her out of his opulent world, something inexplicable draws Nhika to him. But when she discovers Kochin is not who he claims to be, Nhika will be faced with a greater, more terrifying evil lurking in the city's center... Her only chance to survive lies in a terrible choice—become the dreaded monster the city fears, or risk jeopardizing the future of her kind. Praise for The Last Bloodcarver *Three starred reviews* ★ \"An entrancingly well-written debut.\" — Kirkus Reviews, starred review ★ \"Visceral and exquisitely rendered prose, intertwining a murder investigation with themes of unresolved grief, medical ethics, and lost heritage.\" — Publishers Weekly, starred review ★ \"Deeply romantic, and darkly biological.\" — Booklist, starred review \"The perfect blend of sci-fi, fantasy, and romance.\" — Axie Oh, New York Times-bestselling author of The Girl Who Fell Beneath the Sea \"Obsession-worthy characters.\" — Joan He, New York Times-bestselling author of The Ones We're Meant to Find \"Absolutely captivating. This is one to be savored.\" — Grace D. Li, New York Times-bestselling author of Portrait of a Thief",
        "coverurl": [
            "https://books.google.com/books/content?id=fR63EAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "19777"
        ]
    },
    {
        "POL": "POL-144182",
        "mmsId": "9952450751701401",
        "SortDate": "0000-00-00",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "",
        "Author": "Lewis, Kayvion, author.",
        "Format": "P",
        "isbn13": "9780593625378",
        "ISBNS": "0593625366; 9780593625361; 9780593625378; 0593625374",
        "MaterialType": "Book",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Favat",
        "Title": "Thieves' Gambit /",
        "POtitle": "Thieves' Gambit / Kayvion Lewis.",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "Favat Children's & Young Adult Collection",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "PZ7.1.L519 Th 2023",
        "TitleCreationDate": "2024-05-16",
        "Barcode": "",
        "PhysicalItemId": "23468455790001401",
        "summary": "The Inheritance Games meets Ocean’s Eleven in this cinematic heist thriller where a cutthroat competition brings together the world’s best thieves and one thief is playing for the highest stakes of all: her mother's life. At only seventeen years old, Ross Quest is already a master thief, especially adept at escape plans. Until her plan to run away from her legendary family of thieves takes an unexpected turn, leaving her mother’s life hanging in the balance. In a desperate bid, she enters the Thieves’ Gambit, a series of dangerous, international heists where killing the competition isn’t exactly off limits, but the grand prize is a wish for anything in the world—a wish that could save her mom. When she learns two of her competitors include her childhood nemesis and a handsome, smooth-talking guy who might also want to steal her heart, winning the Gambit becomes trickier than she imagined. Ross tries her best to stick to the family creed: trust no one whose last name isn’t Quest. But with the stakes this high, Ross will have to decide who to con and who to trust before time runs out. After all, only one of them can win.",
        "coverurl": [
            "https://books.google.com/books/content?id=D6isEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "18625"
        ]
    },
    {
        "POL": "POL-144181",
        "mmsId": "9952450751801401",
        "SortDate": "0000-00-00",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "",
        "Author": "Wellington, Joelle, author.",
        "Format": "P",
        "isbn13": "9781665922449",
        "ISBNS": "1665922427; 9781665922425; 1665922435; 9781665922432; 9781665922449; 1665922443",
        "MaterialType": "Book",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Favat",
        "Title": "Their Vicious Games /",
        "POtitle": "Their Vicious Games / Joelle Wellington.",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "Favat Children's & Young Adult Collection",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "PZ7.1.W435516 Th 2023",
        "TitleCreationDate": "2024-05-16",
        "Barcode": "",
        "PhysicalItemId": "23468455820001401",
        "summary": "“A brutally honest and haunting cautionary tale…exposing the lie that is meritocracy and the unrelenting toll that being a final girl takes. A bloody tale spun masterfully…a dark delight.” —Faridah Àbíké-Íyímídé, New York Times bestselling author of Ace of Spades A Black teen desperate to regain her Ivy League acceptance enters an elite competition only to discover the stakes aren’t just high, they’re deadly, in this “spine-chilling thriller” (Publishers Weekly). You must work twice as hard to get half as much. Adina Walker has known this the entire time she’s been on scholarship at the prestigious Edgewater Academy—a school for the rich (and mostly white) upper class of New England. It’s why she works so hard to be perfect and above reproach, no matter what she must force beneath the surface. Even one slip can cost you everything. And it does. One fight, one moment of lost control, leaves Adina blacklisted from her top choice Ivy League college and any other. Her only chance to regain the future she’s sacrificed everything for is the Finish, a high-stakes contest sponsored by Edgewater’s founding family in which twelve young, ambitious women with exceptional promise are selected to compete in three mysterious events: the Ride, the Raid, and the Royale. The winner will be granted entry into the fold of the Remington family, whose wealth and power can open any door. But when she arrives at the Finish, Adina quickly gets the feeling that something isn’t quite right with both the Remingtons and her fellow competitors, and soon it becomes clear that this larger-than-life prize can only come at an even greater cost. Because the Finish’s stakes aren’t just make or break…they’re life and death. Adina knows the deck is stacked against her—it always has been—so maybe the only way to survive their vicious games is for her to change the rules.",
        "coverurl": [
            "https://books.google.com/books/content?id=-UmUEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "13711"
        ]
    },
    {
        "POL": "POL-144179",
        "mmsId": "9952450752001401",
        "SortDate": "0000-00-00",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "",
        "Author": "Ibañez, Isabel (Novelist), author.",
        "Format": "P",
        "isbn13": "9781250803382",
        "ISBNS": "1250803373; 9781250803375; 9781250803382; 1250803381",
        "MaterialType": "Book",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Favat",
        "Title": "What The River Knows : A Novel /",
        "POtitle": "What The River Knows : A Novel / Isabel Ibañez.",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "Favat Children's & Young Adult Collection",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "PZ7.1.I1153 Wh 2023",
        "TitleCreationDate": "2024-05-16",
        "Barcode": "",
        "PhysicalItemId": "23468455880001401",
        "summary": "The Mummy meets Death on the Nile in What the River Knows, Isabel Ibañez's lush, immersive historical fantasy set in Egypt and filled with adventure, a rivals-to-lovers romance, and a dangerous race. Bolivian-Argentinian Inez Olivera belongs to the glittering upper society of nineteenth century Buenos Aires, and like the rest of the world, the town is steeped in old world magic that’s been largely left behind or forgotten. Inez has everything a girl might want, except for the one thing she yearns the most: her globetrotting parents—who frequently leave her behind. When she receives word of their tragic deaths, Inez inherits their massive fortune and a mysterious guardian, an archeologist in partnership with his Egyptian brother-in-law. Yearning for answers, Inez sails to Cairo, bringing her sketch pads and a golden ring her father sent to her for safekeeping before he died. But upon her arrival, the old world magic tethered to the ring pulls her down a path where she soon discovers there’s more to her parent’s disappearance than what her guardian led her to believe. With her guardian’s infuriatingly handsome assistant thwarting her at every turn, Inez must rely on ancient magic to uncover the truth about her parent’s disappearance—or risk becoming a pawn in a larger game that will kill her. What the River Knows is the first book in the thrilling Secrets of the Nile duology. \"Expertly plotted, explosively adventurous, and burning with romance.\" - Stephanie Garber #1 New York Times bestselling author \"Take a plucky heroine, a historically grounded Indiana Jones-esque adventure through Ancient Egypt, and add a surprising dollop of magic — it’s a recipe for a delightful read.\" - Jodi Picoult, #1 New York Times bestselling author *Book 1 in the Secrets of the Nile duology*",
        "coverurl": [
            "https://books.google.com/books/content?id=ZceiEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "16695"
        ]
    },
    {
        "POL": "POL-144178",
        "mmsId": "9952450752201401",
        "SortDate": "0000-00-00",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Zollinger, Daniel J., illustrator.",
        "Author": "Bardugo, Leigh, author.",
        "Format": "P",
        "isbn13": "9781250765208",
        "ISBNS": "125076520X; 9781250765208",
        "MaterialType": "Book",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Favat",
        "Title": "The Lives Of Saints /",
        "POtitle": "The Lives Of Saints / Leigh Bardugo ; Illustrated By Daniel J. Zollinger.",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "Favat Children's & Young Adult Collection",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "PZ7.B25024 Liv 2020",
        "TitleCreationDate": "2024-05-16",
        "Barcode": "",
        "PhysicalItemId": "23468455910001401",
        "summary": "Enter the world of the Grishaverse and Shadow and Bone, soon to be a Netflix original series! Dive into the epic world of international bestselling author Leigh Bardugo with this beautifully illustrated replica of The Lives of Saints, the Istorii Sankt’ya, featuring tales of saints drawn from the beloved novels and beyond. Out of the pages of the Shadow and Bone trilogy, from the hands of Alina Starkov to yours, the Istorii Sankt’ya is a magical keepsake from the Grishaverse. These tales include miracles and martyrdoms from familiar saints like Sankta Lizabeta of the Roses and Sankt Ilya in Chains, to the strange and obscure stories of Sankta Ursula, Sankta Maradi, and the Starless Saint. This beautiful collection includes stunning full-color illustrations of each story. An Imprint Book. Read all the books in the Grishaverse! The Shadow and Bone Trilogy (previously published as The Grisha Trilogy) Shadow and Bone Siege and Storm Ruin and Rising The Six of Crows Duology Six of Crows Crooked Kingdom The King of Scars Duology King of Scars The Language of Thorns: Midnight Tales and Dangerous Magic The Severed Moon: A Year-Long Journal of Magic Praise for the Grishaverse “A master of fantasy.” —The Huffington Post “Utterly, extremely bewitching.” —The Guardian “The best magic universe since Harry Potter.” —Bustle “This is what fantasy is for.” —The New York Times Book Review “[A] world that feels real enough to have its own passport stamp.” —NPR “The darker it gets for the good guys, the better.” —Entertainment Weekly “Sultry, sweeping and picturesque. . . . Impossible to put down.” —USA Today “There’s a level of emotional and historical sophistication within Bardugo’s original epic fantasy that sets it apart.” —Vanity Fair “Unlike anything I’ve ever read.” —Veronica Roth, bestselling author of Divergent “Bardugo crafts a first-rate adventure, a poignant romance, and an intriguing mystery!” —Rick Riordan, bestselling author of the Percy Jackson series",
        "coverurl": [
            "https://books.google.com/books/content?id=SHNqzQEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "13184"
        ]
    },
    {
        "POL": "POL-144177",
        "mmsId": "9952450752301401",
        "SortDate": "0000-00-00",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Álvarez Hernández, David Daniel, illustrator.",
        "Author": "Higuera, Donna Barba, author.",
        "Format": "P",
        "isbn13": "9781646142637",
        "ISBNS": "1646142632; 9781646142637",
        "MaterialType": "Book",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Favat",
        "Title": "Alebrijes /",
        "POtitle": "Alebrijes / Donna Barba Higuera ; [illustrations, David Álvarez].",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "Favat Children's & Young Adult Collection",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "PZ7.1.H5468 Al 2023",
        "TitleCreationDate": "2024-05-16",
        "Barcode": "",
        "PhysicalItemId": "23468455940001401",
        "summary": "When thirteen-year-old Leandro takes the fall for his sister and is exiled into an ancient drone, he embarks on a perilous journey beyond the city's walls where he encounters mutant monsters, wasteland pirates, and fellow outcasts as he tries to save his sister and fellow Cascabeles from the oppressive regime.",
        "coverurl": [
            "https://covers.openlibrary.org/b/isbn/9781646142637-L.jpg",
            37439
        ]
    },
    {
        "POL": "POL-144176",
        "mmsId": "9952450752401401",
        "SortDate": "0000-00-00",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Black, Holly.",
        "Author": "Black, Holly, author.",
        "Format": "P",
        "isbn13": "9780316592734",
        "ISBNS": "0316592714; 9780316592710; 9780316592734; 0316592730",
        "MaterialType": "Book",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Favat",
        "Title": "The Prisoner's Throne : A Novel Of Elfhame /",
        "POtitle": "The Prisoner's Throne : A Novel Of Elfhame / Holly Black.",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "Favat Children's & Young Adult Collection",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "PZ7.B52878 Pr 2024",
        "TitleCreationDate": "2024-05-16",
        "Barcode": "",
        "PhysicalItemId": "23468455970001401",
        "summary": "An imprisoned prince. A vengeful queen. And a battle that will determine the future of Elfhame. Prince Oak is paying for his betrayal. Imprisoned in the icy north and bound to the will of a monstrous new queen, he must rely on charm and calculation to survive. With High King Cardan and High Queen Jude willing to use any means necessary to retrieve their stolen heir, Oak will have to decide whether to attempt regaining the trust of the girl he’s always loved or to remain loyal to Elfhame and hand over the means to end her reign—even if it means ending Wren, too. With a new war looming on the horizon and treachery lurking in every corner, neither Oak’s guile nor his wit will be enough to keep everyone he loves alive. It’s just a question of whom he will doom. From the #1 New York Times bestselling author Holly Black comes the stunning blood-soaked conclusion to the Stolen Heir duology.",
        "coverurl": [
            "https://books.google.com/books/content?id=mammEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "15275"
        ]
    },
    {
        "POL": "POL-144175",
        "mmsId": "9952450752501401",
        "SortDate": "0000-00-00",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "",
        "Author": "Ciccarelli, Kristen, author.",
        "Format": "P",
        "isbn13": "9781250866912",
        "ISBNS": "1250866901; 9781250866905; 9781250866912; 125086691X",
        "MaterialType": "Book",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Favat",
        "Title": "Heartless Hunter /",
        "POtitle": "Heartless Hunter / Kristen Ciccarelli.",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "Favat Children's & Young Adult Collection",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "PZ7.1.C552 He 2024",
        "TitleCreationDate": "2024-05-16",
        "Barcode": "",
        "PhysicalItemId": "23468456000001401",
        "summary": "AN INSTANT NEW YORK TIMES BESTSELLER! \"A steamy game of cat and mouse between witch and witch-hunter, played out against a backdrop of opulence, secrets, and bloody history. I couldn't look away.\" - Kendare Blake, #1 New York Times bestselling author of Champion of Fate Enemies-to-lovers doesn't get more high stakes than a witch and a witch hunter falling in love in bestselling author Kristen Ciccarelli's latest romantic fantasy. On the night Rune’s life changed forever, blood ran in the streets. Now, in the aftermath of a devastating revolution, witches have been diminished from powerful rulers to outcasts ruthlessly hunted due to their waning magic, and Rune must hide what she is. Spending her days pretending to be nothing more than a vapid young socialite, Rune spends her nights as the Crimson Moth, a witch vigilante who rescues her kind from being purged. When a rescue goes wrong, she decides to throw the witch hunters off her scent and gain the intel she desperately needs by courting the handsome Gideon Sharpe - a notorious and unforgiving witch hunter loyal to the revolution - who she can't help but find herself falling for. Gideon loathes the decadence and superficiality Rune represents, but when he learns the Crimson Moth has been using Rune’s merchant ships to smuggle renegade witches out of the republic, he inserts himself into her social circles by pretending to court her right back. He soon realizes that beneath her beauty and shallow façade, is someone fiercely intelligent and tender who feels like his perfect match. Except, what if she’s the very villain he’s been hunting? Kristen Ciccarelli’s Heartless Hunter is the thrilling start to The Crimson Moth duology, a romantic fantasy series where the only thing more treacherous than being a witch...is falling in love. “Enchanting and deeply romantic, Heartless Hunter drew me in with the first sentence and left me breathless by the last. A story that unfolds like a spell, and one that is destined to capture your heart.” - Rebecca Ross, #1 New York Times bestselling author of Divine Rivals",
        "coverurl": [
            "https://books.google.com/books/content?id=71C4EAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "16986"
        ]
    },
    {
        "POL": "POL-144174",
        "mmsId": "9952450752701401",
        "SortDate": "0000-00-00",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "",
        "Author": "Krause, Autumn, author.",
        "Format": "P",
        "isbn13": "9781682636480",
        "ISBNS": "168263647X; 9781682636473; 9781682636480; 1682636488",
        "MaterialType": "Book",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Favat",
        "Title": "Before The Devil Knows You're Here /",
        "POtitle": "Before The Devil Knows You're Here / Autumn Krause.",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "Description": "",
        "LocationName": "Favat Children's & Young Adult Collection",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "PZ7.1.K7336 Be 2023",
        "TitleCreationDate": "2024-05-16",
        "Barcode": "",
        "PhysicalItemId": "23468456040001401",
        "summary": "Part dark gothic fantasy, part journey into the bizarre, this delicious blending of tall tales and Latin American surrealism will haunt you as you devour it! \"Highly imaginative and powerfully affecting.\"—Kirkus Reviews, Starred Review 1836, Wisconsin. Catalina lives with her pa and brother in a ramshackle cabin on the edge of the wilderness. Harsh winters have brought the family to the brink of starvation, and Catalina has replaced her poet's soul with an unyielding determination to keep Pa and her brother alive. When a sudden illness claims Pa, a strange man appears—a man covered in bark, leaves growing from his head, and sap dripping from his eyes. He scoops up her brother and disappears, leaving behind a bird with crimson wings. Catalina can’t let this man—if that’s what he is—have her brother. So, she grabs Pa’s knife and follows the bird. Along the way, she finds help from a young lumberjack, who has his own reasons for hunting the Man of Sap. As their journey takes them deeper into the woods, they encounter strange beasts and tormented spirits. The more they uncover about the Man of Sap, the more they learn how deeply Catalina’s fate is entwined with his, planted long ago in cursed seeds. An enchanting mixture of American tall tales and Faustian elements, Before the Devil Knows You’re Here centers a fierce Mexican American poet on a quest to save her brother. Autumn Krause’s vivid, haunting prose and rich symbolism make this a must-read for fans of Maggie Stiefvater and Erin Craig.",
        "coverurl": [
            "https://books.google.com/books/content?id=3vavEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "15162"
        ]
    },
    {
        "POL": "POL-144147",
        "mmsId": "9952449756901401",
        "SortDate": "0000-00-00",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "University of Cambridge. Centre for Tax Law.; De Cogan, Dominic.; Harris, Peter, 1964-; Tiley, John.",
        "Author": "Tax Law History Conference.",
        "Format": "P",
        "isbn13": "9781509908370",
        "ISBNS": "9781509963263; 150996326X; 9781841134734; 1841134732; 1841136778; 9781841136776; 1841139564; 9781841139562; 1849460485; 9781849460484; 1849462240; 9781849462242; 1849464804; 9781849464802; 1849467986; 9781849467988; 1509908374; 9781509908370; 1509924930;",
        "MaterialType": "Book",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Default",
        "Title": "Studies In The History Of Tax Law /",
        "POtitle": "Studies In The History Of Tax Law / Edited By John Tiley.",
        "VendorName": "YBP",
        "LibraryName": "School of Law Library",
        "Description": "",
        "LocationName": "Stacks",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "KD5359.A2 T39 2002",
        "TitleCreationDate": "2024-05-14",
        "Barcode": "",
        "PhysicalItemId": "23468322490001401",
        "summary": "These are the papers from the 8th Cambridge Tax Law History Conference held in July 2016. In the usual manner, these papers have been selected from an oversupply of proposals for their interest and relevance, and scrutinised and edited to the highest standard for inclusion in this prestigious series. The papers fall within five basic themes: Two papers focus on tax theory; one on John Locke and another on the impact of English tax literature in the Netherlands in the nineteenth century. Five deal with the history of UK specific interpretational issues in varying contexts – an ancient exemption, insurance companies, special contribution, the profits tax GAAR and capital gains tax. Two more papers consider aspects of HMRC operations. Another three focus on facets of international taxation, including treaties between the UK and European countries, treaties between the UK and developing countries and the UN model tax treaties of 1928. The book also incorporates a range of interesting topics from other countries, including the introduction of income tax in Ireland and in Chile, post-war income taxation in Australia, early interpretation of 'income' in New Zealand and a discussion of some early indirect taxes in India and China.",
        "coverurl": [
            "https://books.google.com/books/content?id=iwtbEAAAQBAJ&printsec=frontcover&img=1&zoom=10&source=gbs_api",
            "51744"
        ]
    },
    {
        "POL": "POL-144144",
        "mmsId": "9952449757201401",
        "SortDate": "0000-00-00",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Martin, David, author.",
        "Author": "Bonomi, Amy, author.",
        "Format": "P",
        "isbn13": "9781003348696",
        "ISBNS": "1032391685; 9781032391687; 1032391677; 9781032391670; 9781032606217; 1032606215; 9781003348696; 1003348696",
        "MaterialType": "Book",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Default",
        "Title": "Recantation And Domestic Violence : The Untold Story /",
        "POtitle": "Recantation And Domestic Violence : The Untold Story / Amy Bonomi And David Martin.",
        "VendorName": "YBP",
        "LibraryName": "School of Law Library",
        "Description": "",
        "LocationName": "Stacks",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "K5190 .B66 2024",
        "TitleCreationDate": "2024-05-14",
        "Barcode": "",
        "PhysicalItemId": "23468322580001401",
        "summary": "\"Recantation and Domestic Violence empowers people and communities in improving their understanding of and skills in domestic violence cases that involve recantation. The book illustrates the precise interpersonal dynamics of recantation in criminal cases in which felony-level abuse has occurred. This book equips professionals in working more effectively with domestic violence victims, their abusers, family members and other supporters. Using the five-stage model, case examples, and audiotaped telephone conversations between abusers and their victims, it puts the reader directly in touch with what abusers say, how they say it, and how victims respond. The book will be applicable to practitioners and research audiences in fields such as criminal law, family law, child custody, violence prevention, therapeutic interventions, medicine, nursing, psychology, social work, sociology, and behavioral economics\"--",
        "coverurl": [
            "https://books.google.com/books/content?id=GVs60AEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "10789"
        ]
    },
    {
        "POL": "POL-144143",
        "mmsId": "9952449757301401",
        "SortDate": "0000-00-00",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "",
        "Author": "Baker, Robert, 1937- author.",
        "Format": "P",
        "isbn13": "9780262377409",
        "ISBNS": "0262547376; 9780262547376; 9780262377416; 0262377411; 9780262377409; 0262377403",
        "MaterialType": "Book",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Default",
        "Title": "Making Modern Medical Ethics : How African Americans, Anti-nazis, Bureaucrats, Feminists, Veterans, And Whistleblowing Moralists Created Bioethics /",
        "POtitle": "Making Modern Medical Ethics : How African Americans, Anti-nazis, Bureaucrats, Feminists, Veterans, And Whistleblowing Moralists Created Bioethics / Robert Baker.",
        "VendorName": "YBP",
        "LibraryName": "School of Law Library",
        "Description": "",
        "LocationName": "Stacks",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "R724 .B1846 2024",
        "TitleCreationDate": "2024-05-14",
        "Barcode": "",
        "PhysicalItemId": "23468322610001401",
        "summary": "The little-known stories of the people responsible for what we know today as modern medical ethics. In Making Modern Medical Ethics, Robert Baker tells the counter history of the birth of bioethics, bringing to the fore the stories of the dissenters and whistleblowers who challenged the establishment. Drawing on his earlier work on moral revolutions and the history of medical ethics, Robert Baker traces the history of modern medical ethics and its bioethical turn to the moral insurrections incited by the many unsung dissenters and whistleblowers: African American civil rights leaders, Jewish Americans harboring Holocaust memories, feminists, women, and Anglo-American physicians and healthcare professionals who were veterans of the World Wars, the Cold War, and the Vietnam War. The standard narrative for bioethics typically emphasizes the morally disruptive medical technologies of the latter part of the twentieth century, such as the dialysis machine, the electroencephalograph, and the ventilator, as they created the need to reconsider traditional notions of medical ethics. Baker, however, tells a fresh narrative, one that has historically been neglected (e.g., the story of the medical veterans who founded an international medical organization to rescue medicine and biomedical research from the scandal of Nazi medicine), and also reveals the penalties that moral change agents paid (e.g., the stubborn bureaucrat who was demoted for her insistence on requiring and enforcing research subjects’ informed consent). Analyzing major statements of modern medical ethics from the 1946–1947 Nuremberg Doctors Trials and Nuremberg Code to A Patient’s Bill of Rights, Making Modern Medical Ethics is a winning history of just how respect and autonomy for patients and research subjects came to be codified.",
        "coverurl": [
            "https://books.google.com/books/content?id=1tC_EAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "13192"
        ]
    },
    {
        "POL": "POL-144139",
        "mmsId": "9952449757701401",
        "SortDate": "0000-00-00",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "",
        "Author": "Cordero-Moss, Giuditta, author.",
        "Format": "P",
        "isbn13": "9781107029187",
        "ISBNS": "9781316514238; 1316514234; 1009077988; 9781009077989; 110702918X; 9781107029187",
        "MaterialType": "Book",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Default",
        "Title": "International Commercial Contracts : Contract Terms, Applicable Law And Arbitration /",
        "POtitle": "International Commercial Contracts : Contract Terms, Applicable Law And Arbitration / Giuditta Cordero-moss.",
        "VendorName": "YBP",
        "LibraryName": "School of Law Library",
        "Description": "",
        "LocationName": "Stacks",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "K7350 .C67 2024",
        "TitleCreationDate": "2024-05-14",
        "Barcode": "",
        "PhysicalItemId": "23468322730001401",
        "summary": "The book verifies the impact of national law and transnational rules on international contracts, particularly those with an arbitration clause.",
        "coverurl": [
            "https://books.google.com/books/content?id=Sa6BAwAAQBAJ&printsec=frontcover&img=1&zoom=10&source=gbs_api",
            "33955"
        ]
    },
    {
        "POL": "POL-144136",
        "mmsId": "9952449758001401",
        "SortDate": "0000-00-00",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Goerzen, Chad Lyman, 1979- author.",
        "Author": "Aviram, Hadar, author.",
        "Format": "P",
        "isbn13": "9780520386136",
        "ISBNS": "0520386116; 9780520386112; 0520386124; 9780520386129; 9780520386136; 0520386132",
        "MaterialType": "Book",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Default",
        "Title": "Fester : Carceral Permeability And California's Covid-19 Correctional Disaster /",
        "POtitle": "Fester : Carceral Permeability And California's Covid-19 Correctional Disaster / Hadar Aviram And Chad Goerzen.",
        "VendorName": "YBP",
        "LibraryName": "School of Law Library",
        "Description": "",
        "LocationName": "Stacks",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "KFC613 .A99 2024",
        "TitleCreationDate": "2024-05-14",
        "Barcode": "",
        "PhysicalItemId": "23468322820001401",
        "summary": "The mismanagement of the COVID-19 pandemic in California’s prisons stands out as the state’s worst-ever medical catastrophe in a carceral setting. Fester offers a cultural history of this correctional disaster through first-person accounts, courtroom observations, policy documents, and years of carefully collected quantitative data. Bearing witness to the immense suffering wrought on people behind bars through dehumanization, fear, and ignorance, Fester explains how carceral cruelty also threatens the health and well-being of all Californians. This book stands as a monument to the brave coalition of incarcerated and formerly incarcerated people and their loved ones, along with activists, doctors, journalists, and lawyers, who fought to shed light on one of the darkest times in the Golden State’s correctional system.",
        "coverurl": [
            "https://books.google.com/books/content?id=4qPpEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "10951"
        ]
    },
    {
        "POL": "POL-144130",
        "mmsId": "9952449756701401",
        "SortDate": "0000-00-00",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Waldman, Paul, author.",
        "Author": "Schaller, Thomas F., author.",
        "Format": "P",
        "isbn13": "9780593729151",
        "ISBNS": "0593729145; 9780593729144; 9780593729151; 0593729153",
        "MaterialType": "Book",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Default",
        "Title": "White Rural Rage : The Threat To American Democracy /",
        "POtitle": "White Rural Rage : The Threat To American Democracy / Tom Schaller And Paul Waldman.",
        "VendorName": "YBP",
        "LibraryName": "School of Law Library",
        "Description": "",
        "LocationName": "Stacks",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "JF1075.U6 S36 2024",
        "TitleCreationDate": "2024-05-14",
        "Barcode": "",
        "PhysicalItemId": "23468323000001401",
        "summary": "NEW YORK TIMES BESTSELLER • A searing portrait and damning takedown of America’s proudest citizens—who are also the least likely to defend its core principles “This is an important book that ought to be read by anyone who wants to understand politics in the perilous Age of Trump.”—David Corn, New York Times bestselling author of American Psychosis White rural voters hold the greatest electoral sway of any demographic group in the United States, yet rural communities suffer from poor healthcare access, failing infrastructure, and severe manufacturing and farming job losses. Rural voters believe our nation has betrayed them, and to some degree, they’re right. In White Rural Rage, Tom Schaller and Paul Waldman explore why rural Whites have failed to reap the benefits from their outsize political power and why, as a result, they are the most likely group to abandon democratic norms and traditions. Their rage—stoked daily by Republican politicians and the conservative media—now poses an existential threat to the United States. Schaller and Waldman show how vulnerable U.S. democracy has become to rural Whites who, despite legitimate grievances, are increasingly inclined to hold racist and xenophobic beliefs, to believe in conspiracy theories, to accept violence as a legitimate course of political action, and to exhibit antidemocratic tendencies. Rural White Americans’ attitude might best be described as “I love my country, but not our country,” Schaller and Waldman argue. This phenomenon is the patriot paradox of rural America: The citizens who take such pride in their patriotism are also the least likely to defend core American principles. And by stoking rural Whites’ anger rather than addressing the hard problems they face, conservative politicians and talking heads create a feedback loop of resentments that are undermining American democracy. Schaller and Waldman provocatively critique both the structures that permit rural Whites’ disproportionate influence over American governance and the prospects for creating a pluralist, inclusive democracy that delivers policy solutions that benefit rural communities. They conclude with a political reimagining that offers a better future for both rural people and the rest of America.",
        "coverurl": [
            "https://books.google.com/books/content?id=zDvcEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "14794"
        ]
    },
    {
        "POL": "POL-144129",
        "mmsId": "9952449756801401",
        "SortDate": "0000-00-00",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "",
        "Author": "Löwy, Ilana, 1948- author.",
        "Format": "P",
        "isbn13": "9781421447926",
        "ISBNS": "1421447916; 9781421447919; 9781421447926; 1421447924",
        "MaterialType": "Book",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Default",
        "Title": "Viruses And Reproductive Injustice : Zika In Brazil /",
        "POtitle": "Viruses And Reproductive Injustice : Zika In Brazil / Ilana Löwy.",
        "VendorName": "YBP",
        "LibraryName": "School of Law Library",
        "Description": "",
        "LocationName": "Stacks",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "RA644.Z56 L68 2024",
        "TitleCreationDate": "2024-05-14",
        "Barcode": "",
        "PhysicalItemId": "23468323030001401",
        "summary": "Brazil's Zika outbreak revealed extreme health disparities and reproductive injustice across racial and socioeconomic lines. Brazil's 2015 Zika outbreak led to severe illnesses for many and the birth of several thousands of children with severe brain damage. Even though mosquito-borne diseases such as the Zika virus affect people across society, these children were born almost exclusively to poor, and usually non-white, women. In Viruses and Reproductive Injustice, Ilana Löwy explores the complicated health disparities and reproductive injustice that led to these cases of congenital Zika syndrome. Löwy examines the history of the outbreak in Brazil and connects it to broader questions concerning reproductive rights, the medical science behind understanding new pathogens, and the role of international health organizations in battling—or ignoring—public health crises. The explanation behind the strongly skewed distribution of cases among social classes was far from straightforward or obvious during the Zika outbreak. Löwy argues that the disproportionate effect of Zika on births among the poor is primarily a function of dramatic disparities in access to contraception and prenatal care, as well as Brazil's anti-abortion laws: only wealthier women have access to safe abortions. This is a book about the changing meaning of an infectious disease outbreak and a haunting demonstration that an epidemic is both a biological and a political event produced by the complicated entanglement of humans, viruses, and mosquitoes.",
        "coverurl": [
            "https://books.google.com/books/content?id=swzMEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "13027"
        ]
    },
    {
        "POL": "POL-144127",
        "mmsId": "9952449758501401",
        "SortDate": "0000-00-00",
        "AccessModel": "",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Brown, Curtis M. 1908-1993. (Curtis Maitland),; Robillard, Walter G. 1930- author. (Walter George),; Nettleman, Charles A., III, author.",
        "Author": "Wilson, Donald A., 1941- author.",
        "Format": "P",
        "isbn13": "9781119911708",
        "ISBNS": "1119911702; 9781119911708",
        "MaterialType": "Book",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "0000-00-00",
        "PortfolioActivationDate": "0000-00-00",
        "ExpPortfolioActivationDate": "0000-00-00",
        "ReportingCode": "Default",
        "Title": "Brown's Boundary Control And Legal Principles /",
        "POtitle": "Brown's Boundary Control And Legal Principles / Donald A. Wilson, C.a. \"tony\" Nettleman Iii, Walter G. Robillard.",
        "VendorName": "YBP",
        "LibraryName": "School of Law Library",
        "Description": "",
        "LocationName": "Stacks",
        "TemporaryLocationName": "None",
        "PermanentCallNumber": "KF639 .B7 2024",
        "TitleCreationDate": "2024-05-14",
        "Barcode": "",
        "PhysicalItemId": "23468323090001401",
        "summary": "BROWN'S BOUNDARY CONTROL AND LEGAL PRINCIPLES The latest edition of the industry-leading reference to boundary law for property surveying In the newly revised eighth edition of Brown’s Boundary Control and Legal Principles, a team of distinguished surveying professionals delivers an updated and expanded treatment of the latest in surveying technology and surveying caselaw. This classic reference to boundary law principles for property surveying continues to evolve, covering all relevant and necessary information related to the complex area of boundary law. The book offers a wealth of case studies on federal and state rectangular and non-sectionalized land surveys demonstrating real-world examples. It provides numerous illustrations highlighting the concepts discussed within, and is an essential reference tool for professionals and students in the area, providing: A thorough introduction to the foundational principles of boundary surveying and property rights Comprehensive explorations of decision-making in professional boundary surveying Practical discussions of the legal principles governing land surveying, land boundaries, and land rights A holistic combination of law and surveying that’s ideal as a reference tool and as a learning tool Perfect for practicing surveyors and those studying for the Fundamentals of Surveying (FS) licensing exam, Brown’s Boundary Control and Legal Principles will also benefit undergraduate and graduate students of surveying programs, as well as lawyers who practice in the areas of real estate, land, and property law.",
        "coverurl": [
            "https://books.google.com/books/content?id=0zrdEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "13330"
        ]
    }
]