[
    {
        "mmsId": "9952429051101401",
        "isbn13": "9781397901071",
        "SortDate": "9999-99-99"
    },
    {
        "mmsId": "9952429051301401",
        "SortDate": "2024-03-29",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Sharkey, Joe, author.",
        "Format": "P",
        "isbn13": "9781501140938",
        "ISBNS": "1501140930; 9781501140938",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-29",
        "ReportingCode": null,
        "Title": "Deadly Greed : The Riveting True Story Of The Stuart Murder Case That Rocked Boston And Shocked The Nation /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "Deadly Greed reveals the horrifying truth behind one of the most vicious and intriguing murders of the 1980s as the author of Death Sentence tells the true story of how Charles Stuart murdered his pregnant wife and blamed it on a fictitious Black killer. In October of 1989, businessman Charles Stuart called 911 reporting that his pregnant wife, Carol, had been robbed and shot by a Black male in the Mission Hill neighborhood of Boston. When the police arrived, Carol was already dead, with the baby gone soon after, leading to an attack that incited fear and anger during a time of high racial tensions. When the truth of the murder came out, while the injuries Carol suffered were real, the story of the Black male that shot her was a fictitious cover up told by her husband. Charles Stuart shot his wife, killing her and the baby she was carrying, convinced she was the only thing standing between him and everything he wanted. Though the police eventually unraveled the truth of the case, it did not prevent the conviction of an innocent man that was lined up to take the fall by Charles himself. But as the truth was revealed, the police were able to piece together the puzzle that led to the murder of a wife by her own husband, including distress over the pregnancy, romantic interest in a coworker, and life insurance fraud. Jon Sharkey shares “a picture of a man consumed by naked ambition, unwilling to let anyone or anything get in his way” in this shocking and terrifying account of murder (Library Journal).",
        "coverurl": [
            "https://books.google.com/books/content?id=SdyLjgEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "13799"
        ]
    },
    {
        "mmsId": "9952429051401401",
        "SortDate": "2024-03-29",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Russell, Francis, 1910-1989.",
        "Format": "P",
        "isbn13": "9780807050330",
        "ISBNS": "9780807050330; 0807050334",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-29",
        "ReportingCode": null,
        "Title": "A City In Terror : Calvin Coolidge And The 1919 Boston Police Strike /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "On September 9, 1919, an American nightmare came true. The entire Boston police force deserted their posts, leaving the city virtually defenseless. Women were raped on street corners, stores were looted, and pedestrians were beaten and robbed while crowds not only looked on but cheered. The police strike and the mayhem that followed made an inconspicuous governor, Calvin Coolidge, known throughout America, turning him into a national hero and, eventually, a president. It also created a monster: for two days, more than 700,000 residents of Boston's urban core were without police protection, and the mob ruled the streets.",
        "coverurl": [
            "https://books.google.com/books/content?id=GOqa9-BWvmMC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "13815"
        ]
    },
    {
        "mmsId": "9952429051501401",
        "SortDate": "2024-03-29",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Museum of Fine Arts, Boston., publisher.; Roberts, Ellen E., biographer.; Comey, Janet L., biographer.",
        "Author": "Hirshler, Erica E.",
        "Format": "P",
        "isbn13": "9780878464821",
        "ISBNS": "9780878464821; 0878464824",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-29",
        "ReportingCode": null,
        "Title": "A Studio Of Her Own : Women Artists In Boston, 1870-1940 /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "By Erica E. Hirshler.",
        "coverurl": [
            "https://covers.openlibrary.org/b/isbn/9780878464821-L.jpg",
            34912
        ]
    },
    {
        "mmsId": "9952429051601401",
        "SortDate": "2024-03-29",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Smith-Hefner, Nancy Joan.",
        "Format": "P",
        "isbn13": "9780520213487",
        "ISBNS": "0520920864; 9780520920866; 9780585283548; 0585283540; 9780520213494; 0520213491; 0520213483; 9780520213487",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-29",
        "ReportingCode": null,
        "Title": "Khmer American : Identity And Moral Education In A Diasporic Community /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "\"A richly detailed ethnography on Khmer social practices and concepts of socialization in the diaspora community that is unparalleled in the English language.\"--Kate Frieson, University of Victoria \"A richly detailed ethnography on Khmer social practices and concepts of socialization in the diaspora community that is unparalleled in the English language.\"--Kate Frieson, University of Victoria",
        "coverurl": [
            "https://covers.openlibrary.org/b/isbn/9780520213487-L.jpg",
            22280
        ]
    },
    {
        "mmsId": "9952429051701401",
        "SortDate": "2024-03-29",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Lesh, Charles N., author.",
        "Format": "P",
        "isbn13": "9780815637677",
        "ISBNS": "0815655592; 9780815655596; 9780815637622; 0815637624; 9780815637677; 0815637675",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-29",
        "ReportingCode": null,
        "Title": "The Writing Of Where : Graffiti And The Production Of Writing Spaces /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "In The Writing of Where, Charles Lesh examines how graffiti writers in Boston remake various spaces within and across the city. The spaces readers will encounter in this book are not just meaningful venues of writing, but also outcomes of writing itself: social spaces not just where writing happens but created because writing happens. Lesh contends that these graffiti spaces reinvent the writing landscape of the city and its public relationship with writing. Each chapter introduces readers to different writing spaces: from bold and broadly visible spots along the highway to bridge underpasses seldom seen by non-writers; from inconspicuous notebooks writers call bibles to freight yards and model trains; from abandoned factories to benches where writers view trains. Between each chapter, readers will find community interludes, responses to the preceding chapters from some of the graffiti writers who worked on this project. By working closely with writers engaged in the production of these spaces, as well as drawing on work invested in questions of geography, publics, and writing, Lesh identifies new models of community engagement and articulates a framework for the spatiality of the public work of writing and writing studies.",
        "coverurl": [
            "https://books.google.com/books/content?id=XRy5zgEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "11978"
        ]
    },
    {
        "mmsId": "9952429051801401",
        "isbn13": "9780262314053",
        "SortDate": "9999-99-99"
    },
    {
        "mmsId": "9952429051901401",
        "SortDate": "2024-03-29",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Kidder, Tracy, author.",
        "Format": "P",
        "isbn13": "9781984801456",
        "ISBNS": "9781984801456; 1984801457",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-29",
        "ReportingCode": null,
        "Title": "Rough Sleepers /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "NEW YORK TIMES BESTSELLER • The powerful story of an inspiring doctor who made a difference, by helping to create a program to care for Boston’s homeless community—by the Pulitzer Prize–winning, New York Times bestselling author of Mountains Beyond Mountains “I couldn’t put Rough Sleepers down. I am left in awe of the human spirit and inspired to do better.”—Abraham Verghese, author of Cutting for Stone A BEST BOOK OF THE YEAR: NPR, BookPage, Chicago Public Library Tracy Kidder has been described by The Baltimore Sun as “a master of the nonfiction narrative.” In Rough Sleepers, Kidder tells the story of Dr. Jim O’Connell, a gifted man who invented a community of care for a city’s unhoused population, including those who sleep on the streets—the “rough sleepers.” After Jim O’Connell graduated from Harvard Medical School and was nearing the end of his residency at Massachusetts General, the hospital’s chief of medicine made a proposal: Would he defer a prestigious fellowship and spend a year helping to create an organization to bring health care to homeless citizens? That year turned into O’Connell’s life’s calling. Tracy Kidder spent five years following Dr. O’Connell and his colleagues as they work with thousands of homeless patients, some of whom we meet in this illuminating book. We travel with O’Connell as he navigates the city streets at night, offering medical care, socks, soup, empathy, humor, and friendship to some of the city’s most endangered citizens. He emphasizes a style of medicine in which patients come first, joined with their providers in what he calls “a system of friends.” Much as he did with Paul Farmer in Mountains Beyond Mountains, Kidder explores how Jim O’Connell and a dedicated group of people have improved countless lives by facing and addressing one of American society’s most difficult problems, instead of looking away.",
        "coverurl": [
            "https://books.google.com/books/content?id=5QfaEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "18633"
        ]
    },
    {
        "mmsId": "9952429052001401",
        "isbn13": "9781596298347",
        "SortDate": "9999-99-99"
    },
    {
        "mmsId": "9952429052301401",
        "SortDate": "2024-03-29",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Leonard, John 1948- (John Ellyson),",
        "Author": "Gonsalves, Lisa.",
        "Format": "P",
        "isbn13": "9780275991654",
        "ISBNS": "9780275991654; 0275991652",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-29",
        "ReportingCode": null,
        "Title": "New Hope For Urban High Schools : Cultural Reform, Moral Leadership, And Community Partnership /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "The last sixty years have seen tremendous strides in high school education. More young people of all races and backgrounds are graduating from high school, with more credits in tougher courses, than ever before. However, our dropout rate is still too high and far too many graduates are not prepared for college. High school reform for city schools has been particularly challenging where poverty and racism have undermined the high school experience. Educators have relied upon two reform strategies: the curricular strategy focuses on the academic content that is delivered in the classroom, content reformers have adjusted. They also have restructured the high school itself to maximize the impact of the classroom. This book offers an additional strategy, one essential for real change: the cultural reform strategy. Cultural change—a fundamental change in the beliefs, attitudes and expectations of the stakeholders—is difficult to achieve. Yet, without a change in the culture of the high school, curricular and structural reforms will have limited impact on raising student engagement. The authors illustrate the history of high school reform, and develop a case for the necessity of cultural reform, by taking an intimate look at one very typical urban high school—Dorchester High School in Boston. Dorchester High faced trends, policies, and challenges similar to those of high schools all over the country, so that the lessons learned there should be instructive for urban high schools across America. Gonsalves and Leonard also examine Dorchester High in the context of community partnerships and relationships.",
        "coverurl": [
            "https://covers.openlibrary.org/b/isbn/9780275991654-L.jpg",
            28992
        ]
    },
    {
        "mmsId": "9952429052401401",
        "SortDate": "2024-04-08",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Vale, Lawrence J., 1959-",
        "Format": "P",
        "isbn13": "9780674002869",
        "ISBNS": "9780674044579; 0674044576; 9780674025752; 067402575X; 0674002865; 9780674002869",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-04-08",
        "ReportingCode": null,
        "Title": "From The Puritans To The Projects : Public Housing And Public Neighbors /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "From the almshouses of seventeenth-century Puritans to the massive housing projects of the mid-twentieth century, the struggle over housing assistance in the United States has exposed a deep-seated ambivalence about the place of the urban poor. Lawrence J. Vale's groundbreaking book is both a comprehensive institutional history of public housing in Boston and a broader examination of the nature and extent of public obligation to house socially and economically marginal Americans during the past 350 years. First, Vale highlights startling continuities both in the way housing assistance has been delivered to the American poor and in the policies used to reward the nonpoor. He traces the stormy history of the Boston Housing Authority, a saga of entrenched patronage and virulent racism tempered, and partially overcome, by the efforts of unyielding reformers. He explores the birth of public housing as a program intended to reward the upwardly mobile working poor, details its painful transformation into a system designed to cope with society's least advantaged, and questions current policy efforts aimed at returning to a system of rewards for responsible members of the working class. The troubled story of Boston public housing exposes the mixed motives and ideological complexity that have long characterized housing in America, from the Puritans to the projects.",
        "coverurl": [
            "https://books.google.com/books/content?id=D855PFwzHzoC&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "10486"
        ]
    },
    {
        "mmsId": "9952429052501401",
        "SortDate": "2024-03-29",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Mitchell, John Hanson, author.",
        "Format": "P",
        "isbn13": "9781593761424",
        "ISBNS": "9781593760267; 1593760264; 9781593761424; 1593761422",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-29",
        "ReportingCode": null,
        "Title": "Looking For Mr. Gilbert : The Reimagined Life Of An African American /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "Thirty years ago in the attic of an old estate in Massachusetts, John Hanson Mitchell discovered over two thousand antique glass plate negatives. He was told that the photographs had been taken by nineteenth–century ornithologist and conservationist William Brewster, but as a result of a tip from a Harvard research assistant, he began to suspect that the images were actually the work of Brewster's African American assistant, Robert A. Gilbert. So begins the author's journey. From the maze–like archives at Harvard's Museum of Comparative Zoology to the Virginia countryside and haunts of American expats in 1920s Paris, as well as the rich cultural world of blacks in nineteenth–century Boston, Mitchell brings sharp focus to the figure of Mr. Gilbert, a quiet, unassuming Renaissance man who succeeded as best as he could beneath the iron ceiling of American racism. Told with Mitchell's trademark grace and style, the fascinating story of this \"invisible man\" deepens our understanding of the African American past as well as the history of American photography.",
        "coverurl": [
            "https://covers.openlibrary.org/b/isbn/9781593761424-L.jpg",
            31723
        ]
    },
    {
        "mmsId": "9952429351501401",
        "SortDate": "2024-03-25",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Weatherford, Jeffery Boston, illustrator.",
        "Author": "Weatherford, Carole Boston, 1956- author.",
        "Format": "P",
        "isbn13": "9781665913645",
        "ISBNS": "1665913622; 9781665913621; 9781665913645; 1665913649",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-25",
        "ReportingCode": "None",
        "Title": "Kin : Rooted In Hope /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": "Favat Children's & Young Adult Collection",
        "PermanentCallNumber": "PZ8.3.W374 Ki 2023",
        "summary": "A Coretta Scott King Honor Book An “imaginative and moving” (The Horn Book, starred review) portrait of a Black family tree shaped by enslavement and freedom, rendered in searing poems by acclaimed author Carole Boston Weatherford and stunning art by her son Jeffery Boston Weatherford. I call their names: Abram Alice Amey Arianna Antiqua I call their names: Isaac Jake James Jenny Jim Every last one, property of the Lloyds, the state’s preeminent enslavers. Every last one, with a mind of their own and a story that ain’t yet been told. Till now. Carole and Jeffery Boston Weatherford’s ancestors are among the founders of Maryland. Their family history there extends more than three hundred years, but as with the genealogical searches of many African Americans with roots in slavery, their family tree can only be traced back five generations before going dark. And so from scraps of history, Carole and Jeffery have conjured the voices of their kin, creating an often painful but ultimately empowering story of who their people were in a breathtaking book that is at once deeply personal yet all too universal. Carole’s poems capture voices ranging from her ancestors to Frederick Douglass to Harriet Tubman to the plantation house and land itself that connects them all, and Jeffery’s evocative illustrations help carry the story from the first mention of a forebear listed as property in a 1781 ledger to he and his mother’s homegoing trip to Africa in 2016. Shaped by loss, erasure, and ultimate reclamation, this is the story of not only Carole and Jeffery’s family, but of countless other Black families in America.",
        "coverurl": [
            "https://books.google.com/books/content?id=MROsEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "15160"
        ]
    },
    {
        "mmsId": "9952429351601401",
        "SortDate": "2024-03-25",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Torres Sanchez, Jenny, contributor.; Ribay, Randy, contributor.; Reynolds, Jason, contributor.; Neri, Greg, contributor.; McLemore, Anna-Marie, contributor.; McCarthy, Cory, contributor.; Levithan, David, contributor.; Charlton-Trujillo, e. E., contributor.; Anderson, M. T., contributor.; King, A. S. 1970- editor. (Amy Sarig),",
        "Author": null,
        "Format": "P",
        "isbn13": "9780593620298",
        "ISBNS": "0593620283; 9780593620281; 9780593620298; 0593620291",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-25",
        "ReportingCode": "None",
        "Title": "The Collectors : Stories /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": "Favat Children's & Young Adult Collection",
        "PermanentCallNumber": "PZ5 .C65 2023",
        "summary": "Winner of the 2024 Michael L. Printz Award From Michael L. Printz Award winner A.S. King and an all-star team of contributors including Anna-Marie McLemore and Jason Reynolds, an anthology of stories about remarkable people and their strange and surprising collections. From David Levithan’s story about a non-binary kid collecting pieces of other people’s collections to Jenny Torres Sanchez's tale of a girl gathering types of fire while trying not to get burned to G. Neri's piece about 1970's skaters seeking opportunities to go vertical—anything can be collected and in the hands of these award-winning and bestselling authors, any collection can tell a story. Nine of the best YA novelists working today have written fiction based on a prompt from Printz-winner A.S. King (who also contributes a story) and the result is itself an extraordinary collection. M. T. Anderson, e. E. Charlton-Trujillo, A.S. King, David Levithan, Cory McCarthy, Anna-Marie McLemore, G. Neri, Jason Reynolds, Randy Ribay, and Jenny Torres Sanchez have each penned a surprising and provocative tale.",
        "coverurl": [
            "https://books.google.com/books/content?id=oLmmEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "15549"
        ]
    },
    {
        "mmsId": "9952429351701401",
        "SortDate": "2024-03-25",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Nazemian, Abdi, author.",
        "Format": "P",
        "isbn13": "9780063039391",
        "ISBNS": "0063039370; 9780063039377; 9780063039391; 0063039397",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-25",
        "ReportingCode": "None",
        "Title": "Only This Beautiful Moment /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": "Favat Children's & Young Adult Collection",
        "PermanentCallNumber": "PZ7.N378 On 2023",
        "summary": "Stonewall Book Award Winner * A Best Book of the Year from the Guardian, ALA Booklist, Kirkus Reviews, and BookPage From the award–winning author of Like a Love Story comes a sweeping story of three generations of boys in the same Iranian family. Perfect for fans of Last Night at the Telegraph Club and Darius the Great Is Not Okay. 2019. Moud is an out gay teen living in Los Angeles with his distant father, Saeed. When Moud gets the news that his grandfather in Iran is dying, he accompanies his dad to Tehran, where the revelation of family secrets will force Moud into a new understanding of his history, his culture, and himself. 1978. Saeed is an engineering student with a promising future ahead of him in Tehran. But when his parents discover his involvement in the country’s burgeoning revolution, they send him to safety in America, a country Saeed despises. And even worse—he’s forced to live with the American grandmother he never knew existed. 1939. Bobby, the son of a calculating Hollywood stage mother, lands a coveted MGM studio contract. But the fairy-tale world of glamour he’s thrust into has a dark side. Set against the backdrop of Tehran and Los Angeles, this tale of intergenerational trauma and love is an ode to the fragile bonds of family, the hidden secrets of history, and all the beautiful moments that make us who we are today.",
        "coverurl": [
            "https://books.google.com/books/content?id=y4OAEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "19825"
        ]
    },
    {
        "mmsId": "9952429351801401",
        "SortDate": "2024-03-25",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Graves, Byron, author.",
        "Format": "P",
        "isbn13": "9780063160378",
        "ISBNS": "0063160374; 9780063160378",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-25",
        "ReportingCode": "None",
        "Title": "Rez Ball /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": "Favat Children's & Young Adult Collection",
        "PermanentCallNumber": "PZ7.1.G73 Rez 2023",
        "summary": "This compelling debut novel by new talent Byron Graves tells the relatable, high-stakes story of a young athlete determined to play like the hero his Ojibwe community needs him to be. These days, Tre Brun is happiest when he is playing basketball on the Red Lake Reservation high school team--even though he can't help but be constantly gut-punched with memories of his big brother, Jaxon, who died in an accident. When Jaxon's former teammates on the varsity team offer to take Tre under their wing, he sees this as his shot to represent his Ojibwe rez all the way to their first state championship. This is the first step toward his dream of playing in the NBA, no matter how much the odds are stacked against him. But stepping into his brother's shoes as a star player means that Tre can't mess up. Not on the court, not at school, and not with his new friend, gamer Khiana, who he is definitely not falling in love with. After decades of rez teams almost making it, Tre needs to take his team to state. Because if he can live up to Jaxon's dreams, their story isn't over yet. This book is published by Heartdrum, an imprint that publishes high-quality, contemporary stories about Indigenous young people in the United States and Canada.",
        "coverurl": [
            "https://books.google.com/books/content?id=dMGTzwEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "11307"
        ]
    },
    {
        "mmsId": "9952429351901401",
        "SortDate": "2024-03-25",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Sheinkin, Steve, author.",
        "Format": "P",
        "isbn13": "9781250265722",
        "ISBNS": "125026572X; 9781250265722",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-25",
        "ReportingCode": "None",
        "Title": "Impossible Escape : A True Story Of Survival And Heroism In Nazi Germany /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": "Favat Children's & Young Adult Collection",
        "PermanentCallNumber": "D804.34 .S537 2023",
        "summary": "\"From award-winning author Steve Sheinkin, a true story of two Jewish teenagers racing against time during the Holocaust-one in hiding in Hungary, and the other in Auschwitz, plotting escape\"--",
        "coverurl": [
            "https://books.google.com/books/content?id=T_-rEAAAQBAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "11695"
        ]
    },
    {
        "mmsId": "9952429352001401",
        "SortDate": "2024-03-25",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Tison, Ari, author.",
        "Format": "P",
        "isbn13": "9780374389499",
        "ISBNS": "0374389497; 9780374389499",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-25",
        "ReportingCode": "None",
        "Title": "Saints Of The Household /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": "Favat Children's & Young Adult Collection",
        "PermanentCallNumber": "PZ7.1.T5759 Sai 2023",
        "summary": "When brothers Max and Jay help a classmate in trouble, they struggle with the consequences of their violent actions and worry they may be more like their abusive father than they thought, so the brothers turn to their Bribri roots to find their way forward.",
        "coverurl": [
            "https://books.google.com/books/content?id=t7NtEAAAQBAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "15429"
        ]
    },
    {
        "mmsId": "9952429352101401",
        "isbn13": "9780593462317",
        "SortDate": "9999-99-99"
    },
    {
        "mmsId": "9952429352201401",
        "SortDate": "2024-03-25",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Lee, Deborah, author, artist.",
        "Format": "P",
        "isbn13": "9781250252661",
        "ISBNS": "1250252652; 9781250252654; 1250252660; 9781250252661",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-25",
        "ReportingCode": "None",
        "Title": "In Limbo /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": "Favat Children's & Young Adult Collection",
        "PermanentCallNumber": "PN6727.L3798 Z46 2023",
        "summary": "\"Set between New Jersey and Seoul, this coming-of-age story follows the author as she goes to South Korea, where she realizes something that changes her perspective on her family, her heritage and herself\"--",
        "coverurl": [
            "https://books.google.com/books/content?id=8q5uEAAAQBAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "14742"
        ]
    },
    {
        "mmsId": "9952429352301401",
        "isbn13": "9781668891827",
        "SortDate": "9999-99-99"
    },
    {
        "mmsId": "9952429352401401",
        "SortDate": "2024-03-25",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Zoboi, Ibi Aanu, author.",
        "Format": "P",
        "isbn13": "9780062888846",
        "ISBNS": "0062888846; 9780062888846",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-25",
        "ReportingCode": "None",
        "Title": "Nigeria Jones /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": "Favat Children's & Young Adult Collection",
        "PermanentCallNumber": "PZ7.1.Z64 Ni 2023",
        "summary": "From Ibi Zoboi, bestselling, award-winning author of American Street and co-author of Punching the Air, comes a bold new YA coming-of-age story, which explores race, feminism, and complicated family dynamics, about a girl whose father is the leader of a Black liberation group. The ideal next read for fans of Roxane Gay, Jacqueline Woodson, and Elizabeth Acevedo. Warrior Princess. That's what Nigeria Jones's father calls her. He has raised her as part of the Movement, a Black separatist group based in Philadelphia. Nigeria is homeschooled and vegan and participates in traditional rituals to connect her and other kids from the group to their ancestors. But when her mother--the perfect matriarch of their Movement--disappears, Nigeria's world is upended. She finds herself taking care of her baby brother and stepping into a role she doesn't want. Nigeria's mother had secrets. She wished for a different life for her children, which includes sending her daughter to a private Quaker school outside of their strict group. Despite her father's disapproval, Nigeria attends the school with her cousin, Kamau, and Sage, who used to be a friend. -There, she begins to flourish and expand her universe. As Nigeria searches for her mother, she starts to uncover a shocking truth. One that will lead her to question everything she thought she knew about her life and her family. From award-winning author Ibi Zoboi comes a searing, powerful coming-of-age story about discovering who you are in the world--and fighting for that person--by having the courage to remix the founding tenets of your life to be your own revolution.",
        "coverurl": [
            "https://books.google.com/books/content?id=vYdRzwEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "17830"
        ]
    },
    {
        "mmsId": "9952429449901401",
        "isbn13": "9781580893497",
        "SortDate": "9999-99-99"
    },
    {
        "mmsId": "9952429450001401",
        "SortDate": "2024-04-01",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Schorow, Stephanie, author.",
        "Format": "P",
        "isbn13": "9781493054992",
        "ISBNS": "1493054988; 9781493054985; 9781493054992; 1493054996",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-04-01",
        "ReportingCode": null,
        "Title": "The Great Boston Fire : The Inferno That Nearly Incinerated The City /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "For two days in November, 1872, a massive fire swept through Boston, leaving the downtown in ruins and the population traumatized. Coming barely a year after the infamous Chicago fire, Boston’s inferno turned out to be one of the most expensive fires per acre in US history. Yet today few are aware of how close Boston came to destruction. Boston author Stephanie Schorow masterfully recounts the fire’s history from the foolish decisions that precipitated it to the heroics of firefighters who fought it. Lavishly illustrated with period artwork and photographs and published just before the fire’s 150th anniversary, The Great Boston Fire captures the drama of a life-and-death battle in the heart of the city.",
        "coverurl": [
            "https://books.google.com/books/content?id=FaRMEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "16472"
        ]
    },
    {
        "mmsId": "9952429450101401",
        "isbn13": "9781544904658",
        "SortDate": "9999-99-99"
    },
    {
        "mmsId": "9952429450201401",
        "SortDate": "2024-04-01",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Schorow, Stephanie, author.",
        "Format": "P",
        "isbn13": "9781467152877",
        "ISBNS": "1467152870; 9781467152877",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-04-01",
        "ReportingCode": null,
        "Title": "The Cocoanut Grove Nightclub Fire : A Boston Tragedy /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "On November 28, 1942, fire roared through Boston's famed Cocoanut Grove nightclub during what was supposed to be a high-spirited Saturday night. By midnight, more than five hundred people were dead, dying, or maimed for life. Local author Stephanie Schorow probes the club's history, the circumstances leading to the fire, and the tragedy's lingering impact. The inferno reached deep into the city's social structure--its politics, medical care, law enforcement, and religious life--and touched nearly everyone in the Boston area, even those who had never set foot in the club. In this newly updated and revised edition, Schorow has added new information, photographs, interviews and insights on the worst nightclub fire in American history.",
        "coverurl": [
            "https://books.google.com/books/content?id=VaiGEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "13354"
        ]
    },
    {
        "mmsId": "9952429450301401",
        "SortDate": "2024-04-01",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Jones, Jacqueline, 1948- author.",
        "Format": "P",
        "isbn13": "9781541619807",
        "ISBNS": "154161979X; 9781541619791; 9781541619807; 1541619803",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-04-01",
        "ReportingCode": null,
        "Title": "No Right To An Honest Living : The Struggles Of Boston's Black Workers In The Civil War Era /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "From a Bancroft Prize winner, a harrowing portrait of Black workers and white hypocrisy in nineteenth-century Boston Impassioned antislavery rhetoric made antebellum Boston famous as the nation’s hub of radical abolitionism. In fact, however, the city was far from a beacon of equality. In No Right to an Honest Living, historian Jacqueline Jones reveals how Boston was the United States writ small: a place where the soaring rhetoric of egalitarianism was easy, but justice in the workplace was elusive. Before, during, and after the Civil War, white abolitionists and Republicans refused to secure equal employment opportunity for Black Bostonians, condemning most of them to poverty. Still, Jones finds, some Black entrepreneurs ingeniously created their own jobs and forged their own career paths. Highlighting the everyday struggles of ordinary Black workers, this book shows how injustice in the workplace prevented Boston—and the United States—from securing true equality for all.",
        "coverurl": [
            "https://books.google.com/books/content?id=R-5tEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "16811"
        ]
    },
    {
        "mmsId": "9952429450401401",
        "SortDate": "2024-04-01",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Most, Doug.",
        "Format": "P",
        "isbn13": "9781250061355",
        "ISBNS": "9781250061355; 1250061350",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-04-01",
        "ReportingCode": null,
        "Title": "The Race Underground : Boston, New York, And The Incredible Rivalry That Built America's First Subway /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "In the late nineteenth century, as cities like Boston and New York grew more congested, the streets became clogged with plodding, horse-drawn carts. When the great blizzard of 1888 crippled the entire northeast, a solution had to be found. Two brothers from one of the nation's great families-Henry Melville Whitney of Boston and William Collins Whitney of New York-pursued the dream of his city digging America's first subway, and the great race was on. The competition between Boston and New York played out in an era not unlike our own, one of economic upheaval, life-changing innovations, class warfare, bitter political tensions, and the question of America's place in the world. The Race Underground is peopled with the famous, like Boss Tweed, Grover Cleveland and Thomas Edison, and the not-so-famous, from brilliant engineers to the countless \"sandhogs\" who shoveled, hoisted and blasted their way into the earth's crust, sometimes losing their lives in the construction of the tunnels. Doug Most chronicles the science of the subway, looks at the centuries of fears people overcame about traveling underground and tells a story as exciting as any ever ripped from the pages of U.S. history. The Race Underground is a great American saga of two rival American cities, their rich, powerful and sometimes corrupt interests, and an invention that changed the lives of millions.",
        "coverurl": [
            "https://books.google.com/books/content?id=o_vZoAEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "10226"
        ]
    },
    {
        "mmsId": "9952429450501401",
        "SortDate": "2024-04-01",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Masur, Louis P.",
        "Format": "P",
        "isbn13": "9781596913646",
        "ISBNS": "1596913649; 9781596913646",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-04-01",
        "ReportingCode": null,
        "Title": "The Soiling Of Old Glory : The Story Of A Photograph That Shocked America /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "April 5, 1976. As Boston simmered with tension over forced school busing, one photo made headlines. Examine the power of photography and the iconic value of the flag, as it opens a dramatic window onto the turbulent issue of race in America.",
        "coverurl": [
            "https://books.google.com/books/content?id=l0Ou_8Tgl6kC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "12352"
        ]
    },
    {
        "mmsId": "9952429450601401",
        "isbn13": "9781596295803",
        "SortDate": "9999-99-99"
    },
    {
        "mmsId": "9952429450701401",
        "isbn13": "9788566741032",
        "SortDate": "9999-99-99"
    },
    {
        "mmsId": "9952429450801401",
        "SortDate": "2024-04-01",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Hirshman, Linda, 1944- author.",
        "Format": "P",
        "isbn13": "9781328900357",
        "ISBNS": "132890024X; 9781328900241; 0063268701; 9780063268708; 9781328900357; 1328900355",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-04-01",
        "ReportingCode": null,
        "Title": "The Color Of Abolition : How A Printer, A Prophet, And A Contessa Moved A Nation /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "The story of the fascinating, fraught alliance among Frederick Douglass, William Lloyd Garrison, and Maria Weston Chapman—and how its breakup led to the success of America’s most important social movement. “Fresh, provocative and engrossing.” —New York Times In the crucial early years of the Abolition movement, the Boston branch of the cause seized upon the star power of the eloquent ex-slave Frederick Douglass to make its case for slaves’ freedom. Journalist William Lloyd Garrison promoted emancipation while Garrison loyalist Maria Weston Chapman, known as “the Contessa,” raised money and managed Douglass’s speaking tour from her Boston townhouse. Conventional histories have seen Douglass’s departure for the New York wing of the Abolition party as a result of a rift between Douglass and Garrison. But, as acclaimed historian Linda Hirshman reveals, this completely misses the woman in power. Weston Chapman wrote cutting letters to Douglass, doubting his loyalty; the Bostonian abolitionists were shot through with racist prejudice, even aiming the N-word at Douglass among themselves. Through incisive, original analysis, Hirshman convinces that the inevitable breakup was in fact a successful failure. Eventually, as the most sought-after Black activist in America, Douglass was able to dangle the prize of his endorsement over the Republican Party’s candidate for president, Abraham Lincoln. Two years later the abolition of slavery—if not the abolition of racism—became immutable law.",
        "coverurl": [
            "https://books.google.com/books/content?id=SigWEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "15109"
        ]
    },
    {
        "mmsId": "9952429450901401",
        "SortDate": "2024-04-01",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Tobyne, Dan, author.",
        "Format": "P",
        "isbn13": "9781608939916",
        "ISBNS": "1608939928; 9781608939923; 9781608939916; 160893991X",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-04-01",
        "ReportingCode": null,
        "Title": "Urban Archaeology Boston : Discovering The History Hidden In Plain Sight /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "Cities are constantly changing, constantly under construction, constantly moving forward. But if you know how and where to look, and if you look carefully, much of the past is waiting to be rediscovered beneath the façade of progress. Dan Tobyne leads readers on a contemporary archaeological tour of Boston, revealing fascinating aspects of the city's history through what remains of old buildings, structures, streets, and even such mundane objects as manhole covers, callboxes, and trash cans.",
        "coverurl": [
            "https://books.google.com/books/content?id=7csetAEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "11248"
        ]
    },
    {
        "mmsId": "9952429451001401",
        "isbn13": "9781611452242",
        "SortDate": "9999-99-99"
    },
    {
        "mmsId": "9952429451101401",
        "SortDate": "2024-04-01",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Steinberg, Marc W. 1956- author. (Marc William),",
        "Author": "Ewick, Patricia, author.",
        "Format": "P",
        "isbn13": "9780226644431",
        "ISBNS": "022664412X; 9780226644127; 022664426X; 9780226644264; 9780226644431; 022664443X",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-04-01",
        "ReportingCode": null,
        "Title": "Beyond Betrayal : The Priest Sex Abuse Crisis, The Voice Of The Faithful, And The Process Of Collective Identity /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "In 2002, the national spotlight fell on Boston’s archdiocese, where decades of rampant sexual misconduct from priests—and the church’s systematic cover-ups—were exposed by reporters from the Boston Globe. The sordid and tragic stories of abuse and secrecy led many to leave the church outright and others to rekindle their faith and deny any suggestions of institutional wrongdoing. But a number of Catholics vowed to find a middle ground between these two extremes: keeping their faith while simultaneously working to change the church for the better. Beyond Betrayal charts a nationwide identity shift through the story of one chapter of Voice of the Faithful (VOTF), an organization founded in the scandal’s aftermath. VOTF had three goals: helping survivors of abuse; supporting priests who were either innocent or took risky public stands against the wrongdoers; and pursuing a broad set of structural changes in the church. Patricia Ewick and Marc W. Steinberg follow two years in the life of one of the longest-lived and most active chapters of VOTF, whose thwarted early efforts at ecclesiastical reform led them to realize that before they could change the Catholic Church, they had to change themselves. The shaping of their collective identity is at the heart of Beyond Betrayal, an ethnographic portrait of how one group reimagined their place within an institutional order and forged new ideas of faith in the wake of widespread distrust.",
        "coverurl": [
            "https://books.google.com/books/content?id=eR2jDwAAQBAJ&printsec=frontcover&img=1&zoom=10&source=gbs_api",
            "67762"
        ]
    },
    {
        "mmsId": "9952429451201401",
        "SortDate": "2024-04-01",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Dunning, Claire, author.",
        "Format": "P",
        "isbn13": "9780226819914",
        "ISBNS": "0226819906; 9780226819907; 0226819892; 9780226819891; 9780226819914; 0226819914",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-04-01",
        "ReportingCode": null,
        "Title": "Nonprofit Neighborhoods : An Urban History Of Inequality And The American State /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "An exploration of how and why American city governments delegated the responsibility for solving urban inequality to the nonprofit sector. Nonprofits serving a range of municipal and cultural needs are now so ubiquitous in US cities, it can be difficult to envision a time when they were more limited in number, size, and influence. Turning back the clock, however, uncovers both an illuminating story of how the nonprofit sector became such a dominant force in American society, as well as a troubling one of why this growth occurred alongside persistent poverty and widening inequality. Claire Dunning’s book connects these two stories in histories of race, democracy, and capitalism, revealing how the federal government funded and deputized nonprofits to help individuals in need, and in so doing avoided addressing the structural inequities that necessitated such action in the first place. Nonprofit Neighborhoods begins after World War II, when suburbanization, segregation, and deindustrialization inaugurated an era of urban policymaking that applied private solutions to public problems. Dunning introduces readers to the activists, corporate executives, and politicians who advocated addressing poverty and racial exclusion through local organizations, while also raising provocative questions about the politics and possibilities of social change. The lessons of Nonprofit Neighborhoods exceed the bounds of Boston, where the story unfolds, providing a timely history of the shift from urban crisis to urban renaissance for anyone concerned about American inequality—past, present, or future.",
        "coverurl": [
            "https://books.google.com/books/content?id=ZwhuEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "11683"
        ]
    },
    {
        "mmsId": "9952429451301401",
        "SortDate": "2024-04-01",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Boston Public Schools. Department of Early Childhood, issuing body.; Mardell, Ben, author.; Baker, Megina, author.",
        "Author": "Bardige, Betty Lynn Segal, author.",
        "Format": "P",
        "isbn13": "9781682532034",
        "ISBNS": "168253202X; 9781682532027; 1682532038; 9781682532034",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-04-01",
        "ReportingCode": null,
        "Title": "Children At The Center : Transforming Early Childhood Education In The Boston Public Schools /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "Children at the Center provides a closely observed account of a decade-long effort to reshape the scope, direction, and quality of the Boston Public Schools' early childhood programs. The authors show how the district was able to work with and against the constraints of the current accountability system to create a high-quality, whole-child focused, and intellectually engaging program that has had a significant impact in narrowing income-based learning gaps. Written in collaboration with the Department of Early Childhood Education, this account of creating successful preK programs in a diverse urban district will provide a valuable resource for practitioners engaged in similar work across the country. \"This is the book I've been waiting for. Children at the Center includes many voices expressing the importance of high-quality early learning and illustrating how it can be achieved. The Boston case study demonstrates the brilliance of the social justice framework that sustains the vision over time-and highlights the complexity of the dynamic, essential relationships with teachers, principals, community organizations, funders, politicians, and school administrators. After reading this book I am both inspired by possibilities and energized to pursue the transformations still required to best serve all of our children.\" --Valora Washington, CEO, Council for Professional Recognition \"With joyful, purposeful activity as the core value and priority for children, teachers, and even the district's central office staff, the story of Boston Public Schools stands apart from the overarching tone of education reform across the country. Children at the Center presents a clear picture of how to navigate the false dichotomies of play versus rigor, and policy versus practice, not only in preK, but also in the primary grades.\" --Kristie A. Kauerz, director, National P-3 Center, University of Washington/University of Colorado Denver Betty Bardige is a developmental psychologist and an early childhood author, advocate, foundation leader, and consultant. Megina Baker is a researcher at Project Zero at the Harvard Graduate School of Education, and part of the early childhood education faculty at Boston University. Ben Mardell is a principal investigator at Project Zero at the Harvard Graduate School of Education.",
        "coverurl": [
            "https://covers.openlibrary.org/b/isbn/9781682532034-L.jpg",
            44409
        ]
    },
    {
        "mmsId": "9952429451401401",
        "isbn13": "9781685750183",
        "SortDate": "9999-99-99"
    },
    {
        "mmsId": "9952429451501401",
        "SortDate": "2024-04-01",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Deming, Brian, 1954- author.",
        "Format": "P",
        "isbn13": "9781594162404",
        "ISBNS": "9781594162404; 1594162409",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-04-01",
        "ReportingCode": null,
        "Title": "Boston And The Dawn Of American Independence /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "\"In 1760, no one could imagine the American colonies revolting against Great Britain. The colonists were not hungry peasants groaning under the whip of a brute. They lived well. Land was cheap, wages were good, opportunities abounded. While many colonists had been in the New World for generations, they identified with Britain, and England was still \"home.\" Yet in the space of just fifteen years these sturdy bonds snapped. Boston -- a town of just 16,000 -- lit the fire for American Independence. Here the author explains how and why in his deeply researched history.\" --Page 4 of cover.",
        "coverurl": [
            "https://books.google.com/books/content?id=dxvgsgEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "12867"
        ]
    },
    {
        "mmsId": "9952429451601401",
        "SortDate": "2024-04-01",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Kantrowitz, Stephen David, 1965-",
        "Format": "P",
        "isbn13": "9780143123446",
        "ISBNS": "1594203423; 9781594203428; 0143123440; 9780143123446",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-04-01",
        "ReportingCode": null,
        "Title": "More Than Freedom : Fighting For Black Citizenship In A White Republic, 1829-1889 /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "A major new account of the Northern movement to establish African Americans as full citizens before, during, and after the Civil War In More Than Freedom, award-winning historian Stephen Kantrowitz offers a bold rethinking of the Civil War era. Kantrowitz show how the fight to abolish slavery was always part of a much broader campaign by African Americans to claim full citizenship and to remake the white republic into a place where they could belong. More Than Freedom chronicles this epic struggle through the lives of black and white abolitionists in and around Boston, including Frederick Douglass, Senator Charles Sumner, and lesser known but equally important figures. Their bold actions helped bring about the Civil War, set the stage for Reconstruction, and left the nation forever altered.",
        "coverurl": [
            "https://books.google.com/books/content?id=b-dvDwAAQBAJ&printsec=frontcover&img=1&zoom=10&source=gbs_api",
            "73911"
        ]
    },
    {
        "mmsId": "9952429451701401",
        "isbn13": "9781032047065",
        "SortDate": "9999-99-99"
    },
    {
        "mmsId": "9952429451801401",
        "SortDate": "2024-04-01",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Kemeny, Paul Charles, author.",
        "Format": "P",
        "isbn13": "9780190844400",
        "ISBNS": "0190844396; 9780190844394; 9780190844424; 0190844426; 9780190844400; 019084440X",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-04-01",
        "ReportingCode": null,
        "Title": "The New England Watch And Ward Society /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "The New England Watch and Ward Society provides a new window into the history of the Protestant establishment's prominent role in late nineteenth-century public life and its confrontation with modernity, commercial culture, and cultural pluralism in early twentieth-century America. Elite liberal Protestants, typically considered progressive, urbane, and tolerant, established the Watch and Ward Society in 1878 to suppress literature they deemed obscene, notably including Walt Whitman's Leaves of Grass. These self-appointed custodians of Victorian culture enjoyed widespread support from many of New England's most renowned ministers, distinguished college presidents, respected social reformers, and wealthy philanthropists. In the 1880s, the Watch and Ward Society expanded its efforts to regulate public morality by attacking gambling and prostitution. The society not only expressed late nineteenth-century Victorian American values about what constituted \"good literature,\" sexual morality, and public duty, it also embodied Protestants' efforts to promote these values in an increasingly intellectually and culturally diverse society. By 1930, the Watch and Ward Society had suffered a very public fall from grace. Following controversies over the suppression of H.L. Mencken's American Mercury as well as popular novels such as Sinclair Lewis' Elmer Gantry and D.H. Lawrence's Lady Chatterley's Lover, cultural modernists, civil libertarians, and publishers attacked the moral reform movement, ridiculing its leaders' privileged backgrounds, social idealism, and religious commitments. Their critique reshaped the dynamics of Protestant moral reform activity as well as public discourse in subsequent decades. For more than a generation, however, the Watch and Ward Society expressed mainline Protestant attitudes toward literature, gambling, and sexuality.",
        "coverurl": [
            "https://books.google.com/books/content?id=L_pADwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "11304"
        ]
    },
    {
        "mmsId": "9952429451901401",
        "SortDate": "2024-04-08",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Kilcrease, Kelly, author.",
        "Format": "P",
        "isbn13": "9781467144735",
        "ISBNS": "1467144738; 9781467144735",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-04-08",
        "ReportingCode": null,
        "Title": "Boston's Long Wharf : A Path To The Sea /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "One of America's oldest existing structures, Long Wharf encapsulates the most important events in Boston's history. Created in 1711 and spanning almost a half mile in length, it initially served as a defense for the town of Boston and a place for local merchants to sell and ship their cargo. Multitudes of different merchants had stores there over the decades, and these products changed as the city evolved. From rum, spices, flour, molasses and tea to fishing, immigration and tourism, the Wharf has always reflected the city it served. Long Wharf also had a darker side, with theft, drownings and slavery. Author and historian Kelly Kilcrease reveals how the Wharf was built, how it played a prominent role during the American Revolution and how it evolved into the landmark we know today.",
        "coverurl": [
            "https://covers.openlibrary.org/b/isbn/9781467144735-L.jpg",
            52511
        ]
    },
    {
        "mmsId": "9952429452101401",
        "SortDate": "2024-04-01",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Spencer, Ian, editor.; Abraham, Jared, editor.; Binder, Daphne, editor.; Shahane, Aniket, author.; Koetter, Fred, author, editor.; Mitchell, Edward (Architect), author, editor.",
        "Author": null,
        "Format": "P",
        "isbn13": "9781945150234",
        "ISBNS": "1945150238; 9781945150234",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-04-01",
        "ReportingCode": null,
        "Title": "Common Wealth /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "Common Wealth, edited by Edward Mitchell, features the work of the Post-Professional Design Studios, taught by Fred Koetter, Ed Mitchell, and Aniket Shahane ('05). The studios examined the impact of recent growth in greater Boston at three sites: Fort Point Channel, Central Square, and City Hall. Boston is transforming its seemingly staid identity as a city of neighborhoods into a more metropolitan place. With essays by Edward Mitchell, Brian Healy ('81), Kishore Varanasi, Tim Love, Aniket Shanane, and Ila Berman, the book focuses on Boston's newest forms of urbanism, the architectural context of the city, and future growth.",
        "coverurl": [
            "https://books.google.com/books/content?id=sQN2vgAACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "11921"
        ]
    },
    {
        "mmsId": "9952429452201401",
        "isbn13": "9781613766224",
        "SortDate": "9999-99-99"
    },
    {
        "mmsId": "9952429452301401",
        "SortDate": "2024-04-01",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": null,
        "Format": "P",
        "isbn13": "9781540229830",
        "ISBNS": "9781540229830; 1540229831",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-04-01",
        "ReportingCode": null,
        "Title": "Brookline, Allston-brighton And The Renewal Of Boston By Ted Clarke",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "No summary.",
        "coverurl": [
            "https://books.google.com/books/content?id=SNoGtwEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "11847"
        ]
    },
    {
        "mmsId": "9952429452501401",
        "isbn13": "9781584798521",
        "SortDate": "9999-99-99"
    },
    {
        "mmsId": "9952430850201401",
        "SortDate": "2024-03-29",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Gibney, Shannon, author.",
        "Format": "P",
        "isbn13": "9780593112007",
        "ISBNS": "0593111990; 9780593111994; 0593112016; 9780593112014; 9780593112007; 0593112008",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-29",
        "ReportingCode": null,
        "Title": "The Girl I Am, Was, And Never Will Be : A Speculative Memoir Of Transracial Adoption /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "A Michael L. Printz Award Honor Book Part memoir, part speculative fiction, this novel explores the often surreal experience of growing up as a mixed-Black transracial adoptee. Dream Country author Shannon Gibney returns with a new book woven from her true story of growing up as the adopted Black daughter of white parents and the fictional story of Erin Powers, the name Shannon was given at birth by the white woman who gave her up for adoption. At its core, the novel is a tale of two girls on two different timelines occasionally bridged by a mysterious portal and their shared search for a complete picture of their origins. Gibney surrounds that story with reproductions of her own adoption documents, letters, family photographs, interviews, medical records, and brief essays on the surreal absurdities of the adoptee experience. The end result is a remarkable portrait of an American experience rarely depicted in any form.",
        "coverurl": [
            "https://books.google.com/books/content?id=wUprEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "12183"
        ]
    },
    {
        "mmsId": "9952430850301401",
        "SortDate": "2024-03-29",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Acker, James, author.",
        "Format": "P",
        "isbn13": "9781335428622",
        "ISBNS": "1335428623; 9781335428622",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-29",
        "ReportingCode": null,
        "Title": "The Long Run /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "\"A boldly authentic new voice in queer fiction.\" --Abdi Nazemian, author of Stonewall Honor book Like a Love Story and The Chandler Legacies Two track and field athletes find an unexpected but powerful love in this unapologetically blunt and unforgettably real YA debut. Sebastian Villeda is over it. Over his rep. Over his bros. Over being \"Bash the Flash,\" fastest sprinter in South Jersey. His dad is gone, his mom is dead, and his stepfather is clueless. Bash has no idea what he wants out of life. Until he meets Sandro. Sandro Miceli is too nice for his own good. The middle child in an always-growing, always-screaming Italian family, Sandro walks around on a broken foot to not bother his busy parents. All he wants is to get out and never look back. When fate--in the form of a party that gets busted--brings these two very different boys together, neither of them could've predicted finding a love that they'd risk everything for...",
        "coverurl": [
            "https://books.google.com/books/content?id=FKgizwEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "16306"
        ]
    },
    {
        "mmsId": "9952430850401401",
        "SortDate": "2024-03-29",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Adia, Jade, author.",
        "Format": "P",
        "isbn13": "9781368084338",
        "ISBNS": "136808432X; 9781368084321; 1368084346; 9781368084345; 9781368084338; 1368084338",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-29",
        "ReportingCode": null,
        "Title": "There Goes The Neighborhood /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "A raised fist against the destructive forces of gentrification and a love letter to communities of color everywhere, Jade Adia's unforgettable debut tells the darkly hilarious story of three best friends willing to do whatever it takes to stay together. The gang is fake, but the fear is real. Rhea's neighborhood is fading away—the mom-and-pop shops of her childhood forced out to make space for an artisanal kombucha brewery here, a hot yoga studio there. And everywhere, the feeling that this place is no longer meant for her. Because while their little corner of South L.A. isn't perfect, to Rhea and her two best friends, it's something even more important—it's home. And it's worth protecting. But as more white people flock to their latest edgy, urban paradise for its cheap rent and sparkling new Whole Foods, more of Rhea's friends and family are pushed out. Until Rhea decides it's time to push back. Armed with their cellphones and a bag of firecrackers, the friends manipulate social media to create the illusion of gang violence in their neighborhood. All Rhea wanted to do was protect her community. Her friends. Herself. No one was supposed to get hurt. No one was supposed to die. But is anyone ever really safe when you're fighting power with fear?",
        "coverurl": [
            "https://books.google.com/books/content?id=dS-zEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "18014"
        ]
    },
    {
        "mmsId": "9952430850501401",
        "SortDate": "2024-03-29",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Miyares, Daniel, illustrator.",
        "Author": "Nayeri, Daniel, author.",
        "Format": "P",
        "isbn13": "9781646143030",
        "ISBNS": "1646143035; 9781646143030",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-29",
        "ReportingCode": null,
        "Title": "The Many Assassinations Of Samir, The Seller Of Dreams /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "A new all-ages adventure tale from Printz Medal Winner, Daniel Nayeri This is the tale of an exciting journey along the Silk Road with a young Monk and his newfound guardian, Samir, a larger than life character and the so-called \"Seller of Dreams\". The man is a scammer; his biggest skill being the ability to talk his way into getting what he wants. While that talking did save Monkey's life, it has left a lot of people furious with Samir-- furious enough to hire assassins. Monkey decides to try and save Samir from the attempts on his life--as a way to pay off his debt! If he can save Samir six times, he'll be a free man...but will they all survive that long? For fans of The Little Prince and Salman Rushdie's Haroun and the Sea of Stories.",
        "coverurl": [
            "https://books.google.com/books/content?id=i4ogzwEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "12360"
        ]
    },
    {
        "mmsId": "9952430850601401",
        "SortDate": "2024-03-29",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Polydoros, Aden, author.",
        "Format": "P",
        "isbn13": "9781335458032",
        "ISBNS": "1335458034; 9781335458032",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-29",
        "ReportingCode": null,
        "Title": "Wrath Becomes Her /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "Vera was made for vengeance. Lithuania, 1943. The Nazis have killed Ezra's daughter. He can't bring Chaya back from the dead, but he can craft something in her image--a golem, infused with pointed rage, to avenge Chaya's death. A Nazi killer made with kishuf, an ancient and profane magic. When Vera awakens, she can feel her violent purpose--her reason for existing--thrumming within her. But she can feel other things, too: glimpses of a human life lived, of stolen kisses amid the tragedy, and of a grisly death. And when she meets Akiva, she recognizes the boy with soft lips that gave warm kisses. But these memories aren't hers, and Vera doesn't know if she gets to have a life beyond what she was made for. If she deserves one. Vera's strength feels limitless--until she learns that there are others who would use kishuf for means far less noble than avenging a daughter's death. As she confronts the very basest of humanity, Vera will need more than what her creator gave her: not just a reason to fight, but a reason to live.",
        "coverurl": [
            "https://books.google.com/books/content?id=p7yRzwEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "12464"
        ]
    },
    {
        "mmsId": "9952430850701401",
        "SortDate": "2024-03-29",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Iloh, Candice, author.",
        "Format": "P",
        "isbn13": "9780593529331",
        "ISBNS": "0593529316; 9780593529317; 9780593529331; 0593529332",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-29",
        "ReportingCode": null,
        "Title": "Salt The Water /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "A Michael L. Printz Award Honor Book Cerulean Gene is free everywhere except school, where they’re known for repeatedly challenging authority. Raised in a free-spirited home by two loving parents who encourage Cerulean to be their full self, they’ve got big dreams of moving cross-country to live off the grid with their friends after graduation. But a fight with a teacher spirals out of control, and Cerulean impulsively drops out to avoid the punishment they fear is coming. Why wait for graduation to leave an oppressive capitalist system and live their dreams? Cerulean is truly brilliant, but their sheltered upbringing hasn’t prepared them for the consequences of their choice — especially not when it’s compounded by a family emergency that puts a parent out of work. Suddenly the money they’d been stacking with their friends is a resource that the family needs to stay afloat. Salt the Water is a book about dreaming in a world that has other plans for your time, your youth, and your future. It asks, what does it look like when a bunch of queer Black kids are allowed to dream? And what does it look like for them to confront the present circumstances of the people they love while still pursuing a wildly different future of their own?",
        "coverurl": [
            "https://books.google.com/books/content?id=bESlEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "18537"
        ]
    },
    {
        "mmsId": "9952430850801401",
        "isbn13": "9781646141777",
        "SortDate": "9999-99-99"
    },
    {
        "mmsId": "9952430850901401",
        "SortDate": "2024-03-29",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "White, Andrew Joseph, author.",
        "Format": "P",
        "isbn13": "9781682636183",
        "ISBNS": "1682636119; 9781682636114; 9781682636183; 1682636186",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-29",
        "ReportingCode": null,
        "Title": "The Spirit Bares Its Teeth /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "New York Times bestselling author Andrew Joseph White returns with the transgressive gothic horror of our time! A blood-soaked and nauseating triumph that cuts like a scalpel and reads like your darkest nightmare. Mors vincit omnia. Death conquers all. London, 1883. The Veil between the living and dead has thinned. Violet-eyed mediums commune with spirits under the watchful eye of the Royal Speaker Society, and sixteen-year-old trans, autistic Silas Bell would rather rip out his violet eyes than become an obedient Speaker wife. After a failed attempt to escape an arranged marriage, Silas is diagnosed with Veil sickness—a mysterious disease sending violet-eyed women into madness—and shipped away to Braxton’s Finishing School and Sanitorium. When the ghosts of missing students start begging Silas for help, he decides to reach into Braxton’s innards and expose its guts to the world—so long as the school doesn’t break him first. Featuring an autistic trans protagonist in a historical setting, Andrew Joseph White’s much-anticipated sophomore novel does not back down from exposing the violence of the patriarchy and the harm inflicted on trans youth who are forced into conformity.",
        "coverurl": [
            "https://books.google.com/books/content?id=b_avEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "20582"
        ]
    },
    {
        "mmsId": "9952430851001401",
        "SortDate": "2024-03-29",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Rodriguez, Edel, author, illustrator.",
        "Format": "P",
        "isbn13": "9781250753984",
        "ISBNS": "125075397X; 9781250753977; 9781250753984; 1250753988",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-29",
        "ReportingCode": null,
        "Title": "Worm : A Cuban American Odyssey /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "From “America’s illustrator in chief” (Fast Company), a stunning graphic memoir of a childhood in Cuba, coming to America on the Mariel boatlift, and a defense of democracy, here and there Hailed for his iconic art on the cover of Time and on jumbotrons around the world, Edel Rodriguez is among the most prominent political artists of our age. Now for the first time, he draws his own life, revisiting his childhood in Cuba and his family’s passage on the infamous Mariel boatlift. When Edel was nine, Fidel Castro announced his surprising decision to let 125,000 traitors of the revolution, or “worms,” leave the country. The faltering economy and Edel’s family’s vocal discomfort with government surveillance had made their daily lives on a farm outside Havana precarious, and they secretly planned to leave. But before that happened, a dozen soldiers confiscated their home and property and imprisoned them in a detention center near the port of Mariel, where they were held with dissidents and criminals before being marched to a flotilla that miraculously deposited them, overnight, in Florida. Through vivid, stirring art, Worm tells a story of a boyhood in the midst of the Cold War, a family’s displacement in exile, and their tenacious longing for those they left behind. It also recounts the coming-of-age of an artist and activist, who, witnessing American’s turn from democracy to extremism, struggles to differentiate his adoptive country from the dictatorship he fled. Confronting questions of patriotism and the liminal nature of belonging, Edel Rodriguez ultimately celebrates the immigrants, maligned and overlooked, who guard and invigorate American freedom.",
        "coverurl": [
            "https://books.google.com/books/content?id=ghgqEAAAQBAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "13319"
        ]
    },
    {
        "mmsId": "9952430851101401",
        "SortDate": "2024-03-29",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Hopson, Nasug̊raq Rainey, author, illustrator.",
        "Format": "P",
        "isbn13": "9781250750655",
        "ISBNS": "1250750652; 9781250750655",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-29",
        "ReportingCode": null,
        "Title": "Eagle Drums /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "In preparation for winter, a skilled young hunter embarks on a perilous journey up the mountain to gather obsidian, where he encounters the fearsome eagle god Savik and is presented with a life-altering choice.",
        "coverurl": [
            "https://books.google.com/books/content?id=xxidEAAAQBAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "12166"
        ]
    },
    {
        "mmsId": "9952430851201401",
        "SortDate": "2024-03-29",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Forrest, Claire (Young adult author), author.",
        "Format": "P",
        "isbn13": "9781338813852",
        "ISBNS": "1338813838; 9781338813838; 9781338813852; 1338813854",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-29",
        "ReportingCode": null,
        "Title": "Where You See Yourself /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "A Schneider Family Book Award Honor Book What does it take to follow your dreams? Where You See Yourself is a relatable, romantic, and necessary story about a girl who has to figure out what--and who--will bring her the happiness she deserves. By the time Effie Galanos starts her senior year, it feels like she’s already been thinking about college applications for an eternity—after all, finding a college that will be the perfect fit and be accessible enough for Effie to navigate in her wheelchair presents a ton of considerations that her friends don’t have to worry about. What Effie hasn’t told anyone is that she already knows exactly what school she has her heart set on: a college in NYC with a major in Mass Media & Society that will set her up perfectly for her dream job in digital media. She’s never been to New York, but paging through the brochure, she can picture the person she’ll be there, far from the Minneapolis neighborhood where she's lived her entire life. When she finds out that Wilder (her longtime crush) is applying there too, it seems like one more sign from the universe that it’s the right place for her. But it turns out that the universe is full of surprises. As Effie navigates her way through a year of admissions visits, senior class traditions, internal and external ableism, and a lot of firsts--and lasts--she starts to learn that sometimes growing up means being open to a world of possibilities you never even dreamed of. And maybe being more than just friends with Wilder is one of those dreams...",
        "coverurl": [
            "https://books.google.com/books/content?id=K3puEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "18176"
        ]
    },
    {
        "mmsId": "9952430851301401",
        "SortDate": "2024-03-29",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Eddings, Mazey, author.",
        "Format": "P",
        "isbn13": "9781250847072",
        "ISBNS": "1250328128; 9781250328120; 1250847060; 9781250847065; 9781250847072; 1250847079",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-29",
        "ReportingCode": null,
        "Title": "Tilly In Technicolor /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "Tilly in Technicolor is Mazey Eddings's sparkling YA debut about two neurodivergent teens who form a connection over the course of a summer. Tilly Twomley is desperate for change. White-knuckling her way through high school with flawed executive functioning has left her burnt out and ready to start fresh. Working as an intern for her perfect older sister’s start up isn’t exactly how Tilly wants to spend her summer, but the required travel around Europe promises a much-needed change of scenery as she plans for her future. The problem is, Tilly has no idea what she wants. Oliver Clark knows exactly what he wants. His autism has often made it hard for him to form relationships with others, but his love of color theory and design allows him to feel deeply connected to the world around him. Plus, he has everything he needs: a best friend that gets him, placement into a prestigious design program, and a summer internship to build his resume. Everything is going as planned. That is, of course, until he suffers through the most disastrous international flight of his life, all turmoil stemming from lively and exasperating Tilly. Oliver is forced to spend the summer with a girl that couldn’t be more his opposite—feeling things for her he can’t quite name—and starts to wonder if maybe he doesn’t have everything figured out after all. As the duo’s neurodiverse connection grows, they learn that some of the best parts of life can’t be planned, and are forced to figure out what that means as their disastrously wonderful summer comes to an end.",
        "coverurl": [
            "https://books.google.com/books/content?id=QHKBEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "15238"
        ]
    },
    {
        "mmsId": "9952430851801401",
        "SortDate": "2024-03-22",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Garza Villa, Jonny, author.",
        "Format": "P",
        "isbn13": "9781250844002",
        "ISBNS": "1250843995; 9781250843999; 9781250844002; 1250844002",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-22",
        "ReportingCode": "None",
        "Title": "Ander & Santi Were Here : A Novel /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": "Favat Children's & Young Adult Collection",
        "PermanentCallNumber": "PZ7.1.G3783 An 2023",
        "summary": "A STONEWALL YOUNG ADULT HONOR BOOK Aristotle and Dante Discover the Secrets of the Universe meets The Sun is Also a Star in this YA contemporary love story from Jonny Garza Villa, Ander & Santi Were Here, about a nonbinary Mexican American teen falling for the shy new waiter at their family’s taqueria. Finding home. Falling in love. Fighting to belong. The Santos Vista neighborhood of San Antonio, Texas, is all Ander Martínez has ever known. The smell of pan dulce. The mixture of Spanish and English filling the streets. And, especially their job at their family's taquería. It's the place that has inspired Ander as a muralist, and, as they get ready to leave for art school, it's all of these things that give them hesitancy. That give them the thought, are they ready to leave it all behind? To keep Ander from becoming complacent during their gap year, their family \"fires\" them so they can transition from restaurant life to focusing on their murals and prepare for college. That is, until they meet Santiago López Alvarado, the hot new waiter. Falling for each other becomes as natural as breathing. Through Santi's eyes, Ander starts to understand who they are and want to be as an artist, and Ander becomes Santi's first steps toward making Santos Vista and the United States feel like home. Until ICE agents come for Santi, and Ander realizes how fragile that sense of home is. How love can only hold on so long when the whole world is against them. And when, eventually, the world starts to win.",
        "coverurl": [
            "https://books.google.com/books/content?id=HI5rEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "13380"
        ]
    },
    {
        "mmsId": "9952430851901401",
        "SortDate": "2024-03-22",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Adler, Dahlia, author.",
        "Format": "P",
        "isbn13": "9781250871664",
        "ISBNS": "1250871646; 9781250871640; 9781250871664; 1250871662",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-22",
        "ReportingCode": "None",
        "Title": "Going Bicoastal /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": "Favat Children's & Young Adult Collection",
        "PermanentCallNumber": "PZ7.1.A25 Go 2023",
        "summary": "\"This is what it looks like when a brilliant high concept is executed to perfection. It’s got all the Dahlia Adler trademarks—romance, wry humor, specificity, and genuine emotional depth.\" - Becky Albertalli, New York Times bestselling author of Kate in Waiting and Simon vs. The Homo Sapiens Agenda A queer Sliding Doors YA rom-com in which a girl must choose between summer in NYC with her dad (and the girl she's always wanted) or LA with her estranged mom (and the guy she never saw coming). In Dahlia Adler’s Going Bicoastal, there’s more than one path to happily ever after. Natalya Fox has twenty-four hours to make the biggest choice of her life: stay home in NYC for the summer with her dad (and finally screw up the courage to talk to the girl she's been crushing on), or spend it with her basically estranged mom in LA (knowing this is the best chance she has to fix their relationship, if she even wants to.) (Does she want to?) How's a girl supposed to choose? She can't, and so both summers play out in alternating timelines - one in which Natalya explores the city, tries to repair things with her mom, works on figuring out her future, and goes for the girl she's always wanted. And one in which Natalya explores the city, tries to repair things with her mom, works on figuring out her future, and goes for the guy she never saw coming.",
        "coverurl": [
            "https://books.google.com/books/content?id=61-BEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "19090"
        ]
    },
    {
        "mmsId": "9952430852001401",
        "SortDate": "2024-03-22",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Wu, Junyi (Graphic designer), illustrator.",
        "Author": "Anderson, M. T., author.",
        "Format": "P",
        "isbn13": "9781536222814",
        "ISBNS": "153622281X; 9781536222814",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-22",
        "ReportingCode": "None",
        "Title": "Elf Dog & Owl Head /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": "Favat Children's & Young Adult Collection",
        "PermanentCallNumber": "PZ7.A54395 El 2023",
        "summary": "From the singular imagination of National Book Award winner M. T. Anderson comes a magical adventure about a boy and his dog—or a dog and her boy—and a forest of wonders hidden in plain sight. Clay has had his fill of home life. A global plague has brought the world to a screeching halt, and with little to look forward to but a summer of video-calling friends, vying with annoying sisters for the family computer, and tuning out his parents’ financial worries, he’s only too happy to retreat to the woods. From the moment the elegant little dog with the ornate collar appears like an apparition among the trees, Clay sees something uncanny in her. With this mysterious Elphinore as guide, he’ll glimpse ancient secrets folded all but invisibly into the forest. Each day the dog leads Clay down paths he never knew existed, deeper into the unknown. But they aren’t alone in their surreal adventures. There are traps and terrors in the woods, too, and if Clay isn’t careful, he might stray off the path and lose his way forever. Graced with evocative black-and-white illustrations by Junyi Wu, Elf Dog and Owl Head is heartfelt and exhilarating, wry and poignant, seamlessly merging the fantastic and the familiar in a tale both timely and timeless.",
        "coverurl": [
            "https://books.google.com/books/content?id=wvePEAAAQBAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "12634"
        ]
    },
    {
        "mmsId": "9952430852101401",
        "SortDate": "2024-03-22",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Young, Brian (Brian Lee).",
        "Author": "Young, Brian author. (Brian Lee),",
        "Format": "P",
        "isbn13": "9780062990402",
        "ISBNS": "0062990403; 9780062990402",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-22",
        "ReportingCode": "None",
        "Title": "Healer Of The Water Monster /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": "Favat Children's & Young Adult Collection",
        "PermanentCallNumber": "PZ7.1.Y6795 He 2021",
        "summary": "Brian Young's powerful debut novel tells of a seemingly ordinary Navajo boy who must save the life of a Water Monster--and comes to realize he's a hero at heart. When Nathan goes to visit his grandma, Nali, at her mobile summer home on the Navajo reservation, he knows he's in for a pretty uneventful summer, with no electricity or cell service. Still, he loves spending time with Nali and with his uncle Jet, though it's clear when Jet arrives that he brings his problems with him. One night, while lost in the nearby desert, Nathan finds someone extraordinary: a Holy Being from the Navajo Creation Story--a Water Monster--in need of help. Now Nathan must summon all his courage to save his new friend. With the help of other Navajo Holy Beings, Nathan is determined to save the Water Monster, and to support Uncle Jet in healing from his own pain. The Heartdrum imprint centers a wide range of intertribal voices, visions, and stories while welcoming all young readers, with an emphasis on the present and future of Indian Country and on the strength of young Native heroes. In partnership with We Need Diverse Books.",
        "coverurl": [
            "https://books.google.com/books/content?id=zrC9zQEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "13510"
        ]
    },
    {
        "mmsId": "9952430852201401",
        "SortDate": "2024-03-22",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Sawyerr, Hannah V., author.",
        "Format": "P",
        "isbn13": "9781647007249",
        "ISBNS": "1419762613; 9781419762611; 9781647007249; 1647007240",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-22",
        "ReportingCode": "None",
        "Title": "All The Fighting Parts /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": "Favat Children's & Young Adult Collection",
        "PermanentCallNumber": "PZ7.5.S27 All 2023",
        "summary": "In the vein of Grown and The Poet X, Hannah V. Sawyerr’s All the Fighting Parts is a searing and defiant young adult novel in verse about reclaiming agency after a sexual assault within the church community. Sixteen-year-old Amina Conteh has always believed in using her voice as her weapon—even when it gets her into trouble. After cursing at a classmate, her father forces her to volunteer at their church with Pastor Johnson. But Pastor Johnson isn’t the holy man everyone thinks he is. The same voice Amina uses to fight falls quiet the night she is sexually assaulted by Pastor Johnson. After that, her life starts to unravel: her father is frustrated that her grades are slipping, and her best friend and boyfriend don’t understand why the once loud and proud girl is now quiet and distant. In a world that claims to support survivors, Amina wonders who will support her when her attacker is everyone’s favorite community leader. When Pastor Johnson is arrested for a different crime, the community is shaken and divided; some call him a monster and others defend him. But Amina is secretly relieved. She no longer has to speak because Pastor Johnson can’t hurt her anymore—or so she believes. To regain her voice and sense of self, Amina must find the power to confront her abuser—in the courtroom and her heart—and learn to use all the fighting parts within her.",
        "coverurl": [
            "https://books.google.com/books/content?id=JyWtEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "18771"
        ]
    },
    {
        "mmsId": "9952430852301401",
        "SortDate": "2024-03-22",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Morrison, Frank, 1971- illustrator.",
        "Author": "Weatherford, Carole Boston, 1956- author.",
        "Format": "P",
        "isbn13": "9781536215540",
        "ISBNS": "1536215546; 9781536215540",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-22",
        "ReportingCode": "None",
        "Title": "How Do You Spell Unfair? : Macnolia Cox And The National Spelling Bee /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": "Favat Children's & Young Adult Collection",
        "PermanentCallNumber": "E185.97.C835 W43 2023",
        "summary": "From a multi-award-winning pair comes a deeply affecting portrait of determination against discrimination: the story of young spelling champion MacNolia Cox. MacNolia Cox was no ordinary kid. Her idea of fun was reading the dictionary. In 1936, eighth grader MacNolia Cox became the first African American to win the Akron, Ohio, spelling bee. And with that win, she was asked to compete at the prestigious National Spelling Bee in Washington, DC, where she and a girl from New Jersey were the first African Americans invited since its founding. She left her home state a celebrity—right up there with Ohio’s own Joe Louis and Jesse Owens—with a military band and a crowd of thousands to see her off at the station. But celebration turned to chill when the train crossed the state line into Maryland, where segregation was the law of the land. Prejudice and discrimination ruled—on the train, in the hotel, and, sadly, at the spelling bee itself. With a brief epilogue recounting MacNolia’s further history, How Do You Spell Unfair? is the story of her groundbreaking achievement magnificently told by award-winning creators and frequent picture-book collaborators Carole Boston Weatherford and Frank Morrison.",
        "coverurl": [
            "https://covers.openlibrary.org/b/isbn/9781536215540-L.jpg",
            43175
        ]
    },
    {
        "mmsId": "9952430852401401",
        "SortDate": "2024-03-22",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Rogers, Shannon C. F., author.",
        "Format": "P",
        "isbn13": "9781250845672",
        "ISBNS": "1250845661; 9781250845665; 9781250845672; 125084567X",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-22",
        "ReportingCode": "None",
        "Title": "I'd Rather Burn Than Bloom /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": "Favat Children's & Young Adult Collection",
        "PermanentCallNumber": "PZ7.1.R6626 Id 2023",
        "summary": "Packed with voice, Shannon C.F. Rogers' I'd Rather Burn than Bloom is a powerful YA novel about a Filipina-American teen who tries to figure out who she really is in the wake of her mother's death. Some girls call their mother their best friend. Marisol Martin? She could never relate. She and her mom were forever locked in an argument with no beginning and no end. Clothes, church, boys, no matter the topic, Marisol always felt like there was an unbridgeable gap between them that they were perpetually shouting across, one that she longed to close. But when her mother dies suddenly, Marisol is left with no one to fight against, haunted by all the things that she both said and didn’t say. Her dad seems completely lost, and worse, baffled by Marisol's attempts to connect with her mother's memory through her Filipino culture. Her brother Bernie is retreating further and further into himself. And when Marisol sleeps with her best friend's boyfriend - and then punches said best friend in the face - she's left alone, with nothing but a burning anger, and nowhere for it to go. And Marisol is determined to stay angry, after all, there’s a lot to be angry about– her father, her mother, the world. But as a new friendship begins to develop with someone who just might understand, Marisol reluctantly starts to open up to her, and to the possibility there’s something else on the other side of that anger– something more to who she is, and who she could be.",
        "coverurl": [
            "https://books.google.com/books/content?id=uaF7EAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "19125"
        ]
    },
    {
        "mmsId": "9952430852501401",
        "SortDate": "2024-03-22",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Apelqvist, Eva, translator.",
        "Author": "Åstot, Moa Backe, author.",
        "Format": "P",
        "isbn13": "9781646142484",
        "ISBNS": "1646142489; 9781646142484",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-22",
        "ReportingCode": "None",
        "Title": "Fire From The Sky /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": "Favat Children's & Young Adult Collection",
        "PermanentCallNumber": "PZ7.1.A8833 Fi 2023",
        "summary": "Ánte's life has been steeped in Sami tradition. It is indisputable to him that he, an only child, will keep working with the reindeer. But there is something else too, something tugging at him. His feelings for his best friend Erik have changed, grown into something bigger. What would people say if they knew? And how does Erik feel? And Erik's voice just the push of a button away. Ánte couldn't answer, could he? But how could he ignore it? Fire From the Sky is a sharp and intelligent story about heritage, family ties and age-old commitments to the past. But also about expectations, compassion, feelings that course through your body like electricity.",
        "coverurl": [
            "https://books.google.com/books/content?id=bvZozwEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "15673"
        ]
    },
    {
        "mmsId": "9952430852601401",
        "SortDate": "2024-03-22",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Lockington, Mariama, author.",
        "Format": "P",
        "isbn13": "9780374388881",
        "ISBNS": "0374388881; 9780374388881",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-22",
        "ReportingCode": "None",
        "Title": "Forever Is Now /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": "Favat Children's & Young Adult Collection",
        "PermanentCallNumber": "PZ7.5.L63 Fo 2023",
        "summary": "\"When sixteen-year-old Sadie, a Black bisexual recluse, develops agoraphobia the summer before her junior year, she relies on her best friend, family, and therapist to overcome her fears.\"--",
        "coverurl": [
            "https://books.google.com/books/content?id=2pKFEAAAQBAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "16736"
        ]
    },
    {
        "mmsId": "9952430852701401",
        "SortDate": "2024-03-22",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Martínez, Andrés Vera, illustrator.",
        "Author": "Shusterman, Neal, author.",
        "Format": "P",
        "isbn13": "9780545313476",
        "ISBNS": "0545313481; 9780545313483; 0545313473; 9780545313476",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-22",
        "ReportingCode": "None",
        "Title": "Courage To Dream : Tales Of Hope In The Holocaust /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": "Favat Children's & Young Adult Collection",
        "PermanentCallNumber": "PZ7.7.S4795 Co 2023",
        "summary": "National Book Award winner Neal Shusterman presents a graphic novel exploring the Holocaust through surreal visions and a textured canvas of heroism and hope. Courage to Dream plunges readers into the darkest time of human history--the Holocaust. This graphic novel explores one of the greatest atrocities in modern memory, delving into the core of what it means to face the extinction of everything and everyone you hold dear.This gripping, multifaceted tapestry is woven from Jewish folklore and cultural history. Five interlocking narratives explore one common story - the tradition of resistance and uplift. Internationally renowned author Neal Shusterman and illustrator Andrés Vera Martínez have created a masterwork that encourages the compassionate, bold reaching for a dream.",
        "coverurl": [
            "https://books.google.com/books/content?id=5wlUzgEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "14940"
        ]
    },
    {
        "mmsId": "9952431852601401",
        "SortDate": "2024-04-03",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "HULLS, TESSA, 1984-",
        "Format": "P",
        "isbn13": "9780374601652",
        "ISBNS": "9780374601652; 0374601658",
        "MaterialType": "BOOK",
        "POLineTypeName": "Physical - One Time",
        "ReceivingDate": "2024-04-03",
        "ReportingCode": null,
        "Title": "Feeding Ghosts: A Graphic Memoir.",
        "VendorName": "GOBI - Library Solutions From EBSCO",
        "LibraryName": "F.W. Olin Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "\"Tessa Hulls delves into her own family history and the intergenerational trauma caused by mental illness and political strife\"--",
        "coverurl": [
            "https://books.google.com/books/content?id=BtDbEAAAQBAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "12830"
        ]
    },
    {
        "mmsId": "9952432652001401",
        "SortDate": "2024-03-20",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Wu, Ying-Chieh, 1978- editor.; Liew, Ying Khai, editor.",
        "Author": null,
        "Format": "E",
        "isbn13": "9781509954605",
        "ISBNS": "1509954619; 9781509954612; 1509954627; 9781509954629; 9781509954605; 1509954600",
        "MaterialType": "BOOK",
        "POLineTypeName": "Electronic Title - One Time",
        "ReceivingDate": "0000-00-00",
        "ReportingCode": null,
        "Title": "Asia-pacific Trusts Law.",
        "VendorName": "GOBI - Library Solutions from EBSCO",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "This book brings together leading legal scholars and practitioners from across the Asia-Pacific region to probe the ways in which trusts law has been adapted by various jurisdictions, and to analyse their causes and effects. The contributions discuss how the trust structure, with its inherent malleability, has been adapted to meet a diverse set of local needs, including social, religious, economic, commercial, or even historical needs. But in most instances, those needs - and the ways in which trusts law has been adapted to meet them - are not unique to a single jurisdiction: they often (coincidentally or otherwise) find much in common with others. By making its readers aware of the commonality of needs in Asia- Pacific, this book also aims to encourage coordination and cooperation in utilising trusts law to address shared concerns across the region.",
        "coverurl": [
            "https://books.google.com/books/content?id=LSiiEAAAQBAJ&printsec=frontcover&img=1&zoom=10&source=gbs_api",
            "33027"
        ]
    },
    {
        "mmsId": "9952432652101401",
        "SortDate": "2024-03-20",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Lubchansky, Mattie, author, artist.",
        "Format": "P",
        "isbn13": "9780593316733",
        "ISBNS": "0593316711; 9780593316719; 9780593316733; 0593316738",
        "MaterialType": "BOOK",
        "POLineTypeName": "Physical - One Time",
        "ReceivingDate": "2024-03-20",
        "ReportingCode": "Display Case",
        "Title": "Boys Weekend /",
        "VendorName": "GOBI - Library Solutions From EBSCO",
        "LibraryName": "F.W. Olin Library",
        "LocationName": "Non-Fiction",
        "PermanentCallNumber": "Fiction L927b 2023",
        "summary": "From the award-winning cartoonist and editor at The Nib, a hilarious trans-\"final girl\" horror graphic novel about a bachelor party gone very, very wrong. \"A witty, tender romp through the cosmic horror of being alive.” —Carmen Maria Machado, author of Her Body and Other Parties Newly-out trans artist’s assistant Sammie is invited to an old friend’s bachelor weekend in El Campo, a hedonistic wonderland of a city floating in the Atlantic Ocean's international waters—think Las Vegas with even fewer rules. Though they have not identified as a man for over a year, Sammie’s college buddies haven't quite gotten the message—as evidenced by their formerly closest friend Adam asking them to be his “best man.” Arriving at the swanky hotel, Sammie immediately questions their decision to come. Bad enough that they have to suffer through a torrent of passive-aggressive comments from the groom's pals—all met with zero pushback from supposed \"nice guy\" Adam. But also, they seem to be the only one who's noticed the mysterious cult that's also staying at the hotel, and is ritually dismembering guests and demanding fealty to their bloodthirsty god. Part satire, part horror, Boys Weekend explores what it’s like to exist as a transfemme person in a man’s world, the difficulty of maintaining friendships through transition, and the more cult-like effects of masculinity, “hustle” culture, and capitalism—all through the vibrant lens of a surreal, scary, and immensely imaginative romp.",
        "coverurl": [
            "https://books.google.com/books/content?id=2ICHEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "15451"
        ]
    },
    {
        "mmsId": "9952433351701401",
        "SortDate": "2024-03-21",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Menzel, Max-Peter.; Henn, Sebastian, 1977-; Fornahl, Dirk, 1973-",
        "Author": null,
        "Format": "P",
        "isbn13": "9781848445222",
        "ISBNS": "1848445229; 9781848445222",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-21",
        "ReportingCode": "Course Reserves - 3 Hour",
        "Title": "Emerging Clusters : Theoretical, Empirical And Political Perspectives On The Initial Stage Of Cluster Evolution /",
        "VendorName": "Amazon",
        "LibraryName": "F.W. Olin Library",
        "LocationName": "Non-Fiction",
        "PermanentCallNumber": "338.9 E535 2021",
        "summary": "This book rigorously explores the critical, initial stage of cluster emergence in which the seeds for further growth are sown. Whether economic growth actually occurs, however, ultimately depends on various regional conditions and the processes in place",
        "coverurl": [
            "https://books.google.com/books/content?id=qWswmAEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "13385"
        ]
    },
    {
        "mmsId": "9952433352201401",
        "SortDate": "2024-04-08",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "O'Connor, Thomas H., 1922-2012.",
        "Format": "P",
        "isbn13": "9781555532468",
        "ISBNS": "9781555532468; 1555532462",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-04-08",
        "ReportingCode": null,
        "Title": "Building A New Boston : Politics And Urban Renewal, 1950-1970.",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "\"Here is one of the great stories in American urban history told by a great historian. In 1949, Boston was 'a hopeless backwater' . . . by 1970, a 'New Boston' had been created . . . Thomas O'Connor, the dean of Boston historians, brings to this tale of transformation rich learning, intimate familiarity with his subject, and a lucid sometimes witty pen.\" -- Jack Beatty, Senior Editor, Atlantic Monthly",
        "coverurl": [
            "https://books.google.com/books/content?id=U4A65Jef9VgC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "10694"
        ]
    },
    {
        "mmsId": "9952433352301401",
        "SortDate": "2024-04-08",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Eaton, Susan E., author.",
        "Format": "P",
        "isbn13": "9781684580293",
        "ISBNS": "9781684580309; 1684580307; 9781684580293; 1684580293",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-04-08",
        "ReportingCode": null,
        "Title": "The Other Boston Busing Story : What's Won And Lost Across The Boundary Line /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "METCO, America's longest-running voluntary school desegregation program, buses black children from Boston's city neighborhoods to predominantly white suburban schools. In contrast to the infamous violence and rage that greeted forced school busing within the city in the 1970s, the work of METCO has quietly and calmly promoted school integration. But how has this program affected the lives of its graduates? Would they choose to participate if they had it to do over again? Would they place their own children on the bus to suburbia? In The Other Boston Busing Story, sixty-five METCO graduates who are now adults answer those questions and more, vividly recalling their own stories and assessing the benefits and hardships of crossing racial and class lines on their way to school. As courts and policymakers today are forcing the abandonment of desegregation, this book offers an accessible and moving account of a rare program that, despite serious challenges, provides a practical remedy for the persistent inequalities in American education. This new edition puts the original findings in a contemporary context.",
        "coverurl": [
            "https://books.google.com/books/content?id=9-9FzQEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "11619"
        ]
    },
    {
        "mmsId": "9952433352401401",
        "isbn13": "9781737481348",
        "SortDate": "9999-99-99"
    },
    {
        "mmsId": "9952433352501401",
        "SortDate": "2024-04-01",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "Carroll, James.; McCorkle, Barbara B.; Seasholes, Nancy S.; Warner, Sam Bass, 1928-; Bosse, David C.; Mackin, Anne.; Turner, Amy.; Cobb, David A., 1945-; Krieger, Alex, 1951-",
        "Author": null,
        "Format": "P",
        "isbn13": "9780262112444",
        "ISBNS": "9780262611732; 0262611732; 9780262112444; 0262112442",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-04-01",
        "ReportingCode": null,
        "Title": "Mapping Boston /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "A lavishly illustrated tour of Boston through its cartography uses a wide historical, urban planning, and regional maps, as well as numerous illustrations, to show how the city was born, grew, and changed over the last three decades.",
        "coverurl": [
            "https://covers.openlibrary.org/b/isbn/9780262112444-L.jpg",
            40242
        ]
    },
    {
        "mmsId": "9952433352601401",
        "isbn13": "9781684580798",
        "SortDate": "9999-99-99"
    },
    {
        "mmsId": "9952433352701401",
        "isbn13": "9781017033656",
        "SortDate": "9999-99-99"
    },
    {
        "mmsId": "9952433752401401",
        "isbn13": "9781107159679",
        "SortDate": "9999-99-99"
    },
    {
        "mmsId": "9952437049901401",
        "SortDate": "2024-03-21",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "O'Neill, Gerard, author.",
        "Author": "Lehr, Dick, author.",
        "Format": "P",
        "isbn13": "9781782116240",
        "ISBNS": "9781610395533; 1610395530; 9781610391092; 1610391098; 9781891620409; 1891620401; 9781610396431; 161039643X; 9781610391689; 1610391683; 1782116249; 9781782116240",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-21",
        "ReportingCode": null,
        "Title": "Black Mass : Whitey Bulger, The Fbi, And A Devil's Deal /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "Now a major film starring Johnny Depp and Benedict Cumberbatch, Sienna Miller and Joel Edgerton.",
        "coverurl": [
            "https://books.google.com/books/content?id=l1MMrgEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "37648"
        ]
    },
    {
        "mmsId": "9952437152301401",
        "isbn13": "9781009335256",
        "SortDate": "9999-99-99"
    },
    {
        "mmsId": "9952437152401401",
        "SortDate": "2024-03-21",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Lehr, Dick.",
        "Format": "P",
        "isbn13": "9780061893988",
        "ISBNS": "9780060780999; 0060780991; 9780061893988; 0061893986",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-21",
        "ReportingCode": null,
        "Title": "The Fence : A Police Cover-up Along Boston's Racial Divide /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "“A monumental account of an urban travesty….[It] has all the earmarks of a classic.” —Dennis Lehane, New York Times bestselling author of Mystic River and Shutter Island Dick Lehr’s The Fence, subtitled, “A Police Cover-up Along Boston’s Racial Divide,” is a shocking true story of racism, brutality, official lies and negligence, when the truth about the savage beating of black plainclothes policeman by white officers was hidden behind a “blue wall of silence.” Respected journalist Lehr, winner of the Hancock Award, the Loeb Award, finalist for the Pulitzer Prize, and bestselling author of Black Mass and Judgment Ridge, sheds a brilliant light on all aspects of this powerful, disturbing event and its aftermath.",
        "coverurl": [
            "https://books.google.com/books/content?id=3xWvfuh-lXAC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "26890"
        ]
    },
    {
        "mmsId": "9952437152801401",
        "isbn13": "9780520943834",
        "SortDate": "9999-99-99"
    },
    {
        "mmsId": "9952437251901401",
        "SortDate": "2024-03-21",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Philbrick, Nathaniel.",
        "Format": "P",
        "isbn13": "9780670025442",
        "ISBNS": "9780143125327; 014312532X; 9780670025442; 0670025445",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-21",
        "ReportingCode": null,
        "Title": "Bunker Hill : A City, A Siege, A Revolution /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "The bestselling author of In the Heart of the Sea, Mayflower, and In the Hurricane's Eye tells the story of the Boston battle that ignited the American Revolution, in this \"masterpiece of narrative and perspective.\" (Boston Globe) In the opening volume of his acclaimed American Revolution series, Nathaniel Philbrick turns his keen eye to pre-Revolutionary Boston and the spark that ignited the American Revolution. In the aftermath of the Boston Tea Party and the violence at Lexington and Concord, the conflict escalated and skirmishes gave way to outright war in the Battle of Bunker Hill. It was the bloodiest conflict of the revolutionary war, and the point of no return for the rebellious colonists. Philbrick gives us a fresh view of the story and its dynamic personalities, including John Adams, Samuel Adams, John Hancock, Paul Revere, and George Washington. With passion and insight, he reconstructs the revolutionary landscape—geographic and ideological—in a mesmerizing narrative of the robust, messy, blisteringly real origins of America.",
        "coverurl": [
            "https://books.google.com/books/content?id=37eJDQAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
            "12861"
        ]
    },
    {
        "mmsId": "9952437252001401",
        "SortDate": "2024-03-21",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": null,
        "Author": "Carp, Benjamin L., author.",
        "Format": "P",
        "isbn13": "9780300178128",
        "ISBNS": "0300178123; 9780300178128",
        "MaterialType": "BOOK",
        "POLineTypeName": "Print Book - One Time",
        "ReceivingDate": "2024-03-21",
        "ReportingCode": null,
        "Title": "Defiance Of The Patriots : The Boston Tea Party & The Making Of America /",
        "VendorName": "Amazon.com",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "The Boston Tea Party of 1773 was an audacious and revolutionary act. It set the stage for war and cemented certain values in the American psyche. But why did the Tea Party happen? Whom did it involve? What did it mean? Benjamin L. Carp tells the story of the Tea Party--exploding myths, exploring the unique city life of Boston, and setting this extraordinary event in a global context. Bringing to life the diverse array of people and places that the Tea Party brought together--from Chinese tea-pickers to English businessmen, Native American tribes, sugar plantation slaves, and Boston's ladies of leisure--Carp illuminates how a determined group shook the foundations of a mighty empire, and what this has meant for Americans since",
        "coverurl": [
            "https://books.google.com/books/content?id=0LNmzgAACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "10116"
        ]
    },
    {
        "mmsId": "9952437352501401",
        "SortDate": "2024-03-22",
        "AcquisitionMethod": "VENDOR_SYSTEM",
        "AuthorContributor": "International Association for the Study of Pain, issuing body.; Sluka, Kathleen A. 1963- editor. (Kathleen Anne),",
        "Author": null,
        "Format": "E",
        "isbn13": "9781496343239",
        "ISBNS": "9781496343246; 1496343247; 9781496343239; 1496343239",
        "MaterialType": "BOOK",
        "POLineTypeName": "Electronic Book - One Time",
        "ReceivingDate": "0000-00-00",
        "ReportingCode": null,
        "Title": "Mechanisms And Management Of Pain For The Physical Therapist /",
        "VendorName": "Proquest LLC (Coutts Information Services Division)",
        "LibraryName": "Snell Library",
        "LocationName": null,
        "PermanentCallNumber": null,
        "summary": "No summary.",
        "coverurl": [
            "https://books.google.com/books/content?id=1USEjgEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api",
            "11881"
        ]
    }
]